Перем мВалютаРегламентированногоУчета Экспорт;

Процедура ПередЗаписью(Отказ)


	Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = "Запись банковского счета (" + Владелец + ") " + Наименование + ", код " + Код;
	
	Если НЕ ТолькоЦифрыВСтроке(СокрЛП(НомерСчета)) Тогда 
		СообщитьОбОшибке("В номере банковского счета присутствуют не только цифры. 
		|Возможно, номер указан неправильно", , Заголовок);
	КонецЕсли;

	// Проверка заполнения обязательных реквизитов
	Если ЗначениеНеЗаполнено(ВалютаДенежныхСредств) Тогда
		СообщитьОбОшибке("Не выбрана валюта.", Отказ, Заголовок);
	КонецЕсли;
	Если ЗначениеНеЗаполнено(ВидСчета) Тогда
		СообщитьОбОшибке("Не выбран вид счета.", Отказ, Заголовок);
	КонецЕсли;
	Если ВалютаДенежныхСредств = мВалютаРегламентированногоУчета Тогда
	
		Если ЗначениеНеЗаполнено(НомерСчета) Тогда
			СообщитьОбОшибке("Не указан номер счета.", Отказ, Заголовок);
		КонецЕсли;
		Если ЗначениеНеЗаполнено(Банк) Тогда
			СообщитьОбОшибке("Не выбран банк.", Отказ, Заголовок);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры


мВалютаРегламентированногоУчета = Константы.ОсновнаяВалютаУчета.Получить();
