
Процедура ОтправитьТребованиеНаПеревыгрузкуЧеков(ОбСмена,ТЗВыпавшихНомеров) Экспорт
	
	 Склад=ОбСмена.Склад;
	
	ТребованиеНаПеревыгрузку=Новый XBase;
	ТребованиеНаПеревыгрузку.поля.Добавить("date" ,"D" ,  , );
	ТребованиеНаПеревыгрузку.поля.Добавить("pnum" ,"S" ,10,);
	ТребованиеНаПеревыгрузку.поля.Добавить("snum" ,"N" ,11,0);
	ТребованиеНаПеревыгрузку.поля.Добавить("lostNum","N" ,15,0);
	
	Каталог = СокрЛП(Склад.КаталогОбмена);
	ИмяФайлаТребования=?(Прав(Каталог,1)="\",Каталог,Каталог+"\")+"lost_chk.dbf"; 
	
	ИмяАрхиваТребования=?(Прав(Каталог,1)="\",Каталог,Каталог+"\")+"lost_chk_"+ОбСмена.ИдСмены+".zip";
	
	
	
	ТребованиеНаПеревыгрузку.СоздатьФайл(ИмяФайлаТребования);
	
	
	Для Каждого Стр Из ТЗВыпавшихНомеров Цикл
		ТребованиеНаПеревыгрузку.Добавить();
		
		ТребованиеНаПеревыгрузку.date =ОбСмена.ДатаОткрытияСмены ;
		ТребованиеНаПеревыгрузку.pnum =ОбСмена.ЗаводскойНомерККМ ;
		ТребованиеНаПеревыгрузку.snum =ОбСмена.НомерСмены ;
		ТребованиеНаПеревыгрузку.lostNum=Стр.НомерЧека;
				
		ТребованиеНаПеревыгрузку.Записать();
	КонецЦикла;
	
	ТребованиеНаПеревыгрузку.ЗакрытьФайл();
	Попытка
		ОМ17_ЗапаковатьФайлИСкопироватьЕгоВПапку(ИмяФайлаТребования,ИмяАрхиваТребования);
		
		УдалитьФайлы(ИмяФайлаТребования);
	Исключение
	КонецПопытки;
	
	
	МодульРегламентныхЗаданий.Регламент_ВыручкаCSV_ЗаписьВЛог("Отправлено требование на перевыгрузку (склад"+Склад.Код+")","ПОТЕРИ!!!");

	
КонецПроцедуры



