
Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ЭтоНовый()=Истина Тогда
		Пока Найти(ЭтотОбъект.Наименование,"  ")<>0 Цикл
			ЭтотОбъект.Наименование= СтрЗаменить(ЭтотОбъект.Наименование,"  "," ");
		КонецЦикла; 
		
		//------------------<Не должно быть дублей наименований>-------------------GtG----04.12.2007
		
		Поиск=ВРЕг( ЭтотОбъект.Наименование);
		
		ТХТ="ВЫБРАТЬ
		|	ТорговыеНаименования.Ссылка
		|ИЗ
		|	Справочник.ТорговыеНаименования КАК ТорговыеНаименования
		|ГДЕ
		|	ТорговыеНаименования.Наименование = &Наименование";
		
		Запрос=Новый Запрос;
		Запрос.Текст=ТХТ;
		Запрос.УстановитьПараметр("Наименование",Поиск);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		
		Если  ТЗ.Количество()>0  Тогда  
			Предупреждение("Уже существует запись в справочнике!");
			Отказ=Истина;
		КонецЕсли; 
		
	КонецЕсли; 
	
	
	
КонецПроцедуры
