
Процедура ПередЗаписью(Отказ)
	
	Если (Цена = 0) Тогда
		Отказ = Истина;
	Иначе
			ТХТ="ВЫБРАТЬ
			    |	ЦеныГосРеестра.Ссылка
			    |ИЗ
			    |	Справочник.ЦеныГосРеестра КАК ЦеныГосРеестра
			    |ГДЕ
			    |	ЦеныГосРеестра.Производитель = &Производитель
			    |	И ЦеныГосРеестра.Владелец = &Владелец
			    |	И ЦеныГосРеестра.Ссылка <> &Ссылка
				|	И ЦеныГосРеестра.Баркод = &Баркод
			    |	И ЦеныГосРеестра.Цена = &Цена
			    |	И ЦеныГосРеестра.ЦенаВал = &ЦенаВал";
		
		Запрос=Новый Запрос;
		Запрос.Текст=ТХТ;
		Запрос.УстановитьПараметр("Баркод",Баркод);
		Запрос.УстановитьПараметр("Производитель",Производитель);
		Запрос.УстановитьПараметр("Владелец",Владелец);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("Цена",Цена);
		Запрос.УстановитьПараметр("ЦенаВал",ЦенаВал);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		
		Если  ТЗ.Количество()>0  Тогда  
			Предупреждение("Уже существует запись в справочнике с таким производителем!",5);
			Отказ=Истина;
		КонецЕсли; 
	КонецЕсли;
	
	
КонецПроцедуры
