//==========================================================GtG====
Функция ОМ17_РаспаковатьФайлВоВременныйКаталогИПереименоватьЕго (Архив,ИмяПереименованногоФайла)  Экспорт
	//----------------------------------
	//Назначение:
	//  Распаковывает файл из зипа во временный каталог и переименовывает в указанное имя файла
	//  фозвращает полное имя распакованного и переименованного файла
	// В АРХИВЕ ДОЛЖЕН БЫТЬ 1 ФАЙЛ!!!
	//----------------------------------
	ПолноеИмяПереименованногоФайла="";
	ЗИП= Новый ЧтениеZipФайла;
	Попытка
		ЗИП.Открыть(Архив);
		ЗипЭлем=Зип.Элементы.Получить(0); // первый и (должен быть единственный) файл в архиве
		ЗИП.Извлечь(ЗипЭлем,ПараметрыСеанса.КАТАЛОГ_ВРЕМЕННЫХ_ФАЙЛОВ,РежимВосстановленияПутейФайловZIP.НеВосстанавливать);	
	Исключение
		#Если Клиент Тогда
			Сообщить("БИТЫЙ АРХИВ! "+ОписаниеОшибки());
		#конецЕсли
		Возврат ПолноеИмяПереименованногоФайла;  // несуществующий  файл
	КонецПопытки; 
	
	
	// получим файл : ПараметрыСеанса.КАТАЛОГ_ВРЕМЕННЫХ_ФАЙЛОВ+"\"+  ЗипЭлем.Имя
	Инфо = Новый СистемнаяИнформация;
	Если Инфо.ТипПлатформы = ТипПлатформы.Linux_x86 или 
		Инфо.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		
		ИзвлеченныйФайл=ПараметрыСеанса.КАТАЛОГ_ВРЕМЕННЫХ_ФАЙЛОВ+"/"+  ЗипЭлем.Имя;
	Иначе
		ИзвлеченныйФайл=ПараметрыСеанса.КАТАЛОГ_ВРЕМЕННЫХ_ФАЙЛОВ+"\"+  ЗипЭлем.Имя;
	КонецЕсли;
	
	

	ПолноеИмяПереименованногоФайла=ПараметрыСеанса.КАТАЛОГ_ВРЕМЕННЫХ_ФАЙЛОВ+ИмяПереименованногоФайла;
	Попытка
		ПереместитьФайл(ИзвлеченныйФайл,ПолноеИмяПереименованногоФайла);	//C:\Documents and Settings\n.gorodsky\Local Settings\Temp\KKM_tmp.DBF
	Исключение
	КонецПопытки;
	
	Возврат ПолноеИмяПереименованногоФайла;	
КонецФункции	//ОМ17_РаспаковатьФайлВоВременныйКаталогИПереименоватьЕго
//==========================================================GtG====

//==========================================================GtG====
Процедура ОМ17_ЗапаковатьФайлИСкопироватьЕгоВПапку (Файл,ЗипьФайл) Экспорт 
	//----------------------------------
	//Назначение:
	//  Зипует файл в архив в указанном месте 
	//----------------------------------
	
Зипь= Новый ЗаписьZipФайла;
Зипь.Открыть(ЗипьФайл,,,МетодСжатияZIP.Сжатие,УровеньСжатияZIP.Максимальный);
Зипь.Добавить(Файл,РежимСохраненияПутейZIP.НеСохранятьПути,РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
Зипь.Записать();

КонецПроцедуры	//ОМ17_ЗапаковатьФайлИСкопироватьЕгоВПапку
//==========================================================GtG====

Функция ОМ17_ПроверитьИСоздатьКаталог(ИмяКаталога) Экспорт
	
    КаталогНаДиске = Новый Файл(ИмяКаталога);
    Если КаталогНаДиске.Существует() Тогда
        Возврат Истина;
	Иначе
		Попытка
        	СоздатьКаталог(ИмяКаталога);
        	Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;
    КонецЕсли;
	
КонецФункции


  