Перем СписокНеПроводныхСтатусов экспорт;

Процедура ЗаписьВИзменения(КомментарийИзменения) Экспорт
	СтрИзм=Изменения.Добавить();
	СтрИзм.Дата=ТекущаяДата();
	СтрИзм.КомментарийИзменения=КомментарийИзменения;
	СтрИзм.ТипИзм=СтатусЗаказа;
	СтрИзм.Сотрудник=ПараметрыСеанса.ТекущийСотр;
Конецпроцедуры




Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = Товар.Итог("Сумма");
	СуммаСоСкидкой = Товар.Итог("СуммаСоСкидкой");
	
	Если ЭтоНовый() или СтатусЗаказа.Пустая()Тогда
		СтатусЗаказа=Перечисления.ИА_СтатусЗаказа.Зарегистрирован;
		ЗаписьВИзменения("Зарегистрирован новый заказ "+ТекущаяДата());
	КонецЕсли;	
	
	Если СтатусЗаказа=Перечисления.ИА_СтатусЗаказа.НеКомплект И  //был некомплект
		ТОвар.Найти(Перечисления.ИА_СтатусСтрокиЗаказа.Дефектура,"СтатусСтроки")=Неопределено и //но нет дефектурных позиций
		ТОвар.Найти(Перечисления.ИА_СтатусСтрокиЗаказа.Заказан,"СтатусСтроки")<>Неопределено // зато есть заказанные у поставщика
		И
		СтатусЗаказа<>Перечисления.ИА_СтатусЗаказа.НекомплектЗаказан // и еще не проставлен правильный статус
		ТОгда
		СтатусЗаказа=Перечисления.ИА_СтатусЗаказа.НекомплектЗаказан;
		ЗаписьВИзменения("Вся дефектура заказана у поставщиков");
	Иначе
		ЗаписьВИзменения("Изменен статус заказа");
	КонецЕсли;
	
	Если Проведен=Истина Тогда
		Если РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения Тогда
			РежимЗаписи=РежимЗаписиДокумента.Проведение; // Проведенный документ нельзя просто записать. обязательно перепровести
			#If Client then
			Состояние("Перепроводим заказ ");                // Это связано с заменой курьера на любом этапе жизни заказа.
			#EndIf
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ Товар.Найти(0,"Цена") = Неопределено Тогда
		ЕстьТоварСЦенойНоль = Истина;
	Иначе
		ЕстьТоварСЦенойНоль = Ложь;
	КонецЕсли;
	
	ФамилияДляПоиска=Клиент.Фамилия;
	
	ТребуемаяСуммаПредоплаты = Окр(Товар.Итог("СуммаСоСкидкой") * ТребуемыйПроцентПредоплаты / 100 + 0.5, 0, 0); //Округляем до целого в бОльшую сторону
	
	Если ПроинформироватьКлиентаОПредоплате И Не ЗначениеЗаполнено(Емэйл) Тогда
		ПроинформироватьКлиентаОПредоплате = Ложь;
	КонецЕсли;
	
	Если ДляКлиники Тогда
		Для Каждого ТекСтрока Из Товар Цикл
			ТекСтрока.Цена	= 0;
			ТекСтрока.Сумма	= 0;
			
			ТекСтрока.ЦенаСоСкидкой		= 0;
			ТекСтрока.СуммаСоСкидкой	= 0;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если СписокНеПроводныхСтатусов.НайтиПоЗначению(СтатусЗаказа)<>Неопределено Тогда
		Отказ=Истина;
		#IF CLIENT THEN
		Предупреждение("В этом статусе заказ не проводится!",5);
		#ENDIF
		Возврат;
	КонецЕСли;	
	
	ЗаписьВИзменения("Заказ проведен "+ТекущаяДата());
	
	Движения.УчетДенегВИнтернетАптеке.Очистить();
	
	Если  СтатусЗаказа=Перечисления.ИА_СтатусЗаказа.ВПути или 
	      СтатусЗаказа=Перечисления.ИА_СтатусЗаказа.Оплачен или 
		  (СтатусЗаказа=Перечисления.ИА_СтатусЗаказа.Отказ и ЧекПробит=истина)
		  тогда
		  // долг вешается на курьера когда заказ в пути или оплачен и когда пробит чек.
		  
		  Запрос=Новый Запрос("ВЫБРАТЬ
		                      |	IsNull(СУММА(base.Сумма),0) КАК Сумма
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		ЧекВозвратаТовар.Сумма КАК Сумма
		                      |	ИЗ
		                      |		Документ.ЧекВозврата.Товар КАК ЧекВозвратаТовар
		                      |	ГДЕ
		                      |		ЧекВозвратаТовар.Ссылка.ДокументОснование = &Ссылка
		                      |		И ЧекВозвратаТовар.Ссылка.ЧекПробитНаККМ = ИСТИНА
		                      |		И ЧекВозвратаТовар.Ссылка.Проведен = ЛОЖЬ
		                      |	
		                      |	ОБЪЕДИНИТЬ ВСЕ
		                      |	
		                      |	ВЫБРАТЬ
		                      |		ЧекВозвратаАвансыПоУслугам.Сумма
		                      |	ИЗ
		                      |		Документ.ЧекВозврата.АвансыПоУслугам КАК ЧекВозвратаАвансыПоУслугам
		                      |	ГДЕ
		                      |		ЧекВозвратаАвансыПоУслугам.Ссылка.ДокументОснование = &Ссылка
		                      |		И ЧекВозвратаАвансыПоУслугам.Ссылка.ЧекПробитНаККМ = ИСТИНА
		                      |		И ЧекВозвратаАвансыПоУслугам.Ссылка.Проведен = ЛОЖЬ) КАК base");
							  
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Рез=Запрос.Выполнить().Выгрузить();
		Если Рез.Количество()=0 тогда
			ВозвратнаяСумма=0;
		Иначе	
			ВозвратнаяСумма=Рез.Получить(0).Сумма;
		КонецЕсли;	
			
		 СуммыПоСтатусам= Товар.Выгрузить(,"СтатусСтроки,СуммаСоСкидкой");
		 СуммыПоСтатусам.Свернуть("СтатусСтроки","СуммаСоСкидкой");
		 
		 
		 
		 //---------------<Если есть строка непробиваемая в инетаптеке>---------------------------// GtG // 12.11.2012 20:55:12
		 НеПробиваемаяСумма=0;
		 
		 НПС=СуммыПоСтатусам.Найти(Перечисления.ИА_СтатусСтрокиЗаказа.НеПробивать,"СтатусСтроки");
		 Если  НПС<>Неопределено ТОгда
			 НеПробиваемаяСумма=НПС.СуммаСоСкидкой;
		КонецЕсли;	 
		//---------------<-------------------------------------------->---------------------------// GtG // 12.11.2012 20:55:16 
		 
		  
		  
		  
		  ДДВА=Движения.УчетДенегВИнтернетАптеке.Добавить();
		  
	      ДДВА.Активность=Истина;
		  ДДВА.ВидДвижения=ВидДвиженияНакопления.Приход;
		  ДДВА.ЗаказОтПокупателя=ЭтотОбъект.Ссылка;
		  ДДВА.Курьер=Курьер;
		  ДДВА.Период=Дата;
		  ДДВА.Регистратор=ЭтотОбъект.Ссылка;
		  ДДВА.Сумма= товар.Итог("СуммаСоСкидкой") + Доставка.Цена-ВозвратнаяСумма-НеПробиваемаяСумма; // курьер едет со своим баблом в аптеку и покупает там непробиваемую строку.
		  																							   //т.е. бабло в кассе той аптеки есть. 
																									   //потеряет товар - пох, уже оплачено. 
																									   //Интересует тот товар который везется с интернет аптеки, без бабла.
		  ДДВА.Фирма=Склад.Фирма;
	      ДДВА.Склад=Склад;
	  
	
	КонецЕсли;      
	
	Движения.УчетДенегВИнтернетАптеке.Записать();
	
	
КонецПроцедуры


Функция НомерЗаказаДляПечати()
	
	Если ПустаяСтрока(ТипИсточника)=Истина ТОгда
		Возврат Формат(НомерЗаказа,"ЧГ=0");
	Иначе
		Возврат ""+ТипИсточника+"-"+Формат(НомерЗаказа,"ЧГ=0");
    КонецЕсли;
КонецФункции



Процедура МО_Печать(ПФЗаказ=Истина, ПФТоварныйЧек=Истина,ПФСборочныйЛист=Ложь,СразуВывестиНаПринтер=Неопределено,ОтправитьПоМылу=Ложь, колвоЭкз=1) Экспорт // для возможности печати не открывая сам документ
	//ПРедупреждение("Печать пока что не работает");
	НомерДляПечати=НомерЗаказаДляПечати();
	
	ДатаДляПечати= Формат(ЭтотОбъект.ДатаЗаказа,"ДЛФ=D");
	ДатаДоставкиДляПечати=Формат(ЭтотОбъект.ДатаОтгрузки,"ДЛФ=D");
	ФорматЧисел="ЧДЦ=2; ЧРД=-; ЧГ=0";
	
	Если ПФТоварныйЧек=Истина ТОгда
		//---------------<Товарный Чек>---------------------------// GtG // 01.10.2012 12:35:05
		ТабТЧ=Новый ТабличныйДокумент;
		ТабТЧ.ТолькоПросмотр=Истина;
		ТабТЧ.ОтображатьЗаголовки=Ложь;
		ТабТЧ.ОтображатьСетку=Ложь;
		ТабТЧ.АвтоМасштаб=Истина;
		ТабТЧ.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		
		Макет=ЭтотОбъект.ПолучитьМакет("ТоварныйЧек");
		Область=Макет.ПолучитьОбласть("Шапка");
		
		
		Область.Параметры.Орагнизация=?(ПустаяСтрока(Склад.Фирма.ДлинноеНаименование)=Истина,ФизическаяАптека.Фирма.ДлинноеНаименование,Склад.Фирма.ДлинноеНаименование); // хоть где-то склад есть
		
		
		Область.Параметры.НомерЗаказаДляПечати=НомерДляПечати;
		Область.Параметры.ДатаПечати=ДатаДляПечати;
		
		Область.Параметры.Клиент=Клиент.Наименование;				
		Область.Параметры.Адрес=АдресДоставки;
		Область.Параметры.ДатаДоставки=Формат(ДатаОтгрузки,"ДЛФ=D");
		
		ТабТЧ.Вывести(Область);
		
		
		
		НН=0;
		Для Каждого Стр Из Товар Цикл
			НН=НН+1;
			Область=Макет.ПолучитьОбласть("Строка");
			Область.Параметры.НН=НН;
			Область.Параметры.Наименование=СокрЛП(Стр.Товар.Наименование);
			Область.Параметры.Цена	=Формат(Стр.ЦенаСоСкидкой,ФорматЧисел);
			Область.Параметры.Количество=Стр.Количество;
			Область.Параметры.Сумма=Формат(Стр.СуммаСоСкидкой,ФорматЧисел);
			ТабТЧ.Вывести(Область);
		КонецЦикла;
		
		
		Область=Макет.ПолучитьОбласть("Подвал");
		
		Область.Параметры.КолвоПозиций=НН;
		Область.Параметры.СуммаЗаказа=Формат(Товар.Итог("СуммаСоСкидкой"),ФорматЧисел);
		Область.Параметры.Итого=Формат(Товар.Итог("СуммаСоСкидкой"),ФорматЧисел);
		Область.Параметры.ИтогоПрописью=ЧислоПрописью(Товар.Итог("СуммаСоСкидкой"),"НП=истина;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"); 
		
		
		
		
		
		ТабТЧ.Вывести(Область);
		
		
		
		ТабТЧ.Показать("ТЧ №"+НомерДляПечати+" от "+ДатаДляПечати,"ТЧ №"+НомерДляПечати+" от "+ДатаДляПечати);
	КонецЕсли;
	
	Если ПФЗаказ=Истина ТОгда
		//---------------<Бланк заказа>---------------------------// GtG // 01.10.2012 12:35:13
		ТабЗак=Новый ТабличныйДокумент;
		ТабЗак.ТолькоПросмотр=Истина;
		ТабЗак.ОтображатьЗаголовки=Ложь;
		ТабЗак.ОтображатьСетку=Ложь;
		ТабЗак.АвтоМасштаб=Истина;
		ТабЗак.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		
		
		Макет=ЭтотОбъект.ПолучитьМакет("Заказ");
		
		//ТСО 13.08.2014
		КодСайта = Сайт.Код;
		
		Если КодСайта = 1 Тогда //Аптеки АВЕ
			Область = Макет.ПолучитьОбласть("ЗаголовокАВЕ");
			
		ИначеЕсли КодСайта = 2 Тогда //Аптеки 36.6
			Область = Макет.ПолучитьОбласть("Заголовок366");
			
		ИначеЕсли КодСайта = 3 Тогда // Стар и Млад
			Область = Макет.ПолучитьОбласть("ЗаголовокСиМ");
			
		ИначеЕсли КодСайта = 4 Тогда // ГорЗдрав
			Область = Макет.ПолучитьОбласть("ЗаголовокГЗ");
			
		Иначе
			//Область = Макет.ПолучитьОбласть("ЗаголовокСтарый");
			Возврат;
		КонецЕсли;
		
		Область.Параметры.ИДЗаказа = Формат(Номер, "ЧГ=0");
		
		ТабЗак.Вывести(Область);
		//*ТСО
		
		Область=Макет.ПолучитьОбласть("Шапка1");
		
		
		
		Область.Параметры.НомерЗаказа	=НомерДляПечати;	
		Область.Параметры.ДатаДоставки	=ДатаДоставкиДляПечати;
		Область.Параметры.ДатаЗаказа=	ДатаДляПечати;	
		
		Область.Параметры.Телефон	=	Телефон+" "+ДопТелефон;						
		Область.Параметры.АдресДоставки=АдресДоставки;				
		Область.Параметры.СтанцияМетро= Метро;
		Область.Параметры.Проезд	= Проезд;							
		
		Область.Параметры.ФИОКлиента=ФИОКлиента;								
		
		Область.Параметры.ВремяДоставки=ВремяДоставки;
		Область.Параметры.ПроДК=?(ВыдатьДК=Истина,"Выдать дисконтную карту", "");
		
		//ТСО 31.07.2014
		//Область.Параметры.ИДЗаказа=Формат(Номер,"ЧГ=0");//"#"+Формат(Номер,"ЧГ=0")+"#"+Формат(Дата,"ДФ=yyyyMMdd")+"#";
		//*ТСО
		
		ТабЗак.Вывести(Область);
		
		
		//---------------<табличко>---------------------------// GtG // 15.10.2012 14:53:20
		//Макет=ЭтотОбъект.ПолучитьМакет("ТоварныйЧек");
		Область=Макет.ПолучитьОбласть("НаноШапка");
		//Область.Параметры.Клиент=Клиент.Наименование;				
		//Область.Параметры.Адрес=АдресДоставки;
		//Область.Параметры.ДатаДоставки=Формат(ДатаОтгрузки,"ДЛФ=D");
		
		ТабЗак.Вывести(Область);

		//---------------<Табличка для заполнения колонки Скл. (в смысле имеетли смысл идти его искать)>---------------------------// GtG // 18.10.2012 0:55:54
		//Запрос=Новый Запрос("ВЫБРАТЬ
		//					|	ИнтернетЗаказТовар.Товар,
		//					|	СУММА(ИнтернетЗаказТовар.Количество * ИнтернетЗаказТовар.К) КАК Колвоминед,
		//					|	ИнтернетЗаказТовар.ЦенаСоСкидкой
		//					|ПОМЕСТИТЬ зактовар
		//					|ИЗ
		//					|	Документ.ИнтернетЗаказ.Товар КАК ИнтернетЗаказТовар
		//					|ГДЕ
		//					|	ИнтернетЗаказТовар.Ссылка = &Ссылка
		//					|
		//					|СГРУППИРОВАТЬ ПО
		//					|	ИнтернетЗаказТовар.Товар,
		//					|	ИнтернетЗаказТовар.ЦенаСоСкидкой
		//					|;
		//					|
		//					|////////////////////////////////////////////////////////////////////////////////
		//					|ВЫБРАТЬ
		//					|	зактовар.Товар,
		//					|	зактовар.ЦенаСоСкидкой,
		//					|	зактовар.Колвоминед,
		//					|	ПартииЖНВЛСОстатки.КолвоОстаток,
		//					|	ВЫБОР
		//					|		КОГДА ПартииЖНВЛСОстатки.КолвоОстаток <> 0
		//					|			ТОГДА ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток / ПартииЖНВЛСОстатки.КолвоОстаток
		//					|		ИНАЧЕ 0
		//					|	КОНЕЦ КАК Ценаост,
		//					|	ПартииЖНВЛСОстатки.Партия
		//					|ПОМЕСТИТЬ т2
		//					|ИЗ
		//					|	зактовар КАК зактовар
		//					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииЖНВЛС.Остатки(, Склад = &Склад) КАК ПартииЖНВЛСОстатки
		//					|		ПО зактовар.Товар = ПартииЖНВЛСОстатки.Товар
		//					|			И (ПартииЖНВЛСОстатки.Склад = &Склад)
		//					|;
		//					|
		//					|////////////////////////////////////////////////////////////////////////////////
		//					|ВЫБРАТЬ
		//					|	т2.Товар,
		//					|	т2.ЦенаСоСкидкой,
		//					|	т2.Колвоминед,
		//					|	т2.КолвоОстаток,
		//					|	т2.Ценаост,
		//					|	т2.Партия
		//					|ПОМЕСТИТЬ t3
		//					|ИЗ
		//					|	т2 КАК т2
		//					|ГДЕ
		//					|	т2.Ценаост + т2.Ценаост / 100 * 4 <= т2.ЦенаСоСкидкой
		//					|;
		//					|
		//					|////////////////////////////////////////////////////////////////////////////////
		//					|ВЫБРАТЬ
		//					|	t3.Товар,
		//					|	t3.ЦенаСоСкидкой,
		//					|	t3.Колвоминед,
		//					|	СУММА(t3.КолвоОстаток) КАК КолвоОстаток
		//					|ПОМЕСТИТЬ t4
		//					|ИЗ
		//					|	t3 КАК t3
		//					|
		//					|СГРУППИРОВАТЬ ПО
		//					|	t3.Товар,
		//					|	t3.ЦенаСоСкидкой,
		//					|	t3.Колвоминед
		//					|;
		//					|
		//					|////////////////////////////////////////////////////////////////////////////////
		//					|ВЫБРАТЬ
		//					|	t4.Товар,
		//					|	t4.ЦенаСоСкидкой,
		//					|	t4.Колвоминед,
		//					|	ВЫБОР
		//					|		КОГДА t4.КолвоОстаток >= t4.Колвоминед
		//					|			ТОГДА ИСТИНА
		//					|		ИНАЧЕ ЛОЖЬ
		//					|	КОНЕЦ КАК ИмеетСмыслИдти
		//					|ИЗ
		//					|	t4 КАК t4");
		//
		//Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		//Запрос.УстановитьПараметр("Склад", ЭтотОбъект.ФизическаяАптека);
		//
		//ТЗДляСборки=Запрос.Выполнить().Выгрузить();
		//
		//
		////---------------<>---------------------------// GtG // 18.10.2012 0:56:01
		
		
		НН=0;
		Для Каждого Стр Из Товар Цикл
			НН=НН+1;
			Область=Макет.ПолучитьОбласть("Строка");
			Область.Параметры.НН=НН;
			Область.Параметры.Наименование=СокрЛП(Стр.Товар.Наименование);
			Область.Параметры.Цена	=Формат(Стр.Цена,ФорматЧисел);
			Область.Параметры.Количество=Стр.Количество;
			Область.Параметры.Сумма=Формат(Стр.Сумма,ФорматЧисел);
			Область.Параметры.СуммаСК=Формат(Стр.Сумма-Стр.СуммаСоСкидкой,ФорматЧисел);
			Область.Параметры.СуммаСоСк=Формат(Стр.СуммаСоСкидкой,ФорматЧисел);
			
			//Смысл=ТЗДляСборки.НайтиСтроки(Новый Структура("ЦенаСоСкидкой,ИмеетСмыслИдти",Стр.ЦенаСоСкидкой,Истина));
			//Если Смысл.Количество()=0 ТОгда
			//	ЕстьСмысл=" х ";
			//Иначе
			//	ЕстьСмысл=" V ";
			//КонецЕсли;
			//
			// Область.Параметры.Скл= ЕстьСмысл ;
			
			
			
			
			ТабЗак.Вывести(Область);
		КонецЦикла;
		
		Область=Макет.ПолучитьОбласть("ИТОГО");
		Область.Параметры.Сумма	    = Формат(Товар.Итог("Сумма"),ФорматЧисел);
		Область.Параметры.СуммаСК	= Формат(Товар.Итог("Сумма")-Товар.Итог("СуммаСоСкидкой"),ФорматЧисел);
		Область.Параметры.СуммаСоСк = Формат(Товар.Итог("СуммаСоСкидкой"),ФорматЧисел);
        ТабЗак.Вывести(Область);
		
		
		
		Область=Макет.ПолучитьОбласть("ПодвалДляЗаказа");
		
		Область.Параметры.КолвоПозиций=НН;
		Область.Параметры.СуммаЗаказа=Формат(Товар.Итог("СуммаСоСкидкой"),ФорматЧисел);
		Область.Параметры.Итого=Формат(Товар.Итог("СуммаСоСкидкой"),ФорматЧисел);
		Область.Параметры.ИтогоПрописью=ЧислоПрописью(Товар.Итог("СуммаСоСкидкой"),"НП=истина;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"); 
		Область.Параметры.КУрьер=Курьер;
		Область.Параметры.Доставка=Формат(Доставка.Цена,"ЧДЦ=2; ЧРД=-; ЧГ=0;ЧН=Бесплатно");
		ИтогоСДоставкой=Товар.Итог("СуммаСоСкидкой")+Доставка.Цена;
		Область.Параметры.ИтогоСДоставкой= ИтогоСДоставкой;
		Область.Параметры.ИтогоСДоставкойПрописью=ЧислоПрописью(ИтогоСДоставкой,"НП=истина;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");

		
		
		
		
		ТабЗак.Вывести(Область);

		//---------------<Продолжение шапко>---------------------------// GtG // 15.10.2012 14:53:35
		
		Область=Макет.ПолучитьОбласть("Шапка2");
		Область.Параметры.Доставка=Доставка;
		
		ТабЗак.Вывести(Область);

		
		
		
		
		
		
		
		Если СразуВывестиНаПринтер=Неопределено Тогда
			ТабЗак.Показать("Заказ №"+НомерДляПечати+" от "+ДатаДляПечати,"Заказ №"+НомерДляПечати+" от "+ДатаДляПечати);
		Иначе
			ТабЗак.ИмяПринтера=СразуВывестиНаПринтер;
			ТабЗак.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
		КонецЕсли;	
		
	КонецЕсли;
	
	
	Если ПФСборочныйЛист=Истина ТОгда
		//---------------<Сборочный Лист>---------------------------// GtG // 01.10.2012 12:35:13
		ТабЗак=Новый ТабличныйДокумент;
		ТабЗак.ТолькоПросмотр=Истина;
		ТабЗак.ОтображатьЗаголовки=Ложь;
		ТабЗак.ОтображатьСетку=Ложь;
		ТабЗак.АвтоМасштаб=Истина;
		ТабЗак.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		ТабЗак.КоличествоЭкземпляров=колвоЭкз;
		
		
		Макет=ЭтотОбъект.ПолучитьМакет("СборочныйЛист");
		Область=Макет.ПолучитьОбласть("Шапка1");
		
		
		
		
		Область.Параметры.НомерЗаказа	=НомерДляПечати;	
		Область.Параметры.ДатаДоставки	=ДатаДоставкиДляПечати;
		Область.Параметры.ДатаЗаказа=	ДатаДляПечати;	
		
		Область.Параметры.Телефон	=	Телефон+" "+ДопТелефон;						
		Область.Параметры.АдресДоставки=АдресДоставки;				
		Область.Параметры.СтанцияМетро= Метро;
		Область.Параметры.Проезд	= Проезд;							
		
		Область.Параметры.ФИОКлиента=ФИОКлиента;								
		
		Область.Параметры.ВремяДоставки=ВремяДоставки;
		Область.Параметры.ПроДК=?(ВыдатьДК=Истина,"Выдать дисконтную карту", "");
		Область.Параметры.ИДЗаказа=Формат(Номер,"ЧГ=0");//"#"+Формат(Номер,"ЧГ=0")+"#"+Формат(Дата,"ДФ=yyyyMMdd")+"#";
		
		ТабЗак.Вывести(Область);
		
		
		//---------------<табличко>---------------------------// GtG // 15.10.2012 14:53:20
		//Макет=ЭтотОбъект.ПолучитьМакет("ТоварныйЧек");
		Область=Макет.ПолучитьОбласть("НаноШапка");
		//Область.Параметры.Клиент=Клиент.Наименование;				
		//Область.Параметры.Адрес=АдресДоставки;
		//Область.Параметры.ДатаДоставки=Формат(ДатаОтгрузки,"ДЛФ=D");
		
		ТабЗак.Вывести(Область);

		////---------------<Табличка для заполнения колонки Скл. (в смысле имеетли смысл идти его искать)>---------------------------// GtG // 18.10.2012 0:55:54
		//Запрос=Новый Запрос("ВЫБРАТЬ
		//					|	ИнтернетЗаказТовар.Товар,
		//					|	СУММА(ИнтернетЗаказТовар.Количество * ИнтернетЗаказТовар.К) КАК Колвоминед,
		//					|	ИнтернетЗаказТовар.ЦенаСоСкидкой
		//					|ПОМЕСТИТЬ зактовар
		//					|ИЗ
		//					|	Документ.ИнтернетЗаказ.Товар КАК ИнтернетЗаказТовар
		//					|ГДЕ
		//					|	ИнтернетЗаказТовар.Ссылка = &Ссылка
		//					|
		//					|СГРУППИРОВАТЬ ПО
		//					|	ИнтернетЗаказТовар.Товар,
		//					|	ИнтернетЗаказТовар.ЦенаСоСкидкой
		//					|;
		//					|
		//					|////////////////////////////////////////////////////////////////////////////////
		//					|ВЫБРАТЬ
		//					|	зактовар.Товар,
		//					|	зактовар.ЦенаСоСкидкой,
		//					|	зактовар.Колвоминед,
		//					|	ПартииЖНВЛСОстатки.КолвоОстаток,
		//					|	ВЫБОР
		//					|		КОГДА ПартииЖНВЛСОстатки.КолвоОстаток <> 0
		//					|			ТОГДА ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток / ПартииЖНВЛСОстатки.КолвоОстаток
		//					|		ИНАЧЕ 0
		//					|	КОНЕЦ КАК Ценаост,
		//					|	ПартииЖНВЛСОстатки.Партия
		//					|ПОМЕСТИТЬ т2
		//					|ИЗ
		//					|	зактовар КАК зактовар
		//					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииЖНВЛС.Остатки(, Склад = &Склад) КАК ПартииЖНВЛСОстатки
		//					|		ПО зактовар.Товар = ПартииЖНВЛСОстатки.Товар
		//					|			И (ПартииЖНВЛСОстатки.Склад = &Склад)
		//					|;
		//					|
		//					|////////////////////////////////////////////////////////////////////////////////
		//					|ВЫБРАТЬ
		//					|	т2.Товар,
		//					|	т2.ЦенаСоСкидкой,
		//					|	т2.Колвоминед,
		//					|	т2.КолвоОстаток,
		//					|	т2.Ценаост,
		//					|	т2.Партия
		//					|ПОМЕСТИТЬ t3
		//					|ИЗ
		//					|	т2 КАК т2
		//					|ГДЕ
		//					|	т2.Ценаост + т2.Ценаост / 100 * 4 <= т2.ЦенаСоСкидкой
		//					|;
		//					|
		//					|////////////////////////////////////////////////////////////////////////////////
		//					|ВЫБРАТЬ
		//					|	t3.Товар,
		//					|	t3.ЦенаСоСкидкой,
		//					|	t3.Колвоминед,
		//					|	СУММА(t3.КолвоОстаток) КАК КолвоОстаток
		//					|ПОМЕСТИТЬ t4
		//					|ИЗ
		//					|	t3 КАК t3
		//					|
		//					|СГРУППИРОВАТЬ ПО
		//					|	t3.Товар,
		//					|	t3.ЦенаСоСкидкой,
		//					|	t3.Колвоминед
		//					|;
		//					|
		//					|////////////////////////////////////////////////////////////////////////////////
		//					|ВЫБРАТЬ
		//					|	t4.Товар,
		//					|	t4.ЦенаСоСкидкой,
		//					|	t4.Колвоминед,
		//					|	ВЫБОР
		//					|		КОГДА t4.КолвоОстаток >= t4.Колвоминед
		//					|			ТОГДА ИСТИНА
		//					|		ИНАЧЕ ЛОЖЬ
		//					|	КОНЕЦ КАК ИмеетСмыслИдти
		//					|ИЗ
		//					|	t4 КАК t4");
		//
		//Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		//Запрос.УстановитьПараметр("Склад", ЭтотОбъект.ФизическаяАптека);
		//
		//ТЗДляСборки=Запрос.Выполнить().Выгрузить();
		//
		//
		////---------------<>---------------------------// GtG // 18.10.2012 0:56:01
		
		
		НН=0;
		Для Каждого Стр Из Товар Цикл
			НН=НН+1;
			Область=Макет.ПолучитьОбласть("Строка");
			Область.Параметры.НН=НН;
			Область.Параметры.Наименование=СокрЛП(Стр.Товар.Наименование);
			Область.Параметры.Цена	=Формат(Стр.ЦенаСоСкидкой,ФорматЧисел);
			Область.Параметры.Количество=Стр.Количество;
			Область.Параметры.Сумма=Формат(Стр.СуммаСоСкидкой,ФорматЧисел);
			
			Область.Параметры.Сборка="";//?(Стр.СтатусСтроки=Перечисления.ИА_СтатусСтрокиЗаказа.Собран,Стр.СтатусСтроки,"");
			Область.Параметры.СтатусСтр=?(Стр.СтатусСтроки=Перечисления.ИА_СтатусСтрокиЗаказа.НеПробивать,"доп. чек",Стр.СтатусСтроки);
			Область.Параметры.Комментарий=СокрЛП(Стр.ПримечаниеПоСтроке);
			Область.Параметры.Источник=Стр.НомерАптеки;
			
			
			//
			//Смысл=ТЗДляСборки.НайтиСтроки(Новый Структура("ЦенаСоСкидкой,ИмеетСмыслИдти",Стр.ЦенаСоСкидкой,Истина));
			//Если Смысл.Количество()=0 ТОгда
			//	ЕстьСмысл=" х ";
			//Иначе
			//	ЕстьСмысл=" V ";
			//КонецЕсли;
			//
			// Область.Параметры.Скл= ЕстьСмысл ;
			
			
			
			
			ТабЗак.Вывести(Область);
		КонецЦикла;
		
		
		Область=Макет.ПолучитьОбласть("ПодвалДляЗаказа");
		
		Область.Параметры.КолвоПозиций=НН;
		Область.Параметры.СуммаЗаказа=Формат(Товар.Итог("СуммаСоСкидкой"),ФорматЧисел);
		Область.Параметры.Итого=Формат(Товар.Итог("СуммаСоСкидкой"),ФорматЧисел);
		Область.Параметры.ИтогоПрописью=ЧислоПрописью(Товар.Итог("СуммаСоСкидкой"),"НП=истина;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"); 
		Область.Параметры.КУрьер=Курьер;
		Область.Параметры.Доставка=Доставка.Цена;
		ИтогоСДоставкой=Товар.Итог("СуммаСоСкидкой")+Доставка.Цена;
		Область.Параметры.ИтогоСДоставкой= ИтогоСДоставкой;
		Область.Параметры.ИтогоСДоставкойПрописью=ЧислоПрописью(ИтогоСДоставкой,"НП=истина;ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");

		
		
		
		
		ТабЗак.Вывести(Область);

		//---------------<Продолжение шапко>---------------------------// GtG // 15.10.2012 14:53:35
		
		Область=Макет.ПолучитьОбласть("Шапка2");
		Область.Параметры.Доставка=Доставка;
		
		ТабЗак.Вывести(Область);

		
		
		
		
		
		
		
		Если СразуВывестиНаПринтер=Неопределено Тогда
			ТабЗак.Показать("Заказ №"+НомерДляПечати+" от "+ДатаДляПечати,"Заказ №"+НомерДляПечати+" от "+ДатаДляПечати);
		Иначе
			ТабЗак.ИмяПринтера=СразуВывестиНаПринтер;
			ТабЗак.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
		КонецЕсли;	
		
	КонецЕсли;

	
	
	
КонецПроцедуры 	

СписокНеПроводныхСтатусов=Новый СписокЗначений;
СписокНеПроводныхСтатусов.Добавить(Перечисления.ИА_СтатусЗаказа.Зарегистрирован);
СписокНеПроводныхСтатусов.Добавить(Перечисления.ИА_СтатусЗаказа.НеКомплект);
СписокНеПроводныхСтатусов.Добавить(Перечисления.ИА_СтатусЗаказа.НекомплектЗаказан);

