
Процедура ОбработкаЗаполнения(Основание)
	
	Склад=Основание.Склад;
	Фирма=Основание.Фирма;
	Дата=ТекущаяДата();
	ДокОснование= Основание;
	
	Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТовара")) или (ТипЗнч(Основание) = Тип("ДокументСсылка.ВводОстатков")) Тогда	
	
	ТоварДляПоиска=Основание.Товар.ВыгрузитьКолонку("Товар");
	
	ТХТ="ВЫБРАТЬ
	    |	ПартииЖНВЛСОстатки.Товар КАК Товар,
	    |	ПартииЖНВЛСОстатки.Партия КАК Партия,
	    |	ПартииЖНВЛСОстатки.Партия.ЦенаЗакуп * 100 / (100 + ПартииЖНВЛСОстатки.Партия.СтавкаНДС.Ставка) КАК ЦенаЗакупБезНДС,
	    |	0 КАК ЦенаГосРегистрации,
	    |	ПартииЖНВЛСОстатки.Партия.ЦенаПроизводителяБезНДС КАК ЦенаПроизводителяБезНДС,
	    |	ПартииЖНВЛСОстатки.Партия.ЕИТЗакупки КАК ЕИТ,
	    |	ПартииЖНВЛСОстатки.Партия.ЕИТЗакупки.К КАК К,
	    |	ПартииЖНВЛСОстатки.Партия.ЦенаЗакуп КАК ЦенаЗакупСНДС,
	    |	ПартииЖНВЛСОстатки.Партия.СтавкаНДС КАК СтавкаНДС,
	    |	ПартииЖНВЛСОстатки.КолвоОстаток КАК КоличествоФакт
	    |ИЗ
	    |	РегистрНакопления.ПартииЖНВЛС.Остатки(
	    |		&КонецДняДок,
	    |		Товар В (&ТоварыМассив)
	    |			И Склад = &Склад
	    |			И Фирма = &Фирма) КАК ПартииЖНВЛСОстатки";
		
		Запрос=Новый Запрос;
		Запрос.Текст=ТХТ;
		Запрос.УстановитьПараметр("ТоварыМассив",ТоварДляПоиска);
		Запрос.УстановитьПараметр("КонецДняДок",КонецДня(Дата));
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("Фирма",Фирма);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		Для каждого Стр из ТЗ Цикл
			СтрДок=ТОвар.Добавить();
			СтрДок.ЕИТ=Стр.ЕИТ;
			СтрДок.КоличествоФакт=Стр.КоличествоФакт;
			СтрДок.Коэфф=Стр.к;
			СтрДок.Партия=Стр.Партия;
			СтрДок.Товар=Стр.Товар;
			СтрДок.ЦенаГосРегистрации=Стр.ЦенаГосРегистрации;
			СтрДок.ЦенаЗакуп=Стр.ЦенаЗакупСНДС;
			СтрДок.ЦенаЗакупБезНДС=Стр.ЦенаЗакупБезНДС;
			СтрДок.ЦенаПроизводителя=Стр.ЦенаПроизводителяБезНДС;
			СтрДок.СтавкаНДС=Стр.СтавкаНдс;
			
		КонецЦикла;	 
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеТовара") Тогда		
		Для Каждого Стр из Основание.Товар Цикл
			СтрДок=ТОвар.Добавить();
			СтрДок.ЕИТ=Стр.ЕИТ;
			СтрДок.КоличествоФакт=Стр.КоличествоФакт;
			СтрДок.Коэфф=Стр.ЕИТ.к;
			СтрДок.Партия=Стр.Партия;
			СтрДок.Товар=Стр.Товар;
			СтрДок.ЦенаГосРегистрации=0;
			СтрДок.ЦенаЗакуп=Стр.Партия.ЦенаЗакуп;
			СтрДок.ЦенаЗакупБезНДС=Стр.Партия.ЦенаЗакуп*100/(100 + Стр.Партия.СтавкаНДС.Ставка);
			СтрДок.ЦенаПроизводителя=Стр.Партия.ЦенаПроизводителяБезНДС;
			СтрДок.СтавкаНДС=Стр.Партия.СтавкаНДС;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
