
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПромоакцияКод = Промоакция.Код;
	Движения.КоэффициентРаспределенияПромоакции.Записывать = Истина;
	Движения.КоэффициентРаспределенияПромоакции.Очистить();
	Для Каждого ТекСтрокаРаспределениеКоэффициентов Из РаспределениеКоэффициентов Цикл
		Движение = Движения.КоэффициентРаспределенияПромоакции.Добавить();
		Движение.ПромоакцияКод = ПромоакцияКод;
		Движение.ТоварКод = ТекСтрокаРаспределениеКоэффициентов.ТоварКод;
		Движение.СкладКод = ТекСтрокаРаспределениеКоэффициентов.СкладКод;
		Движение.Коэффициент = ТекСтрокаРаспределениеКоэффициентов.Коэффициент;
		Движение.ДатаДействияС = КоэффициентДатаДействияС;
		Движение.ДатаДействияПо = КоэффициентДатаДействияПо;
	КонецЦикла;

КонецПроцедуры
