
//============================================================================ GtG ===
Процедура ДвижениеТОвара()  
	
	ДТ= ЭтотОбъект.Движения.ПартииЖНВЛС;
	ППП=ЭтотОбъект.Движения.ПродажиПоПартиям;
	Для каждого Стр из ТОвар Цикл
		
		СтрДТ=ДТ.Добавить();
		
		СтрДТ.ВидДвижения=ВидДвиженияНакопления.Расход;
		СтрДТ.ВидОперации=Перечисления.ВидыОпераций.ПродажаТМЦ;
		СтрДТ.Активность=Истина;
		СтрДТ.Колво=Стр.Количество*Стр.К;
		СтрДТ.Партия=Стр.Партия;
		СтрДТ.Период=Дата;
		СтрДТ.Регистратор= ЭтотОбъект.Ссылка;
		СтрДТ.Склад= Аптека;
		СтрДТ.СтавкаНДС=Стр.СтавкаНДС;
		СтрДТ.СуммаЗакупСНДС=Стр.СуммаЗакуп;
		СтрДТ.СуммаНДСЗакуп=Стр.НДСЗакуп;
		//СтрДТ.СуммаРознНДС=Стр.СуммаНДС;
		//СтрДТ.СуммаРознСНДС=Стр.Сумма;
		
		СтрДТ.СуммаРознСНДС=Стр.СуммаЗакуп;
		СтрДТ.СуммаРознНДС=Стр.НДСЗакуп;
		
		
		СтрДТ.Товар=Стр.Товар;
		СтрДТ.Фирма= Фирма; 
		
//--------------------------------------------------------// GtG |>14.05.2013 16:47:51
		СтрППП=ППП.Добавить();
		СтрППП.Активность=Истина;
		
		СтрППП.Колво=Стр.Количество*Стр.К;
        СтрППП.Партия=Стр.Партия;
		СтрППП.Период=Дата;
		СтрППП.Регистратор= ЭтотОбъект.Ссылка;
		СтрППП.Склад= Аптека;
		СтрППП.СтавкаНДС=Стр.СтавкаНДС;
		СтрППП.СуммаЗакупСНДС=Стр.СуммаЗакуп;
		СтрППП.СуммаНДСЗакуп=Стр.НДСЗакуп;
		СтрППП.СуммаРознНДС=Стр.СуммаНДС;
		СтрППП.СуммаРознСНДС=Стр.Сумма;
		
		СтрППП.Товар=Стр.Товар;
		СтрППП.Фирма= Фирма; 

		

//--------------------------------------------------------// GtG <|


		
		
		
		
		
	КонецЦикла;	
	
	//Движения.ПартииЖНВЛС.Записать();
КонецПроцедуры

//============================================================================ GtG ===


//==========================================================GtG====
Процедура ДвижениеДисконта ()  Экспорт
	//----------------------------------
	//Назначение:
	//  
	//  
	//  по регистру   ДисконтныеКарты
	//  
	//----------------------------------
	
	Для каждого Стр из Дисконт Цикл
		ДВ=Движения.ДисконтныеКарты.Добавить();
		
		ДВ.Активность=Истина;
		//ДВ.ВидДвижения=ВидДвиженияНакопления.Приход;
		ДВ.Колво=Стр.Количество*Стр.К;
		ДВ.НомерДК=СокрЛП(Стр.Карта);
		ДВ.Период=Дата;
		ДВ.Регистратор= ЭтотОбъект.Ссылка;
		ДВ.СуммаРознСоСк=Стр.СуммаСоСкидкой;
		ДВ.СуммаСкидки=Стр.СуммаСкидки;
		ДВ.Товар=Стр.Товар;
		
		//---------------<Дисконт по партиям>---------------------------// GtG // 30.05.2012 11:08:47 
		ДВ=Движения.ДисконтПоПартиям.Добавить();// обороты
		
		ДВ.Активность=Истина;
		ДВ.Период=Дата;
		ДВ.Регистратор= ЭтотОбъект.Ссылка;
		
		ДВ.Товар=Стр.Товар;
		ДВ.Склад     =Аптека ;
		ДВ.Партия    =Стр.Партия ;
		ДВ.СтавкаНДС =Стр.Партия.СтавкаНДС;
		ДВ.Фирма     =Фирма ;
		ДВ.НомерДК=СокрЛП(Стр.Карта);
		
		ДВ.Колво=Стр.Количество*Стр.К;
		ДВ.СуммаСоСкидкой=Стр.СуммаСоСкидкой;
		ДВ.СуммаСкидки=Стр.СуммаСкидки;
		

		
	КонецЦикла;	
	
	//Движения.ДисконтныеКарты.Записать();
	
	
	
	
КонецПроцедуры	//ДвижениеДисконта
//==========================================================GtG====

Процедура ДвижениеПродажПоТипамДляЦО() Экспорт
	 тхт="ВЫБРАТЬ
	     |	РеализацияККМТовар.Товар.ТипДляЦО,
	     |	СУММА(РеализацияККМТовар.СуммаЗакуп) КАК СуммаЗакуп,
	     |	СУММА(РеализацияККМТовар.Сумма) КАК Сумма
	     |ПОМЕСТИТЬ Товар
	     |ИЗ
	     |	Документ.РеализацияККМ.Товар КАК РеализацияККМТовар
	     |ГДЕ
	     |	РеализацияККМТовар.Ссылка = &Ссылка
	     |
	     |СГРУППИРОВАТЬ ПО
	     |	РеализацияККМТовар.Товар.ТипДляЦО
	     |;
	     |
	     |////////////////////////////////////////////////////////////////////////////////
	     |ВЫБРАТЬ
	     |	РеализацияККМДисконт.Товар.ТипДляЦО,
	     |	СУММА(РеализацияККМДисконт.СуммаСкидки) КАК СуммаСкидки
	     |ПОМЕСТИТЬ Скидка
	     |ИЗ
	     |	Документ.РеализацияККМ.Дисконт КАК РеализацияККМДисконт
	     |ГДЕ
	     |	РеализацияККМДисконт.Ссылка = &Ссылка
	     |
	     |СГРУППИРОВАТЬ ПО
	     |	РеализацияККМДисконт.Товар.ТипДляЦО
	     |;
	     |
	     |////////////////////////////////////////////////////////////////////////////////
	     |ВЫБРАТЬ
	     |	Товар.ТоварТипДляЦО,
	     |	СУММА(Товар.СуммаЗакуп) КАК СуммаЗакуп,
	     |	СУММА(Товар.Сумма - ЕСТЬNULL(Скидка.СуммаСкидки, 0)) КАК СуммаСоСкидкой,
	     |	СУММА(Товар.Сумма) КАК Сумма,
	     |	СУММА(ЕСТЬNULL(Скидка.СуммаСкидки, 0)) КАК Скидка
	     |ИЗ
	     |	Товар КАК Товар
	     |		ЛЕВОЕ СОЕДИНЕНИЕ Скидка КАК Скидка
	     |		ПО Товар.ТоварТипДляЦО = Скидка.ТоварТипДляЦО
	     |
	     |СГРУППИРОВАТЬ ПО
	     |	Товар.ТоварТипДляЦО
	     |;
	     |
	     |////////////////////////////////////////////////////////////////////////////////
	     |УНИЧТОЖИТЬ Скидка
	     |;
	     |
	     |////////////////////////////////////////////////////////////////////////////////
	     |УНИЧТОЖИТЬ Товар" ;
		 
		 
		 
		 //-------------------- Запрос by GtG -----------------------
		 // Назначение: Выборка из табличных частей документа для записи в регистр
		 //----------------------------------------------------------
		 
		 Запрос=Новый Запрос;
		 Запрос.Текст=ТХТ;
		 
		 Запрос.Параметры.Вставить("Ссылка", ЭтотОбъект.Ссылка);
		 
		 ТЗ=Запрос.Выполнить().Выгрузить();
		 
		 Для каждого  Стр Из ТЗ  Цикл
		 	Движение=Движения.ПродажиПоТипамДляЦО.Добавить();
			
			Движение.Активность=Истина;
			Движение.Период=Дата;
			Движение.Регистратор= ЭтотОбъект.Ссылка;
			Движение.Склад=Аптека;
			Движение.СуммаЗакупочная=Стр.СуммаЗакуп;
			Движение.СуммаПродажСоСкидкой= Стр.СуммаСоСкидкой;
			Движение.СуммаСкидки=стр.Скидка;
			Движение.ТипДляЦО=Стр.ТоварТипДляЦО;
		 КонецЦикла; 
		 
		 
		 
	//	Движения.ПродажиПоТипамДляЦО.Записать(); 
		 
		 
		 
		 
		 
		 //----------------------------------------------------------
		 
		 
	
КонецПроцедуры  

 



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	#IF CLIENT Then
		ОчиститьСообщения(); 
	#ENDIF
	
	Если Товар.Количество()=0 Тогда
		Отказ=Истина;
		Предупреждение("Чек без товара не проводится!",2);
		Возврат;
	КонецЕсли;	
		
		
		ДвижениеТОвара();
		
		ДвижениеДисконта();
		
		ДвижениеПродажПоТипамДляЦО();
		
	    ОМ12_КопияДвиженийПартийВРегистрПоСтавкамНДС(ЭтотОбъект,Движения.ПартииЖНВЛС.Выгрузить());
		
		Для Каждого Движение Из Движения Цикл
			Движение.Записать();
		КонецЦикла;	
		
		
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	ЭтотОбъект.СуммаСоСкидкой=Товар.Итог("Сумма") - Дисконт.Итог("СуммаСкидки")+АвансыПоУслугам.Итог("Сумма");

КонецПроцедуры







