
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//------------------<Затычка для сведения товрных отчетов при переходах с одной базы на другую>-------------------GtG----11.02.2008
	ДВ= ЭтотОбъект.Движения.ОстаткиПоСтНДСПоСкладам;
	
	ДТ= ЭтотОбъект.Движения.ПартииЖНВЛС;
	
	Для каждого Стр из Товар Цикл
		Движняк=ДВ.Добавить();
		Движняк.Активность=Истина;
		Движняк.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движняк.Период=ДАта;
		Движняк.Регистратор= ЭтотОбъект;
		Движняк.Склад=Склад;
		Движняк.Фирма=Фирма;
		Движняк.СтавкаНДС=Стр.СтавкаНДС;
		Движняк.СуммаЗакупСНДС=Стр.СуммаЗакупСНДС;
		Движняк.СуммаНДСЗакуп=Стр.СуммаНДСЗакуп;
		Движняк.СуммаРознНДС=Стр.СуммаРознНДС;
		Движняк.СуммаРознСНДС=Стр.СуммаРознСНДС;
		
		Движ=ДТ.Добавить();
		Движ.Активность=Истина;
		Движ.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движ.Период=ДАта;
		Движ.Регистратор= ЭтотОбъект;
		Движ.Склад=Склад;
		Движ.Фирма=Фирма;
		Движ.Товар=Стр.Товар;
		Движ.Партия="";
		Движ.СтавкаНДС=Стр.СтавкаНДС;
		Движ.СуммаЗакупСНДС=Стр.СуммаЗакупСНДС;
		Движ.СуммаНДСЗакуп=Стр.СуммаНДСЗакуп;
		Движ.СуммаРознНДС=Стр.СуммаРознНДС;
		Движ.СуммаРознСНДС=Стр.СуммаРознСНДС;

		
		
		
		
		
		
	КонецЦикла;	
	
	ДВ.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	    ЗакупСумма=ТОВар.Итог("СуммаЗакупСНДС");
		РознСумма =ТОвар.Итог("СуммаРознСНДС");
	
	
	
КонецПроцедуры
