
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПрогнозПродаж
	Движения.ПрогнозПродаж.Записывать = Истина;
	Движения.ПрогнозПродаж.Очистить();
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ПрогнозПродаж.Добавить();
		Движение.Период					= НачалоМесяца(ПериодРегистрации);
		Движение.КодТовара				= ТекСтрокаТовар.КодТовара;
		Движение.ТипПланирования		= ТипПланирования;
		Движение.СценарийПланирования	= СценарийПланирования;
		Движение.Количество				= ТекСтрокаТовар.КоличествоУп * ?(ТекСтрокаТовар.Коэффициент = 0,1,ТекСтрокаТовар.Коэффициент);
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
