//============================================================================ GtG ===
Функция ОМ6_ПроверкаПроцентаНаценки(Товар, Регион, ПроцентНаценки) Экспорт
    // Назначение:
	// Проверяет наценку на ЖНВЛС, СВЛС
	// Возвращает исходный процент если все ОК или скорректированный если что-то не правильно
    //--------------------------------------------------------------------------------
	Рез=ПроцентНаценки;
     ЖНВЛСПрРег=Регион.МаксПроцРознНацЖНВЛС;
	 СВЛСПрРег=Регион.МаксПроцРознНацСВЛС;
	 //----------------------------< СВЛС >--------------------------------GtG---
	 Если Товар.СВЛС= ИСТИНА  Тогда
		 Если ПроцентНаценки> СВЛСПрРег Тогда
			 Рез=СВЛСПрРег; // не выше процента по СВЛС
		 КонецЕсли; 
	 КонецЕсли; 	 
	 //----------------------------< ЖНВЛС >--------------------------------GtG---
	 Если Товар.ЖНВЛС= ИСТИНА  Тогда
		 Если ПроцентНаценки> ЖНВЛСПрРег Тогда
			 Рез=ЖНВЛСПрРег; // не выше процента по ЖНВЛС
		 КонецЕсли; 
	 КонецЕсли; 
     Возврат Рез;
КонецФункции
//============================================================================ GtG ===


//============================================================================ GtG ===
Функция РасчетРозничнойЦены  (Товар) Экспорт
    // Назначение:
	// Расчитывает розничную цену товара по политике  ценообразования
	// 
    // 
	//--------------------------------------------------------------------------------
	Рез="";

     Возврат Рез;
КонецФункции
//============================================================================ GtG ===

#IF SERVER THEN  
Функция ОМ6_НайтиИзменениеЦен(ЭОСсы) Экспорт
	ТекстЗапроса=
	"ВЫБРАТЬ 
	|	ИзменениеЦен.Ссылка Как ИзмЦенДок
	|ИЗ
	|	Документ.ИзменениеЦен КАК ИзменениеЦен
	|ГДЕ
	|	ИзменениеЦен.ДокументОснование.Ссылка = &ВыбДокОсн";	
	
	Запрос=Новый Запрос;
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбДокОсн",ЭОСсы);
	Рез=Запрос.Выполнить();
	
	ТЗВыб = Рез.Выгрузить();
	
	Возврат ТЗВыб;  // ЗНАЧЕНИЕ ДОЛЖНО БЫТЬ НЕМУТАБЕЛЬНЫМ!!!
	
КонецФункции	
#ENDIF

//==========================================================GtG====
Функция ОМ6_НаценкаОтЧегоЛибо (БазоваяСумма,СуммаСНаценкой)  Экспорт
	//----------------------------------
	//Назначение:
	//  Рассчитывает прцоент наценки от базовой смумы
	//  
	//  
	//  
	//----------------------------------
	
	Рез=0;
	Если ТипЗнч(БазоваяСумма)=Тип("Число") Тогда
	//Попытка // 04-03-2013 попытка...исключение  заменена на если.. иначе
		Если БазоваяСумма<>0 Тогда
			Рез= (СуммаСНаценкой-БазоваяСумма)*100/БазоваяСумма ;
		КонецЕсли; 
		
		Рез=Окр(Рез,6);
	Иначе//Исключение
		//Сообщить("Не удалось расчитать процент наценки! Исх. данные: База=" + БазоваяСумма+"   С наценкой="+СуммаСНаценкой +"
		//|ОШИКА: "+ОписаниеОшибки()+" 
		//|");
		
	КонецЕсли;//КонецПопытки;
	
	Возврат Рез;	
	
КонецФункции	//ОМ6_НаценкаОтЧегоЛибо
//==========================================================GtG====




#Если Клиент Тогда 
Процедура ОМ6_КоманднаяПанельКнопкаРасценить(ЭтаФорма_,ЭтотОбъект_,Товар,ОбновлятьДанныеПоПартиям=Истина)  Экспорт
	// Вставить содержимое обработчика.
	//Если ЭтаФорма_.ТолькоПросмотр Тогда
	//	Предупреждение("Редактирование документа запрещено!");
	//	ВОЗВРАТ ;
	//КонецЕсли; 
	
	
	//------------------<Новый или измененный документ перед расценкой нужно записать>-------------------GtG----21.11.2007
	Если ЭтотОбъект_.ЭтоНовый()=Истина или ЭтотОбъект_.Модифицированность()=Истина тогда
		
		Ответ=Вопрос("Для расценки документ необходимо записать. 
		|ЗАПИСАТЬ ДОКУМЕНТ?",РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.ДА,"НУЖНО ЗАПИСАТЬ ДОКУМЕНТ!");
		
				
		Если Ответ=КодВозвратаДиалога.Да тогда
			ЭтотОбъект_.Записать(РежимЗаписидокумента.Запись);
		Иначе
			Возврат; // документ не записан, расценка невозможна
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	//--------------------------------------------------------GtG----КОНЕЦ--21.11.2007	
	
	КлючУник=  Новый   УникальныйИдентификатор();
	Если ТипЗнч(ЭтотОбъект_) = Тип("ДокументОбъект.Перерасценка366") Тогда
		Обработки.Расценка_366.ПолучитьФорму("ОбщФормаРасценки",ЭтаФорма_,КлючУник).Открыть();
	ИначеЕсли ТипЗнч(ЭтотОбъект_) = Тип("ДокументОбъект.УЗ_ПоступлениеТовара") 
		или ТипЗнч(ЭтотОбъект_) = Тип("ДокументОбъект.УЗ_Перемещение") 
		или ТипЗнч(ЭтотОбъект_) = Тип("ДокументОбъект.УстановкаРозничныхЦен")
		или ТипЗнч(ЭтотОбъект_) = Тип("ДокументОбъект.ПереоценкаПоКачеству")
		или ТипЗнч(ЭтотОбъект_) = Тип("ДокументОбъект.УЗ_ВводОстатков") Тогда
		Обработки.Расценка_v4.ПолучитьФорму("ОбщФормаРасценки",ЭтаФорма_,КлючУник).Открыть();
	Иначе
		Обработки.Расценка_v3.ПолучитьФорму("ОбщФормаРасценки",ЭтаФорма_,КлючУник).Открыть();
	КонецЕсли;

	
КонецПроцедуры
#КонецЕсли 


//==========================================================GtG====
Процедура ОМ6_ЗапуститьАвтоматическуюРасценкуДокумента (ДокОбъект)  Экспорт
	//----------------------------------
	//Назначение:
	//  Открывает МОДАЛЬНО форму автоматической расценки
	//  запускает, расценяет, закрывает
	//----------------------------------
	
	//Сообщить("ОМ6_ЗапуститьАвтоматическуюРасценкуДокумента ("+ДокОбъект+")");
	
	Расценко=Обработки.Расценка_v2.Создать();
	РасценкоФ=Расценко.ПолучитьФорму("ОбщФормаРасценки",, Новый УникальныйИдентификатор );
	РасценкоФ.АвтоРасценка=ИСТИНА;
	РасценкоФ.ДокОбъект=ДокОбъект;
	РасценкоФ.ОткрытьМодально();
	
	
	
	
	
КонецПроцедуры	//ОМ6_ЗапуститьАвтоматическуюРасценкуДокумента
//==========================================================GtG====

//==========================================================GtG====
Функция ОМ6_ЕстьЦеныПоРасценке (ДокСсылка)  Экспорт
	//----------------------------------
	//Назначение:
	//  Определяет, есть ли в регистре Цены хоть одна цена по указанному документу
	//  возвращает истина если есть 
	//  ложь если нет
	//  
	//----------------------------------
	//-------------- ЗАПРОС GTG --------------------------НАЧАЛО
	//Назначение: Ищем цены в регистре
	//
	ТХТ="ВЫБРАТЬ ПЕРВЫЕ 1
	    |	ЦеныСрезПоследних.ЦенаРознГТТ
	    |ИЗ
	    |	РегистрСведений.Цены.СрезПоследних(, Регистратор = &ДокСсылка) КАК ЦеныСрезПоследних";
	
	Запрос=Новый Запрос;
	Запрос.Текст=ТХТ;
	Запрос.УстановитьПараметр("ДокСсылка",ДокСсылка);
	
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	//-------------- ЗАПРОС GTG --------------------------КОНЕЦ
	Если ТЗ.Количество()=0 ТОгда
		Возврат Ложь; // цен нет
	Иначе
		Возврат Истина; // есть какие-то там цены
	КонецЕсли;	
	
КонецФункции	//ЕстьЦеныПоРасценке
//==========================================================GtG====



//==========================================================GtG====
Функция ОМ6_ЕстьСпецЦена_старая (Товар,Склад,Дата)  Экспорт
	//----------------------------------
	//Назначение:
	//  Ищет спеццену в справочнике спеццен
	//----------------------------------
	
	//-------------- ЗАПРОС GTG --------------------------НАЧАЛО
	//Назначение: Найти спеццену
	//
	ТХТ="ВЫБРАТЬ
	    |	СпециальныеЦеныАптеки.Ссылка
	    |ИЗ
	    |	Справочник.СпециальныеЦены.Аптеки КАК СпециальныеЦеныАптеки
	    |ГДЕ
	    |	СпециальныеЦеныАптеки.Ссылка.ПометкаУдаления = Ложь
	    |	И &Дата МЕЖДУ НАЧАЛОПЕРИОДА(СпециальныеЦеныАптеки.Ссылка.НачПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(СпециальныеЦеныАптеки.Ссылка.КонПериода, ДЕНЬ)
	    |	И СпециальныеЦеныАптеки.Ссылка.Товар = &Товар
	    |	И СпециальныеЦеныАптеки.Аптека = &Склад";
	
	Запрос=Новый Запрос;
	Запрос.Текст=ТХТ;
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Товар",Товар);
	Запрос.УстановитьПараметр("Склад",Склад);
	
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество()<>0 Тогда
		Возврат Истина; // есть спеццена
	Иначе	
		Возврат Ложь; // нет спеццены
	КонецЕсли;	
	//-------------- ЗАПРОС GTG --------------------------КОНЕЦ
КонецФункции	//ОМ6_ЕстьСпецЦена
//==========================================================GtG====

//==========================================================GtG====
Функция ОМ6_СпецЦена_старая (Товар,Склад,Дата)  Экспорт
	//----------------------------------
	//Назначение:
	//  Ищет спеццену в справочнике спеццен
	//----------------------------------
	
	//-------------- ЗАПРОС GTG --------------------------НАЧАЛО
	//Назначение: Найти спеццену
	//
	ТХТ="ВЫБРАТЬ
	    |	СпециальныеЦеныАптеки.Ссылка.СпециальнаяЦена  как СпецЦена
	    |ИЗ
	    |	Справочник.СпециальныеЦены.Аптеки КАК СпециальныеЦеныАптеки
	    |ГДЕ
	    |	СпециальныеЦеныАптеки.Ссылка.ПометкаУдаления = Ложь
	    |	И &Дата МЕЖДУ НАЧАЛОПЕРИОДА(СпециальныеЦеныАптеки.Ссылка.НачПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(СпециальныеЦеныАптеки.Ссылка.КонПериода, ДЕНЬ)
	    |	И СпециальныеЦеныАптеки.Ссылка.Товар = &Товар
	    |	И СпециальныеЦеныАптеки.Аптека = &Склад";
	
	Запрос=Новый Запрос;
	Запрос.Текст=ТХТ;
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Товар",Товар);
	Запрос.УстановитьПараметр("Склад",Склад);
	
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество()<>0 Тогда
		Возврат Тз.Получить(0).СпецЦена; // есть спеццена
	Иначе	
		Возврат 0; // нет спеццены
	КонецЕсли;	
	//-------------- ЗАПРОС GTG --------------------------КОНЕЦ
КонецФункции	//ОМ6_ЕстьСпецЦена
//==========================================================GtG====

Функция OM6_ГруппаАптекиДляЦО(Склад) Экспорт 
	
	Группа=Неопределено;
	
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ГруппировкаАптекДляЦОАптеки.Ссылка  как Группа
	                    |ИЗ
	                    |	Справочник.ГруппировкаАптекДляЦО.Аптеки КАК ГруппировкаАптекДляЦОАптеки
	                    |ГДЕ
	                    |	ГруппировкаАптекДляЦОАптеки.Ссылка.ПометкаУдаления = Ложь
	                    |	И ГруппировкаАптекДляЦОАптеки.Аптека = &Аптека");
	
	 Запрос.УстановитьПараметр("Аптека",Склад);
	
	 Рез=Запрос.Выполнить().Выгрузить();
	 Если Рез.Количество()<>0 Тогда
		 Группа=Рез.Получить(0);
	 КонецЕсли;	 
	 
	 Возврат Группа;
КонецФункции	


Функция OM6_ГруппатовараДляЦО(Товар) Экспорт 
	
	Группа=Неопределено;
	
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ГруппировкаТоваровДляЦОТовары.Ссылка
	                    |ИЗ
	                    |	Справочник.ГруппировкаТоваровДляЦО.Товары КАК ГруппировкаТоваровДляЦОТовары
	                    |ГДЕ
	                    |	ГруппировкаТоваровДляЦОТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	                    |	И ГруппировкаТоваровДляЦОТовары.Товар = &Товар");
	
	 Запрос.УстановитьПараметр("Товар",Товар);
	
	 Рез=Запрос.Выполнить().Выгрузить();
	 Если Рез.Количество()<>0 Тогда
		 Группа=Рез.Получить(0);
	 КонецЕсли;	 
	 
	 Возврат Группа;
КонецФункции

