
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	Спр.Ссылка
	|ИЗ
	|	Справочник.ШаблоныМатрицНЗ КАК Спр
	|ГДЕ
	|	Спр.Наименование = &Наименование
	|	И Спр.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Сообщить("Поле ""Наименование"" не уникально") ;
		Отказ = Истина;		
	КонецЕсли;
	
КонецПроцедуры
