
Процедура ПередЗаписью(Отказ, Замещение)
	//Не используется
	//Для Каждого ТекЗапись Из ЭтотОбъект Цикл		
	//	Склад = ТекЗапись.НоваяАптека;
	//	СтарыйСклад = ТекЗапись.СтараяАптека;
	//	
	//	Попытка		
	//		НаборЗаписей = РегистрыСведений.ЛимитыСписанияПоСрокамГодности.СоздатьНаборЗаписей();	
	//		НаборЗаписей.Отбор.Склад.Установить(Склад);
	//		
	//		ТекДанные = ОМ_ТСО.РасчетЛимитаСписанияПоАптеке(Склад, СтарыйСклад);
	//		
	//		НоваяЗапись = НаборЗаписей.Добавить();
	//		НоваяЗапись.Склад = Склад;
	//		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекДанные);
	//		
	//		НаборЗаписей.Записать();
	//		
	//	Исключение	
	//		#Если Клиент Тогда
	//			Сообщить("Не удается выполнить расчет лимитов списания");
	//		#КонецЕсли
	//		
	//	КонецПопытки;
	//	
	//КонецЦикла;
	
КонецПроцедуры
