

////НЭТИ Барданов А.Ю. 29.01.2019 ENT-724
//Процедура ПередЗаписью(Отказ, Замещение)
//	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;
//	Если Модифицированность() ИЛИ ЭтотОбъект.Количество() > 0  Тогда
//		ОтклонитьУдалениеЗаблокированныхЗаписейМатрицы(ЭтотОбъект,Отказ); 	
//		//Отказ = Истина;
//		//Возврат;
//	КонецЕсли;	

//КонецПроцедуры

////НЭТИ Барданов А.Ю. 29.01.2019 ENT-724
//Процедура ОтклонитьУдалениеЗаблокированныхЗаписейМатрицы(Знач Источник, Отказ)
//	
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ
//		               |	ТекущийНабор.Аптека КАК Аптека,
//		               |	ТекущийНабор.Товар КАК Товар,
//		               |	ТекущийНабор.ГруппаXYZ КАК ГруппаXYZ,
//		               |	ТекущийНабор.ГруппаАПИтог КАК ГруппаАПИтог,
//		               |	ТекущийНабор.КуМин КАК КуМин,
//		               |	ТекущийНабор.КуМакс КАК КуМакс,
//		               |	ТекущийНабор.КуМакс2 КАК КуМакс2,
//		               |	ТекущийНабор.КтоВнесВМатрицу КАК КтоВнесВМатрицу,
//		               |	ТекущийНабор.ДатаВнесенияВМатрицу КАК ДатаВнесенияВМатрицу,
//		               |	ТекущийНабор.ДатаИзменения КАК ДатаИзменения,
//		               |	ТекущийНабор.СтоимостьСборки КАК СтоимостьСборки,
//		               |	ТекущийНабор.Блок КАК Блок
//		               |ПОМЕСТИТЬ ТекущийНабор
//		               |ИЗ
//		               |	&ТекущийНабор КАК ТекущийНабор
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	СуществующиеЗаписи.Аптека КАК Аптека,
//		               |	СуществующиеЗаписи.Товар КАК Товар,
//		               |	СуществующиеЗаписи.ГруппаXYZ КАК ГруппаXYZ,
//		               |	СуществующиеЗаписи.ГруппаАПИтог КАК ГруппаАПИтог,
//		               |	СуществующиеЗаписи.КуМин КАК КуМин,
//		               |	СуществующиеЗаписи.КуМакс КАК КуМакс,
//		               |	СуществующиеЗаписи.КуМакс2 КАК КуМакс2,
//		               |	СуществующиеЗаписи.КтоВнесВМатрицу КАК КтоВнесВМатрицу,
//		               |	СуществующиеЗаписи.ДатаВнесенияВМатрицу КАК ДатаВнесенияВМатрицу,
//		               |	СуществующиеЗаписи.ДатаИзменения КАК ДатаИзменения,
//		               |	СуществующиеЗаписи.СтоимостьСборки КАК СтоимостьСборки,
//		               |	СуществующиеЗаписи.Блок КАК Блок
//		               |ПОМЕСТИТЬ СуществующиеЗаписи
//		               |ИЗ
//		               |	&СуществующиеЗаписи КАК СуществующиеЗаписи
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	Матрица.Аптека КАК Аптека,
//		               |	Матрица.Товар КАК Товар,
//		               |	Матрица.ГруппаXYZ КАК ГруппаXYZ,
//		               |	Матрица.ГруппаАПИтог КАК ГруппаАПИтог,
//		               |	Матрица.КуМин КАК КуМин,
//		               |	Матрица.КуМакс КАК КуМакс,
//		               |	Матрица.КуМакс2 КАК КуМакс2,
//		               |	Матрица.КтоВнесВМатрицу КАК КтоВнесВМатрицу,
//		               |	Матрица.ДатаВнесенияВМатрицу КАК ДатаВнесенияВМатрицу,
//		               |	Матрица.ДатаИзменения КАК ДатаИзменения,
//		               |	Матрица.СтоимостьСборки КАК СтоимостьСборки,
//		               |	Матрица.Блок КАК Блок
//		               |ПОМЕСТИТЬ ЗаблокированныеЗаписи
//		               |ИЗ
//		               |	СуществующиеЗаписи КАК Матрица
//		               |ГДЕ
//		               |	Матрица.Блок = ИСТИНА
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	ЕСТЬNULL(ТекущийНабор.Аптека, ЗаблокированныеЗаписи.Аптека) КАК Аптека,
//		               |	ЕСТЬNULL(ТекущийНабор.Товар, ЗаблокированныеЗаписи.Товар) КАК Товар,
//		               |	ЕСТЬNULL(ТекущийНабор.ГруппаXYZ, ЗаблокированныеЗаписи.ГруппаXYZ) КАК ГруппаXYZ,
//		               |	ЕСТЬNULL(ТекущийНабор.ГруппаАПИтог, ЗаблокированныеЗаписи.ГруппаАПИтог) КАК ГруппаАПИтог,
//		               |	ЕСТЬNULL(ТекущийНабор.КуМин, ЗаблокированныеЗаписи.КуМин) КАК КуМин,
//		               |	ЕСТЬNULL(ТекущийНабор.КуМакс, ЗаблокированныеЗаписи.КуМакс) КАК КуМакс,
//		               |	ЕСТЬNULL(ТекущийНабор.КуМакс2, ЗаблокированныеЗаписи.КуМакс2) КАК КуМакс2,
//		               |	ЕСТЬNULL(ТекущийНабор.КтоВнесВМатрицу, ЗаблокированныеЗаписи.КтоВнесВМатрицу) КАК КтоВнесВМатрицу,
//		               |	ЕСТЬNULL(ТекущийНабор.ДатаВнесенияВМатрицу, ЗаблокированныеЗаписи.ДатаВнесенияВМатрицу) КАК ДатаВнесенияВМатрицу,
//		               |	ЕСТЬNULL(ТекущийНабор.ДатаИзменения, ЗаблокированныеЗаписи.ДатаИзменения) КАК ДатаИзменения,
//		               |	ЕСТЬNULL(ТекущийНабор.СтоимостьСборки, ЗаблокированныеЗаписи.СтоимостьСборки) КАК СтоимостьСборки,
//		               |	ЕСТЬNULL(ТекущийНабор.Блок, ЗаблокированныеЗаписи.Блок) КАК Блок
//		               |ИЗ
//		               |	ТекущийНабор КАК ТекущийНабор
//		               |		ПОЛНОЕ СОЕДИНЕНИЕ ЗаблокированныеЗаписи КАК ЗаблокированныеЗаписи
//		               |		ПО ЗаблокированныеЗаписи.Аптека = ТекущийНабор.Аптека
//		               |			И ЗаблокированныеЗаписи.Товар = ТекущийНабор.Товар";
//	Запрос.УстановитьПараметр("ТекущийНабор", Источник.Выгрузить());
//	СуществующийНабор = Источник;
//	СуществующийНабор.Прочитать(); 
//	СуществующиеЗаписи = СуществующийНабор.Выгрузить(); 
//	Запрос.УстановитьПараметр("СуществующиеЗаписи", СуществующиеЗаписи);

//    Выгрузка = Запрос.Выполнить().Выгрузить();
//	Источник.Загрузить(Выгрузка);
//КонецПроцедуры	