
Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		СтрКодПроверяющего = Формат(ГСЧ.СлучайноеЧисло(10000000,99999999),"ЧГ=0");
		СпрПроверяющие = Справочники.ПроверяющиеОтПоставщика;
		Пока СпрПроверяющие.НайтиПоРеквизиту("КодПроверяющего",СтрКодПроверяющего) <> СпрПроверяющие.ПустаяСсылка() Цикл 
			СтрКодПроверяющего = Формат(ГСЧ.СлучайноеЧисло(10000000,99999999),"ЧГ=0");
		КонецЦикла;
		КодПроверяющего = СтрКодПроверяющего;
	КонецЕсли;
КонецПроцедуры
