
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЕдиницаПоУмолчанию.Пустая() и ЕдиницаПоУмолчанию.К > 1 Тогда
			Разбивается = Истина;
			Коэффициент = ЕдиницаПоУмолчанию.К;
		Иначе
			Коэффициент = 1;
		КонецЕсли;
		Если Родитель = Справочники.АССОРТИМЕНТНЫЙ_ПЛАН.АссортиментРынка Тогда
			АссортиментРынка = Истина;
		Иначе
			АссортиментРынка = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Если УчаствуетВАП и КодОП > 0 Тогда
		#Если Клиент Тогда
			Предупреждение("Позиция не может быть активной при наличии заполненого кода ОП");
			Отказ = Истина;
		#КонецЕсли	
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Отказ = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	       	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	Если Родитель = Справочники.АССОРТИМЕНТНЫЙ_ПЛАН.АссортиментРынка Тогда
		ПроверяемыеРеквизиты.Очистить();
		ПроверяемыеРеквизиты.Добавить("Наименование");
		Если УчаствуетВАП Тогда
			#Если Клиент Тогда
				Сообщить("Активную позицию нельзя переносить в папку ""Ассортимент рынка""!");
			#КонецЕсли
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	//+++ENT-1241
	Если РольДоступна("ЗаписьАПБезПроверки") Тогда
		Возврат;
	КонецЕсли;
	//---
		
	
	
	Если Сезонный Тогда
		ПроверяемыеРеквизиты.Добавить("Сезон");		
	КонецЕсли;
	//ENT-1155 
	//ПроверяемыеРеквизиты.Добавить("ЕдиницаПоУмолчанию");
	//ПроверяемыеРеквизиты.Добавить("ЕдиницаМин");
	//ПроверяемыеРеквизиты.Добавить("ЕдиницаОтгрузки");
	//sd65593
	ПроверяемыеРеквизиты.Добавить("Бренд");
	ПроверяемыеРеквизиты.Добавить("СтавкаНДС");
	ПроверяемыеРеквизиты.Добавить("ТипДляЦО");
	ПроверяемыеРеквизиты.Добавить("Наименование");
	ПроверяемыеРеквизиты.Добавить("Спрос");
	ПроверяемыеРеквизиты.Добавить("Производитель");
	ПроверяемыеРеквизиты.Добавить("Страна");
	ПроверяемыеРеквизиты.Добавить("ТипТовара");
	ПроверяемыеРеквизиты.Добавить("УТК");
	ПроверяемыеРеквизиты.Добавить("АТС1");
	ПроверяемыеРеквизиты.Добавить("АТС2");
	ПроверяемыеРеквизиты.Добавить("АТС3");
	ПроверяемыеРеквизиты.Добавить("АТС4");
	Если ЗначениеЗаполнено(ТипТовара) Тогда
		Если Найти("ЛС/OTC, ЛС/Rx, ЛС/Rx ПККН, ЛС/Rx ПКУ, ЛС/ГОСПИТАЛЬНЫЙ/RX,",СокрЛП(ТипТовара.Наименование)+",")>0 Тогда
			ПроверяемыеРеквизиты.Добавить("ТорговоеНаименование");
			ПроверяемыеРеквизиты.Добавить("ЛекФорма");
			ПроверяемыеРеквизиты.Добавить("Дозировка");
			ПроверяемыеРеквизиты.Добавить("КолвоВУпаковке");
			ПроверяемыеРеквизиты.Добавить("МНН");
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Родитель = Справочники.АССОРТИМЕНТНЫЙ_ПЛАН.АссортиментРынка Тогда
		Возврат;
	КонецЕсли;
	
	ТекДата = НачалоДня(ТекущаяДата());
	
	МЗ = РегистрыСведений.Новинки.СоздатьМенеджерЗаписи();
	МЗ.Товар = Ссылка;
	МЗ.Прочитать();
	ЕстьЗаписьВРегистре = МЗ.Выбран();
	Если ЕстьЗаписьВРегистре Тогда
		ЗаписьДействует = МЗ.ОкончаниеПериодаДействия = Дата(1,1,1) Или МЗ.ОкончаниеПериодаДействия >= ТекДата;
	Иначе
		ЗаписьДействует = Ложь;
	КонецЕсли;
	
	Если Новинка Тогда
		Если ЕстьЗаписьВРегистре Тогда
			Если Не ЗаписьДействует Тогда
				МЗ.НачалоПериодаДействия = ТекДата;
				МЗ.ОкончаниеПериодаДействия = Дата(1,1,1);
				МЗ.Записать();
			КонецЕсли;			
		Иначе
			МЗ.Товар = Ссылка;
			МЗ.НачалоПериодаДействия = ТекДата;
			МЗ.Записать();
		КонецЕсли;
		
	Иначе
		Если ЗаписьДействует Тогда
			МЗ.ОкончаниеПериодаДействия = ТекДата;
			МЗ.Записать();
		КонецЕсли;			
		
	КонецЕсли;	
	
КонецПроцедуры





