//==========================================================GtG====
Функция функция_Послать ()  Экспорт
	//----------------------------------
	//Назначение:
	//  
	//  
	//  Отправка письма
	//  
	//----------------------------------
	
	 // Вставить содержимое обработчика.
	 
	 
	 ПОПЫТКА // СРАЗУ ВСЕ СДЕЛАТЬ КУЧЕЙ
		 
		 
		 Если СтрДлина(СокрЛП(Отправитель))=0 ТОгда
			 #Если Клиент Тогда
			 	Сообщить("Не указан отправитель!", СтатусСообщения.Важное);
			#КонецЕсли
			 Возврат ЛОЖЬ;
		 КонецЕсли; 
		 Если ПустаяСтрока(Адресат) и РАссылка.Количество()=0 ТОгда
			 #Если Клиент Тогда
			 	Сообщить("Не указан получатель или список адресов рассылки!", СтатусСообщения.Важное);
			 #КонецЕсли
			 Возврат Ложь;
		 КонецЕсли;
		 
		 Если Автоотправка=Ложь ТОгда
			 
			 Если ПустаяСтрока(Тема) ТОгда
				 #Если Клиент Тогда
				 	Сообщить("Не указана тема письма!", СтатусСообщения.Важное);
				 #КонецЕсли
				 Возврат Ложь;
			 КонецЕсли;
			 
			 Если ПустаяСтрока(ТекстПисьма) ТОгда
				 #Если Клиент Тогда
				 	Сообщить("У письма нет текста!", СтатусСообщения.Важное);
				 #КонецЕсли
				 Возврат Ложь;
			 КонецЕсли;
			 
		 КонецЕсли; 
		 
		 
		 
		 
		 ЭП = Новый ИнтернетПочта;
		 
		 ПоПро=Новый ИнтернетПочтовыйПрофиль;
		 
		 ПоПро.АдресСервераPOP3=АдресСервераPOP3;
		 ПоПро.АдресСервераSMTP=АдресСервераSMTP;
		 ПоПро.ВремяОжидания=ВремяОжидания;
		 ПоПро.Пароль=Пароль;
		 ПоПро.ПарольSMTP=ПарольSMTP;
		 ПоПро.Пользователь=Пользователь;
		 ПоПро.ПользовательSMTP=ПользовательSMTP;
		 ПоПро.ПортPOP3=ПортPOP3;
		 ПоПро.ПортSMTP=ПортSMTP;
		 ПоПро.АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
		 ПоПро.АутентификацияSMTP = СпособSMTPАутентификации.Login;
		 ПоПро.ИспользоватьSSLSMTP = Константы.ИспользоватьSSLSMTP.Получить();
		 ПоПро.ИспользоватьSSLPOP3 = Константы.ИспользоватьSSLPOP3.Получить();
		 
		 ЭП.Подключиться(ПоПро);
		 
		 Мессага=Новый ИнтернетПочтовоеСообщение ;
		 Мессага.Отправитель=Отправитель;
		 Мессага.Кодировка="windows-1251";
		 
		 Если Рассылка.Количество()=0 Тогда
			 Мессага.Получатели.Добавить(Адресат);
		 Иначе
			 Для каждого Стр из Рассылка Цикл
				 Мессага.Получатели.Добавить(Стр.Значение);
			 КонецЦикла;	 
		 КонецЕсли; 
		 Мессага.Тема=Тема;
		 ТП=Мессага.Тексты.Добавить(ТекстПисьма);
		 ТП.ТипТекста=ТипТекстаПочтовогоСообщения.ПростойТекст;
		 ТП.Кодировка="windows-1251";
		 
		 
		 Для каждого Стр из СписокВложений Цикл
			 Мессага.Вложения.Добавить(Стр.Значение);
		 КонецЦикла;	 
		 
		 
		 Попытка
			 ЭП.Послать(Мессага);
			 Возврат Истина;
		 ИСключение
			 #Если Клиент Тогда
			 	Сообщить("Не удалось отправить сообщение "+ОписаниеОшибки());
			 #КонецЕсли
			 Возврат Ложь;
		 КонецПопытки;
		 #Если Клиент Тогда
			 Сообщить("Отправлено письмо по адресу "+Адресат+" !", СтатусСообщения.Информация);
		 #КонецЕсли

		 
	 ИСКЛЮЧЕНИЕ  // ПРОБЛЕМА С ОТПРАВКОЙ
		 #Если Клиент Тогда
			 Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		 #КонецЕсли
		 Возврат Ложь;
		 
	 КОНЕЦПОПЫТКИ;
	 
КонецФункции	//Послать
//==========================================================GtG====
	

//==========================================================GtG====
Процедура Послать ()  Экспорт
	//----------------------------------
	//Назначение:
	//  
	//  
	//  Отправка письма
	//  
	//----------------------------------
	
	 // Вставить содержимое обработчика.
	 
	 
	 ПОПЫТКА // СРАЗУ ВСЕ СДЕЛАТЬ КУЧЕЙ
		 
		 
		 Если СтрДлина(СокрЛП(Отправитель))=0 ТОгда
			 #Если Клиент Тогда
			 Сообщить("Не указан отправитель!", СтатусСообщения.Важное);
			 #КонецЕсли
			 Возврат;
		 КонецЕсли; 
		 Если ПустаяСтрока(Адресат) и РАссылка.Количество()=0 ТОгда
			 #Если Клиент Тогда
			 Сообщить("Не указан получатель или список адресов рассылки!", СтатусСообщения.Важное);
			 #КонецЕсли
			 Возврат;
		 КонецЕсли;
		 
		 Если Автоотправка=Ложь ТОгда
			 
			 Если ПустаяСтрока(Тема) ТОгда
				 #Если Клиент Тогда
				 Сообщить("Не указана тема письма!", СтатусСообщения.Важное);
				 #КонецЕсли
				 Возврат;
			 КонецЕсли;
			 
			 Если ПустаяСтрока(ТекстПисьма) ТОгда
				 #Если Клиент Тогда
				 Сообщить("У письма нет текста!", СтатусСообщения.Важное);
				 #КонецЕсли
				 Возврат;
			 КонецЕсли;
			 
		 КонецЕсли; 
		 
		 
		 
		 
		 ЭП = Новый ИнтернетПочта;
		 
		 ПоПро=Новый ИнтернетПочтовыйПрофиль;
		 
		 ПоПро.АдресСервераPOP3=АдресСервераPOP3;
		 ПоПро.АдресСервераSMTP=АдресСервераSMTP;
		 ПоПро.ВремяОжидания=ВремяОжидания;
		 ПоПро.Пароль=Пароль;
		 ПоПро.ПарольSMTP=ПарольSMTP;
		 ПоПро.Пользователь=Пользователь;
		 ПоПро.ПользовательSMTP=ПользовательSMTP;
		 ПоПро.ПортPOP3=ПортPOP3;
		 ПоПро.ПортSMTP=ПортSMTP;
		 ПоПро.ИспользоватьSSLSMTP = Константы.ИспользоватьSSLSMTP.Получить();
		 ПоПро.ИспользоватьSSLPOP3 = Константы.ИспользоватьSSLPOP3.Получить();
		 
		 ЭП.Подключиться(ПоПро);
		 
		 Мессага=Новый ИнтернетПочтовоеСообщение ;
		 Мессага.Отправитель=Отправитель;
		 Мессага.Кодировка="windows-1251";
		 
		 Если Рассылка.Количество()=0 Тогда
			 Мессага.Получатели.Добавить(Адресат);
		 Иначе
			 Для каждого Стр из Рассылка Цикл
				 Мессага.Получатели.Добавить(Стр.Значение);
			 КонецЦикла;	 
		 КонецЕсли; 
		 Мессага.Тема=Тема;
		 ТП=Мессага.Тексты.Добавить(ТекстПисьма);
		 ТП.ТипТекста=ТипТекстаПочтовогоСообщения.ПростойТекст;
		 ТП.Кодировка="windows-1251";
		 
		 
		 Для каждого Стр из СписокВложений Цикл
			 Мессага.Вложения.Добавить(Стр.Значение);
		 КонецЦикла;	 
		 
		 
		 Попытка
			 ЭП.Послать(Мессага);
		 ИСключение
			 #Если Клиент Тогда
			 Сообщить("Не удалось отправить сообщение "+ОписаниеОшибки());
			 #КонецЕсли
			 Возврат;
		 КонецПопытки;
		 
		 #Если Клиент Тогда
		 Сообщить("Отправлено письмо по адресу "+Адресат+" !", СтатусСообщения.Информация);
		 #КонецЕсли
		 
	 ИСКЛЮЧЕНИЕ  // ПРОБЛЕМА С ОТПРАВКОЙ
		 
		 #Если Клиент Тогда
		 Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		 #КонецЕсли
	 КОНЕЦПОПЫТКИ;
	 
КонецПроцедуры	//Послать
//==========================================================GtG====
	

АдресСервераPOP3=Константы.АдресСервераPOP3.Получить();
АдресСервераSMTP=Константы.АдресСервераSMTP.Получить();
ВремяОжидания=Константы.ВремяОжидания.Получить();
Пароль=Константы.ПарольПочтыСклада.Получить();
ПарольSMTP=Константы.ПарольПочтыСклада.Получить();
Пользователь=Константы.ИмяПользователяПочты.Получить();
ПользовательSMTP=Пользователь;
ПортPOP3=Константы.ПортPOP3.Получить();
ПортSMTP=Константы.ПортSMTP.Получить();
Отправитель=Константы.ПользовательПочты.Получить();
	