
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ФиктивныеОстаткиТовара Приход
	Движения.ФиктивныеОстаткиТовара.Записывать = Истина;
	Движения.ФиктивныеОстаткиТовара.Очистить();
	
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ФиктивныеОстаткиТовара.Добавить();
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
		Движение.Период			= Дата;
		Движение.КодСклада		= Склад.Код;
		Движение.КодТовара		= ТекСтрокаТовар.КодТовара;
		Движение.Количество		= ТекСтрокаТовар.Количество;
		Движение.СуммаЗакуп		= ТекСтрокаТовар.СуммаЗакуп;
		Движение.СуммаРозн		= ТекСтрокаТовар.СуммаРозн;
		Движение.СуммаНДСЗакуп	= ТекСтрокаТовар.СуммаНДСЗакуп;
		Движение.СуммаНДСРозн	= ТекСтрокаТовар.СуммаНДСРозн;
		
	КонецЦикла;
	

	// регистр КоэффициентыФиктивныхРеализаций
	Движения.КоэффициентыФиктивныхРеализаций.Записывать = Истина;
	Движения.КоэффициентыФиктивныхРеализаций.Очистить();
	
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.КоэффициентыФиктивныхРеализаций.Добавить();
		Движение.Период			= Дата;
		Движение.КодСклада		= Склад.Код;
		Движение.КодТовара		= ТекСтрокаТовар.КодТовара;
		Движение.Коэффициент	= ТекСтрокаТовар.Коэффициент;		
		
	КонецЦикла;

КонецПроцедуры
