Перем Комец Экспорт;
Перем Ком   Экспорт;
Перем ДатаОстатка Экспорт;


Процедура МодОб_ПодключитьсяНажатие(ФайловаяБаза,Сервер,База,КаталогИБ,Пользователь,Пароль,ЭлементыФормы_Н_СостояниеПодключения,Версия1С)  Экспорт
	
	//Параметры:
	//<Строка соединения> (обязательный)
	//Тип: Строка. Строка параметров, используемая 1С:Предприятием 
	//для соединения с информационной базой.
	//Строка соединения представляет собой набор параметров, каждый из которых является фрагментом вида: 
	//<Имя параметра=><Значение>, 
	//где Имя параметра — имя параметра, а Значение — его значение. 
	//Фрагменты отделяются друг от друга символами ';'. 
	//Если значение содержит пробельные символы, то оно должно быть заключено в двойные кавычки (").
	//Для файлового варианта определен параметр: 
	//File — каталог информационной базы (файловый режим);
	//Для клиент-серверного варианта определены параметры: 
	//Srvr — имя сервера 1С:Предприятия; 
	//Ref — имя информационной базы на сервере;
	//Для всех вариантов определены параметры: 
	//Usr — имя пользователя; 
	//Pwd — пароль и UC<Код доступа> позволяет выполнить установку соединения с информационной базой, 
	//на которую установлена блокировка установки соединений. 
	//Если при установке блокировки задан непустой код доступа, то для установки соединения 
	//необходимо в параметре /UC указать этот код доступа. 
	
	Если ФайловаяБаза=Ложь ТОгда
		СтрокаСоединения="Srvr="""+Сервер+"""; Ref="""+База+"""; ";
	Иначе
		СтрокаСоединения="File="""+КаталогИБ+"""; " ;
	КонецЕсли;
	
	СтрокаСоединения=СтрокаСоединения+" Usr="""+Пользователь+"""; Pwd="""+Пароль+""""; 		
	
	ИмяПодключенойБазы="";

	КонВерсия1С=СтрЗаменить(Версия1С,".","");
	
	
	Попытка
		
		Комец=Новый COMObject("V"+КонВерсия1С+".COMConnector");
		
		СостояниеПодключения="База: Подключаем ("+База+")...";
		ЭлементыФормы_Н_СостояниеПодключения.Заголовок =СостояниеПодключения;
		
		
		
		
		
		Ком=Комец.Connect(СтрокаСоединения);
		
		СостояниеПодключения="База: ПОДКЛЮЧЕНА ("+База+")";
		ЭлементыФормы_Н_СостояниеПодключения.Заголовок =СостояниеПодключения;

		ИмяПодключенойБазы=База;

		
	Исключение
		
		предупреждение("Не удалось подключиться к базе! Причина 
		|"+ОписаниеОшибки());
		
		
		СостояниеПодключения="База: НЕ ПОДКЛЮЧЕНО!!!";
		ЭлементыФормы_Н_СостояниеПодключения.Заголовок =СостояниеПодключения;
        ИмяПодключенойБазы="";
		
	КонецПопытки;
	
	
КонецПроцедуры

Функция СконвертироватьКомТЗВНормальнуюТЗ_ССостТипом(КомТЗ) Экспорт
	
	ТЗ=Новый ТаблицаЗначений;
	
	ПерваяСтрока=КомТЗ.Получить(0);
	
	Для каждого  Кол Из КомТЗ.Колонки  Цикл
		КваС=Новый КвалификаторыСтроки(200,ДопустимаяДлина.Переменная);
		КваЧ=Новый КвалификаторыЧисла(15,2,ДопустимыйЗнак.Любой);
        КваД=Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
        ОписТип=Новый ОписаниеТипов("Строка,Число,Дата",КваЧ,КваС,КваД);
		ТЗ.Колонки.Добавить(Кол.ИМЯ,ОписТип);
	КонецЦикла; 
	
	
	Для каждого  КомСтр Из КомТЗ Цикл
		
		Стр=ТЗ.Добавить();
		
		Для Ы=0 По КомТЗ.Колонки.Количество()-1 Цикл
			Стр.Установить(Ы, КомСтр.Получить(Ы));
		КонецЦикла;
	КонецЦикла; 
	
	Возврат ТЗ;
КонецФункции



Функция СконвертироватьКомТЗВНормальнуюТЗ(КомТЗ) Экспорт
	
	ТЗ=Новый ТаблицаЗначений;
	
	ПерваяСтрока=КомТЗ.Получить(0);
	
	
	Ы=0;
	Для каждого  Кол Из КомТЗ.Колонки  Цикл
		
		ЗначениеКолонкиЫ=ПерваяСтрока.Получить(Ы);
		
		Если ТипЗнч(ЗначениеКолонкиЫ)= Тип("Строка") Тогда
			КваС=Новый КвалификаторыСтроки(0,ДопустимаяДлина.Переменная);
			ОписТип=Новый ОписаниеТипов("Строка",,,,КваС,);

		ИначеЕсли ТипЗнч(ЗначениеКолонкиЫ)= Тип("Число") Тогда
			КваЧ=Новый КвалификаторыЧисла(15,2,ДопустимыйЗнак.Любой);
			ОписТип=Новый ОписаниеТипов("Число",,,КваЧ,,);
		ИначеЕсли ТипЗнч(ЗначениеКолонкиЫ)= Тип("Дата") Тогда
			КваД=Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
			ОписТип=Новый ОписаниеТипов("Дата",,,,,КваД);
        КонецЕсли;
		
		Ы=Ы+1;
				
		
		ТЗ.Колонки.Добавить(Кол.ИМЯ,ОписТип);
	КонецЦикла; 
	
	
	Для каждого  КомСтр Из КомТЗ Цикл
		
		Стр=ТЗ.Добавить();
		
		Для Ы=0 По КомТЗ.Колонки.Количество()-1 Цикл
			Стр.Установить(Ы, КомСтр.Получить(Ы));
		КонецЦикла;
	КонецЦикла; 
	
	Возврат ТЗ;
КонецФункции	


