Процедура ОбновитьДанныеПартии(ТекСтрДок)
	// ВНИМАНИЕ: обновляем ПАРТИЯНОВАЯ ( копируем все со старой )
	Партия=ТекСтрДок.Партия.ПолучитьОбъект(); 
	Партия.Владелец = ТекСтрДок.Товар;
	Партия.СтавкаНДС= ТекСтрДок.СтавкаНДС;
    Партия.ПартияРодитель = ТекСтрДок.ПартияСтарая;

	КучеряваяЗакупЦенаСНДС=ТекСтрДок.СуммаЗакуп / ТекСтрДок.НовоеКоличество; // с ндс,  точность 6 знаков
	Партия.ЦенаЗакуп= КучеряваяЗакупЦенаСНДС; // точность 6 знаков
	Партия.ДокументПоступления=ЭтотОбъект.Ссылка;
	Партия.Поставщик = ТекСтрДок.ПартияСтарая.Поставщик.Ссылка;
	Партия.ЕИТЗакупки=ТекСтрДок.ЕИТ;
	Партия.НомерГТД=ТекСтрДок.ПартияСтарая.НомерГТД;
    Партия.ВидПоступленияТовара = ТекСтрДок.ПартияСтарая.ВидПоступленияТовара;
	Партия.Серия=ТекСтрДок.Серия;
	Партия.ЦенаПроизводителяБезНДС =ТекСтрДок.ЦенаПроизводителя;
	Партия.Записать(); // ибо объект
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//============================< Очистка регистров накопления >================================GtG===
	Движения.ОстаткиПоСтНДСПоСкладам.Очистить(); Движения.ОстаткиПоСтНДСПоСкладам.Записать();
	Движения.ПартииЖНВЛС.Очистить();             Движения.ПартииЖНВЛС.Записать();
	//============================================================================================GtG===
	Для каждого стр из Товар Цикл
		Если стр.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка() Тогда
			Предупреждение("В документе есть пустая ставка НДС! проведение невозможно");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Если стр.ЕИТ =  Справочники.ЕИТ.ПустаяСсылка() Тогда
			Предупреждение("В документе есть пустая ед. изм. ! проведение невозможно");
			Отказ = Истина;
			Возврат;
		КонецЕсли;		
	КонецЦикла;
	
	
	Если СпособПереоприходования = Перечисления.СпособПереоприходования.ССозданиемНовойПартии Тогда
		Для каждого стр из Товар Цикл
			ОбновитьДанныеПартии(стр);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого стр Из Товар Цикл
	
			//----------------------------< Расход  >--------------------------------Virus---
		 
			 ДвижениеП = Движения.ПартииЖНВЛС.Добавить();
			 ДвижениеП.ВидДвижения=ВидДвиженияНакопления.Расход; //ВидДвиженияНакопления.Приход;
			 ДвижениеП.Период = Дата;
			 ДвижениеП.Товар = стр.ТоварСтарый;
			 ДвижениеП.Склад = Склад;
			 ДвижениеП.СтавкаНДС = стр.ПартияСтарая.СтавкаНДС;
			 ДвижениеП.Партия = стр.ПартияСтарая ;
			 ДвижениеП.Фирма= Фирма;
			 ДвижениеП.ВидОперации=Перечисления.ВидыОпераций.ПереоприходованиеЕИТ;
			 
			 ДвижениеП.Колво = стр.КоличествоФакт*стр.КоэффСтарый;
			 ДвижениеП.СуммаЗакупСНДС = стр.СуммаЗакупСтарая;
			 ДвижениеП.СуммаНДСЗакуп = стр.НДСЗакупСтарый;
			 ДвижениеП.СуммаРознСНДС = стр.СуммаЗакупСтарая;
			 ДвижениеП.СуммаРознНДС = стр.НДСЗакупСтарый;

	КонецЦикла; 
	Движения.ПартииЖНВЛС.Записать();	 
	
	Для каждого стр Из Товар Цикл
	
			//----------------------------< Приход  >--------------------------------Virus---
			 //ПартияОбъект = Стр.ПартияНовая.ПолучитьОбъект();
			 //ПартияОбъект = стр.Партия.Скопировать();//ОбновитьДанныеПартии(стр);
			 //ПартияОбъект.Записать();
			 ДвижениеП = Движения.ПартииЖНВЛС.Добавить();
			 ДвижениеП.ВидДвижения=ВидДвиженияНакопления.Приход; //ВидДвиженияНакопления.Приход;
			 ДвижениеП.Период = Дата;
			 ДвижениеП.Товар = стр.Товар;
			 ДвижениеП.Склад = Склад;
			 ДвижениеП.СтавкаНДС = стр.СтавкаНДС;
			 ДвижениеП.Партия = стр.Партия ;
			 ДвижениеП.Фирма= Фирма;
			 ДвижениеП.ВидОперации=Перечисления.ВидыОпераций.ПереоприходованиеЕИТ;
			 
			 ДвижениеП.Колво = стр.НовоеКоличество*стр.Коэфф;
			 ДвижениеП.СуммаЗакупСНДС = стр.СуммаЗакуп;
			 ДвижениеП.СуммаНДСЗакуп = стр.НДСЗакуп;
			 ДвижениеП.СуммаРознСНДС = стр.СуммаЗакуп;
			 ДвижениеП.СуммаРознНДС = стр.НДСЗакуп;

	КонецЦикла; 
	Движения.ПартииЖНВЛС.Записать();
	
	ОМ15_ОчисткаРезерваДокумента  (ЭтотОбъект.Ссылка );
	
	// ЗДЕСЬ НАДО ПОДУМАТЬ , А НАДО ЛИ ДВИГАТЬ РЕГИСТР ВПУСТУЮ
	
	//----------------------------< По регитсру учета по ставке НДС >--------------------------------GtG---
	ТЗПодСвертку = Товар.Выгрузить();
	
	ТЗПодСвертку.Свернуть("СтавкаНДССтарый","СуммаЗакупСтарая,НДСЗакупСтарый");
	
	Для Каждого стр Из ТЗПодСвертку Цикл
		// регистр ОстаткиПоСтНДСПоСкладам Приход
		
		Если стр.СуммаЗакупСтарая=0 тогда
			Продолжить;
		КонецЕсли; 	
		
		
		Движение = Движения.ОстаткиПоСтНДСПоСкладам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.СтавкаНДС = стр.СтавкаНДССтарый;
		Движение.Фирма= Фирма;
		Движение.ВидОперации=Перечисления.ВидыОпераций.ПереоприходованиеЕИТ;

		Движение.СуммаЗакупСНДС = стр.СуммаЗакупСтарая;
		Движение.СуммаНДСЗакуп = стр.НДСЗакупСтарый;
		Движение.СуммаРознСНДС = стр.СуммаЗакупСтарая;
		Движение.СуммаРознНДС = стр.НДСЗакупСтарый;

	КонецЦикла;
	// записываем движения регистров
	Движения.ОстаткиПоСтНДСПоСкладам.Записать();	
	
	
	//----------------------------< По регитсру учета по ставке НДС >--------------------------------GtG---
	ТЗПодСвертку = Товар.Выгрузить();
	
	ТЗПодСвертку.Свернуть("СтавкаНДС","СуммаЗакуп,НДСЗакуп");
	
	Для Каждого стр Из ТЗПодСвертку Цикл
		// регистр ОстаткиПоСтНДСПоСкладам Приход
		
		Если стр.СуммаЗакуп=0 тогда
			Продолжить;
		КонецЕсли; 	
		
		
		Движение = Движения.ОстаткиПоСтНДСПоСкладам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.СтавкаНДС = стр.СтавкаНДС;
		Движение.Фирма= Фирма;
		Движение.ВидОперации=Перечисления.ВидыОпераций.ПереоприходованиеЕИТ;

		Движение.СуммаЗакупСНДС = стр.СуммаЗакуп;
		Движение.СуммаНДСЗакуп = стр.НДСЗакуп;
		Движение.СуммаРознСНДС = стр.СуммаЗакуп;
		Движение.СуммаРознНДС = стр.НДСЗакуп;

	КонецЦикла;
	// записываем движения регистров
	Движения.ОстаткиПоСтНДСПоСкладам.Записать();	
	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ОМ15_ОчисткаРезерваДокумента  (ЭтотОбъект.Ссылка );// должна быть во всех документах, которые касаются резерва количества товара
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОМ41_ПередУдалениемДокумента  (ЭтотОбъект,Отказ);
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	Если Товар.Количество()>0 Тогда
		ПерваяСтрока=ТОвар.Получить(0);
		Если ПерваяСтрока.Партия.Пустая()= Ложь Тогда
			ОМ15_ОчисткаРезерваДокумента( ЭтотОбъект.Ссылка );
			ОМ15_ДобавитьДокументЦеликомВРезервПодбора(ЭтотОбъект.Ссылка,"ПартияСтарая");
		КонецЕсли; 
	КонецЕсли;
	
	//============================< Очистка рагистров накопления >================================GtG===
	Движения.ОстаткиПоСтНДСПоСкладам.Очистить(); Движения.ОстаткиПоСтНДСПоСкладам.Записать();
	Движения.ПартииЖНВЛС.Очистить();             Движения.ПартииЖНВЛС.Записать();
	//============================================================================================GtG===
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеТовара") Тогда
		// Заполнение шапки
		Комментарий = "Введен на основании :" + Строка(Основание.Ссылка);
		Склад = Основание.Склад;
		ДокументОснование = Основание.Ссылка;
		СуммаДок = Основание.СуммаДок;
		Фирма = Основание.Фирма;
		СпособПереоприходования = Перечисления.СпособПереоприходования.ССозданиемНовойПартии;
		Для Каждого ТекСтрокаТовар Из Основание.Товар Цикл
			НоваяСтрока = Товар.Добавить();
			НоваяСтрока.ЕИТСтарый = ТекСтрокаТовар.ЕИТ;
			НоваяСтрока.КоличествоФакт = ТекСтрокаТовар.КоличествоФакт;
			НоваяСтрока.НовоеКоличество = ТекСтрокаТовар.КоличествоФакт;
			НоваяСтрока.КоэффСтарый = ТекСтрокаТовар.Коэфф;
			НоваяСтрока.НДСЗакуп = ТекСтрокаТовар.НДСЗакуп;
			НоваяСтрока.ПартияСтарая = ТекСтрокаТовар.Партия;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовар.СтавкаНДС;
			НоваяСтрока.СуммаЗакуп = ТекСтрокаТовар.СуммаЗакуп;
			НоваяСтрока.ТоварСтарый = ТекСтрокаТовар.Товар;
			НоваяСтрока.Товар		= ТекСтрокаТовар.Товар;
			НоваяСтрока.ЦенаЗакуп = ТекСтрокаТовар.ЦенаЗакуп;
			
			ВыбПартия0 = ТекСтрокаТовар.Партия.Скопировать();
			ВыбПартия0.УстановитьНовыйКод();
			ВыбПартия0.Записать();
		    НоваяСтрока.Партия= ВыбПартия0.Ссылка;			
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
