
Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	#Если   Клиент Тогда
		
		РезВопр=Вопрос("Изменить название отсрочки на 
		|"+ЭтотОбъект.Отсрочка+" "+ЭтотОбъект.БрЭнд+" "+ЭтотОбъект.Регион+" "+ЭтотОбъект.Склад+"?",режимДиалогаВопрос.ДаНет,0);
		
		Если РезВопр=КодВозвратаДиалога.Да ТОгда
			ЭтотОбъект.Наименование=""+ЭтотОбъект.Отсрочка+" "+ЭтотОбъект.БрЭнд+" "+ЭтотОбъект.Регион+" "+ЭтотОбъект.Склад;
			
			Пока Найти(ЭтотОбъект.Наименование,"  ")<>0 Цикл
				ЭтотОбъект.Наименование=СокрЛП(СтрЗаменить(ЭтотОбъект.Наименование,"  "," "));
			КонецЦикла;
		КонецЕсли;
		
	#Конецесли 			
КонецПроцедуры
