Функция ПолучитьДлинныйКодОшибки(Группа,КодОшибки) Экспорт
	
	Возврат Группа*10000+КодОшибки;
	
	
КонецФункции	

Функция ПолучитьОписаниеОшибки_по_КороткимКодам(Группа,КодОшибки) Экспорт
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КодыОшибок.Наименование
	                    |ИЗ
	                    |	Справочник.КодыОшибок КАК КодыОшибок
	                    |ГДЕ
	                    |	КодыОшибок.Родитель.Код = &КодГруппы
	                    |	И КодыОшибок.Код = &КодОшибки");
						
	Запрос.УстановитьПараметр("КодГруппы",Группа);					
	Запрос.УстановитьПараметр("КодОшибки",КодОшибки);		
	
	Рез=Запрос.Выполнить();
	
	Если Рез.Пустой() ТОгда
		Возврат "Неизвестный код ошибки";
	Иначе
		
		Выборка=Рез.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Наименование;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьОписаниеОшибки_по_ДлинномуКоду(ДлинныйКодОшибки) Экспорт
	
	Группа=Цел( ДлинныйКодОшибки/10000);
	КодОшибки= ДлинныйКодОшибки-Группа*10000;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КодыОшибок.Наименование
	                    |ИЗ
	                    |	Справочник.КодыОшибок КАК КодыОшибок
	                    |ГДЕ
	                    |	КодыОшибок.Родитель.Код = &КодГруппы
	                    |	И КодыОшибок.Код = &КодОшибки");
						
	Запрос.УстановитьПараметр("КодГруппы",Группа);					
	Запрос.УстановитьПараметр("КодОшибки",КодОшибки);		
	
	Рез=Запрос.Выполнить();
	
	Если Рез.Пустой() ТОгда
		Возврат "Неизвестный код ошибки";
	Иначе
		
		Выборка=Рез.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Наименование;
	КонецЕсли;	
КонецФункции