
Функция hellow()
	Возврат "Вас приветствует Web-сервис обработки документов АВЕ!";
КонецФункции

Функция set_brak(apt_code, pa_number, pa_date, part_number, reason, qnt)
	
	//part_number - это наименование партии (строка)
	
	Запрос=Новый Запрос();
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ПоступлениеТовара.Ссылка
	             |ИЗ
	             |	Документ.ПоступлениеТовара КАК ПоступлениеТовара
	             |ГДЕ
	             |	ПоступлениеТовара.Склад.Код = &Код
	             |	И ПоступлениеТовара.Номер = &Номер
	             |	И НАЧАЛОПЕРИОДА(ПоступлениеТовара.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Код",apt_code);
	Запрос.УстановитьПараметр("Номер",pa_number);
	Запрос.УстановитьПараметр("Дата",pa_date);
	
	Рез=Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,1); // документ не найден
	КонецЕсли;
	
	Выб=Рез.Выбрать();
	Выб.Следующий();
	
	Док=Выб.Ссылка.ПолучитьОбъект();
	
	СтрокаПартии=Док.Товар.Найти(Справочники.Партии.НайтиПоНаименованию(СокрЛП(part_number),Истина),"Партия");
	
	Если СтрокаПартии=Неопределено ТОгда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,2); // Партия не найдена в документе
	КонецЕсли;
	
	Если СтрокаПартии.Количество-СтрокаПартии.Недовоз<qnt Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,3); // Количество  превышает количество поступившего товара.
	КонецЕсли;
	
	СтрокаПартии.БойБрак=qnt;
	
	СтрИзм=Док.Изменения.Добавить();
	СтрИзм.Сотрудник=ПараметрыСеанса.ТекущийСотр;
	СтрИзм.Дата =ТекущаяДата();
	СтрИзм.ТипИзм=Перечисления.ДействияНадДокументами.Откорректирован;
	СтрИзм.КомментарийИзменения="Изменен бой/брак по партии "+part_number+" установлено "+qnt;

	
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,4); // Не удалось перепровести документ поступления товара в офисе.
	КонецПопытки;
	
	МЗ=РегистрыСведений.ПричиныЗабраковкиПартий.СоздатьМенеджерЗаписи();
	МЗ.ПоступлениеТовара=Док.Ссылка;
	МЗ.Партия=СтрокаПартии.Партия;
	МЗ.Прочитать();
	
	МЗ.ДатаВнесенияЗаписи=ТекущаяДата();
	МЗ.ПричинаЗабраковки=СокрЛП(reason);
	МЗ.ПоступлениеТовара=Док.Ссылка;
	МЗ.Партия=СтрокаПартии.Партия;
	МЗ.Записать();
	
//---------------<Если все прошло удачно>---------------------------// GtG // 23.05.2013 11:59:34
	Возврат 0; //ОК
КонецФункции



Функция set_nedovoz(apt_code, pa_number, pa_date, part_number, qnt)
	//part_number - это наименование партии (строка)
	
	Запрос=Новый Запрос();
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ПоступлениеТовара.Ссылка
	             |ИЗ
	             |	Документ.ПоступлениеТовара КАК ПоступлениеТовара
	             |ГДЕ
	             |	ПоступлениеТовара.Склад.Код = &Код
	             |	И ПоступлениеТовара.Номер = &Номер
	             |	И НАЧАЛОПЕРИОДА(ПоступлениеТовара.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Код",apt_code);
	Запрос.УстановитьПараметр("Номер",pa_number);
	Запрос.УстановитьПараметр("Дата",pa_date);
	
	Рез=Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,1); // документ не найден
	КонецЕсли;
	
	Выб=Рез.Выбрать();
	Выб.Следующий();
	
	Док=Выб.Ссылка.ПолучитьОбъект();
	
	СтрокаПартии=Док.Товар.Найти(Справочники.Партии.НайтиПоНаименованию(СокрЛП(part_number),Истина),"Партия");
	
	Если СтрокаПартии=Неопределено ТОгда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,2); // Партия не найдена в документе
	КонецЕсли;
	
	Если СтрокаПартии.Количество-СтрокаПартии.БойБрак<qnt Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,3); // Количество  превышает количество поступившего товара.
	КонецЕсли;
	
	СтрокаПартии.Недовоз=qnt;
	
	//-------------- Пересчет строки документа: ---------------	
	СтрокаПартии.КоличествоФакт=СтрокаПартии.Количество-СтрокаПартии.Недовоз;
	СтрокаПартии["ЦенаЗакуп"]=СтрокаПартии["ЦенаЗакупБезНДС"]+СтрокаПартии["ЦенаЗакупБезНДС"]/100*СтрокаПартии.СтавкаНДС.Ставка;
	СтрокаПартии["СуммаЗакуп"]=СтрокаПартии["ЦенаЗакуп"]*СтрокаПартии.КоличествоФАКТ; // !!! ПО ФАКТИЧЕСКОМУ КОЛВУ !!!
	СтрокаПартии["НДСЗакуп"]=СтрокаПартии["ЦенаЗакупБезНДС"]/100*СтрокаПартии.СтавкаНДС.Ставка*СтрокаПартии.КоличествоФАКТ;
	
	
	СтрокаПартии["СуммаРозн"]=СтрокаПартии["ЦенаРозн"]*СтрокаПартии.КоличествоФАКТ; // !!! ПО ФАКТИЧЕСКОМУ КОЛВУ !!! // GtG 31.07.2008 15:00:49 при недовозе при прямом приходе в аптеку
	СтрокаПартии.СуммаРозн = СтрокаПартии.ЦенаРозн*СтрокаПартии.КоличествоФакт;	
	СтрокаПартии.НДСРозн = ОМ3_ПолучитьНДСПоСуммеСНДСИСтавке(СтрокаПартии.СуммаРозн,СтрокаПартии.СтавкаНДС);
	СтрокаПартии.СуммаОтклоненийСНДС	= СтрокаПартии.ЦенаЗакуп*(СтрокаПартии.БойБрак+СтрокаПартии.Недовоз);
	
	//--------------	
	
	СтрИзм=Док.Изменения.Добавить();
	СтрИзм.Сотрудник=ПараметрыСеанса.ТекущийСотр;
	СтрИзм.Дата =ТекущаяДата();
	СтрИзм.ТипИзм=Перечисления.ДействияНадДокументами.Откорректирован;
	СтрИзм.КомментарийИзменения="Изменен недовоз по партии "+part_number+" установлено "+qnt;
	
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,4); // Не удалось перепровести документ поступления товара в офисе.
	КонецПопытки;
	
		
//---------------<Если все прошло удачно>---------------------------// GtG // 23.05.2013 11:59:34
	Возврат 0; //ОК

КонецФункции



Функция delete_to(apt_code,to_begin_date)
	// Вставить содержимое обработчика.
	
	Аптека=Справочники.МестаХранения.НайтиПоКоду(apt_code);
	
	Если Аптека.Пустая()=Истина или Аптека=Неопределено Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,5); // Аптека не найдена по указанному коду.
	КонецЕсли;	
	
	МЗ=РегистрыСведений.ТоварныеОтчеты.СоздатьМенеджерЗаписи();
	
	МЗ.Аптека=Аптека;
	
	МЗ.Прочитать();
	
	УдаленныйТОНачПериода=МЗ.НачПериода;
	УдаленныйТОКонПериода=МЗ.КонПериода;

	
	МЗ.Аптека=Аптека;
	
	МЗ.НачПериода=КонецДня( НачалоДня(to_begin_date)-100);
	МЗ.КонПериода=МЗ.НачПериода;
	МЗ.ДатаЗакрытия=МЗ.НачПериода;
	МЗ.ДатаСверки=ТекущаяДата();
	МЗ.ДопИнформация="Товарный отчет удален аптекой "+ТекущаяДата()+"
					|Период удаленного отчета С "+Формат(УдаленныйТОНачПериода,"ДЛФ=D")+" по "+Формат(УдаленныйТОКонПериода,"ДЛФ=D");
	МЗ.ОтменаЗапрета=ложь;
	
	
	Попытка
		МЗ.Записать();
	Исключение
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,6); // Не удалось записать данные о сверке товарного отчета.
	КонецПопытки;
	
	
	
	
	
	
	
	
	
	
	//---------------<Если все прошло удачно>---------------------------// GtG // 23.05.2013 11:59:34
	Возврат 0;
КонецФункции







