//-----------------------------------------------------------------------------------------------// GtG |>03.10.2016 14:59:44
// Автоматическая установка 1С с правами администратора  Должен выполняться на клиентской машине //
//-----------------------------------------------------------------------------------------------// GtG <|

Функция ПолучитьПроксиОбновлятора()
	Попытка
		АдресWSDL="Http://10.250.205.90:8081/Grym_TASKER/ws/gtg_orgdbregister.1cws?wsdl";
		TargetNamespace="GTG_OrgDBRegister"; 
		DefinitionsName="OrgDBRegister";
		PortName="OrgDBRegisterSoap12";
		
		
		Определение=Новый WSОпределения(СокрЛП(АдресWSDL));  // без пароля
		
		
		Прокси = Новый WSПрокси(Определение,
		СокрЛП(TargetNamespace),
		СокрЛП(DefinitionsName),
		СокрЛП(PortName),       
		0);
		Возврат Прокси;
	Исключение
		Возврат Неопределено;
	КонецПопытки;	
	
КонецФункции


Функция ПолучитьКорень1С() 
	
	КаталогПрограммы=КаталогПрограммы();
	КаталогПрограммы=СтрЗаменить(КаталогПрограммы,"\",символы.пс);
	
	МаксЫ=СтрЧислоСтрок(КаталогПрограммы)-2;
	
	Корень="";
	Для Ы=1 по МаксЫ Цикл
		
		Корень=Корень+СтрПолучитьСтроку(Каталогпрограммы,Ы)+?(Ы=МаксЫ,"","\");
	КонецЦикла;	
	
	
	Возврат Корень;
	
	
КонецФункции



Функция ПолучитьМассивВерсий1С() 
	
	МассивВерсий=Новый Массив;
	
	Корень=ПолучитьКорень1С();
	
	//---------------<Win7+ или 64bit>---------------------------// GtG // 05.09.2016 19:15:18 
	Попытка
		МассивчегПапок=НайтиФайлы(Корень,"8.*",Ложь);
		Для Каждого Папка из МассивчегПапок Цикл
			МассивВерсий.Добавить(СокрЛП(Папка.Имя));
		КонецЦикла;
	Исключение
		
    Конецпопытки;
	
	Возврат МассивВерсий;
	
КонецФункции	



Функция ПолучитьИмяДоменаКомпьютера()
	
	Попытка
		Info = Новый COMОбъект("AdSystemInfo");
		
		GetDomainName = Info.DomainDNSName ;
		
		Возврат ""+GetDomainName+"\";
		
		
	Исключение
		Возврат "неизвестныйдомен\";

	Конецпопытки;
	
	
КонецФункции	



Процедура  ADMIN_ОтправитьСписокВерсий1С() Экспорт  // запускать при начале работы системы
	
		//---------------<Отправляем в базу задачника>---------------------------// GtG // 05.09.2016 19:16:44 
	
		Попытка
			
		МассивВерсий=ПолучитьМассивВерсий1С() ;
		
		Прокси=ПолучитьПроксиОбновлятора();
		Если Прокси <>Неопределено тогда
			Результат=Прокси.List_1s_ver(""+ПолучитьИмяДоменаКомпьютера()+""+ИмяКомпьютера(),СериализаторXDTO.ЗаписатьXDTO(МассивВерсий));
		Иначе
			ЗаписьЖурналаРегистрации("ADMIN",УровеньЖурналаРегистрации.Ошибка,,"Не удалось отправить список версий. Недоступна база задачника.",,);
		КонецЕсли;
		
	Исключение
		
	Конецпопытки;

	
КонецПроцедуры	



Функция ОпределитьНеобходимостьобновления()
	
	
	МассивИмеющихся=ПолучитьМассивВерсий1С();
	
	Прокси=ПолучитьПроксиОбновлятора();
	Если прокси=неопределено тогда
		возврат ложь;
	конецесли;
	
	
	НомерСвежейВерсии=Прокси.get_fresh_ver_number();
	
	Если ПустаяСтрока(НомерСвежейВерсии) Тогда
		Возврат Ложь;
	КонецЕсли;	
		
	Если МассивИмеющихся.Найти(СокрЛП(НомерСвежейВерсии))<> Неопределено Тогда
		Возврат Ложь;// уже есть
	КонецЕсли;	
	
	
	Возврат НомерСвежейВерсии; // Нужно грузить обновление
	
КонецФункции	






Процедура GTG_АВТОМАТИЧЕСКОЕ_ОБНОВЛЕНИЕ_1С() Экспорт
	
	ADMIN_ОтправитьСписокВерсий1С();
	
	ТребуетсяОбновление=ОпределитьНеобходимостьОбновления(); // ложь или строка версии
	
	Если ТребуетсяОбновление<>ложь Тогда
		Сообщить("Требуется обновление программы 1С до версии "+ТребуетсяОбновление+" !"+Символы.ПС+
				 "Обновление будет установлено автоматически после перезагрузки компьютера."+Символы.ПС+
				 "Вы можете:"+Символы.ПС+
				 "  1) Перезагрузить компьютер сейчас и обновление установится сегодня,"+Символы.ПС+
				 "  2) Либо выключить компьютер сегодня вечером после работы, в этом случае обновление "+Символы.ПС+ 
				 "     установится при следующем включении компьютера."+символы.ПС+
				 "Если после перезагрузки компьютера обновление не установилось и вы опять видите это сообщение"+символы.ПС+
				 "напишите письмо с темой Заявка на адрес helpdesk@366.ru, а в тексте письма укажите :"+символы.ПС+
				 "   На компьютере "+ПолучитьИмяДоменаКомпьютера()+ИмяКомпьютера()+" автоматически не устанавливается обновление 1С");
	КонецЕсли;	
		
	
	
КонецПроцедуры	



 