

////НЭТИ Барданов А.Ю. 29.01.2019 ENT-724
//Процедура ПередЗаписью(Отказ, Замещение)
//	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;
//	Если Модифицированность() ИЛИ ЭтотОбъект.Количество() > 0  Тогда
//		ОтклонитьУдалениеЗаблокированныхЗаписейМатрицы(ЭтотОбъект,Отказ); 	
//		//Отказ = Истина;
//		//Возврат;
//	КонецЕсли;	

//КонецПроцедуры

////НЭТИ Барданов А.Ю. 29.01.2019 ENT-724
//Процедура ОтклонитьУдалениеЗаблокированныхЗаписейМатрицы(Знач Источник, Отказ)
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ
//		               |	ТекущийНабор.Аптека КАК Аптека,
//		               |	ТекущийНабор.Товар КАК Товар,
//		               |	ТекущийНабор.ВидНЗ КАК ВидНЗ,
//		               |	ТекущийНабор.НЗ КАК НЗ,
//		               |	ТекущийНабор.РекламнаяАкция КАК РекламнаяАкция,
//		               |	ТекущийНабор.ДатаНачалаАкции КАК ДатаНачалаАкции,
//		               |	ТекущийНабор.СрокДействияРекламы КАК СрокДействияРекламы,
//		               |	ТекущийНабор.УсловиеРекламнойАкции КАК УсловиеРекламнойАкции,
//		               |	ТекущийНабор.КтоВнесВМатрицу КАК КтоВнесВМатрицу,
//		               |	ТекущийНабор.ДатаВнесенияВМатрицу КАК ДатаВнесенияВМатрицу,
//		               |	ТекущийНабор.Блок КАК Блок
//		               |ПОМЕСТИТЬ ТекущийНабор
//		               |ИЗ
//		               |	&ТекущийНабор КАК ТекущийНабор
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	СуществующиеЗаписи.Аптека КАК Аптека,
//		               |	СуществующиеЗаписи.Товар КАК Товар,
//		               |	СуществующиеЗаписи.ВидНЗ КАК ВидНЗ,
//		               |	СуществующиеЗаписи.НЗ КАК НЗ,
//		               |	СуществующиеЗаписи.РекламнаяАкция КАК РекламнаяАкция,
//		               |	СуществующиеЗаписи.ДатаНачалаАкции КАК ДатаНачалаАкции,
//		               |	СуществующиеЗаписи.СрокДействияРекламы КАК СрокДействияРекламы,
//		               |	СуществующиеЗаписи.УсловиеРекламнойАкции КАК УсловиеРекламнойАкции,
//		               |	СуществующиеЗаписи.КтоВнесВМатрицу КАК КтоВнесВМатрицу,
//		               |	СуществующиеЗаписи.ДатаВнесенияВМатрицу КАК ДатаВнесенияВМатрицу,
//		               |	СуществующиеЗаписи.Блок КАК Блок
//		               |ПОМЕСТИТЬ СуществующиеЗаписи
//		               |ИЗ
//		               |	&СуществующиеЗаписи КАК СуществующиеЗаписи
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	Матрица.Аптека КАК Аптека,
//		               |	Матрица.Товар КАК Товар,
//		               |	Матрица.ВидНЗ КАК ВидНЗ,
//		               |	Матрица.НЗ КАК НЗ,
//		               |	Матрица.РекламнаяАкция КАК РекламнаяАкция,
//		               |	Матрица.ДатаНачалаАкции КАК ДатаНачалаАкции,
//		               |	Матрица.СрокДействияРекламы КАК СрокДействияРекламы,
//		               |	Матрица.УсловиеРекламнойАкции КАК УсловиеРекламнойАкции,
//		               |	Матрица.КтоВнесВМатрицу КАК КтоВнесВМатрицу,
//		               |	Матрица.ДатаВнесенияВМатрицу КАК ДатаВнесенияВМатрицу,
//		               |	Матрица.Блок КАК Блок
//		               |ПОМЕСТИТЬ ЗаблокированныеЗаписи
//		               |ИЗ
//		               |	СуществующиеЗаписи КАК Матрица
//		               |ГДЕ
//		               |	Матрица.Блок = ИСТИНА
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	ЕСТЬNULL(ТекущийНабор.Аптека, ЗаблокированныеЗаписи.Аптека) КАК Аптека,
//		               |	ЕСТЬNULL(ТекущийНабор.Товар, ЗаблокированныеЗаписи.Товар) КАК Товар,
//		               |	ЕСТЬNULL(ТекущийНабор.ВидНЗ, ЗаблокированныеЗаписи.ВидНЗ) КАК ВидНЗ,
//		               |	ЕСТЬNULL(ТекущийНабор.НЗ, ЗаблокированныеЗаписи.НЗ) КАК НЗ,
//		               |	ЕСТЬNULL(ТекущийНабор.РекламнаяАкция, ЗаблокированныеЗаписи.РекламнаяАкция) КАК РекламнаяАкция,
//		               |	ЕСТЬNULL(ТекущийНабор.ДатаНачалаАкции, ЗаблокированныеЗаписи.ДатаНачалаАкции) КАК ДатаНачалаАкции,
//		               |	ЕСТЬNULL(ТекущийНабор.СрокДействияРекламы, ЗаблокированныеЗаписи.СрокДействияРекламы) КАК СрокДействияРекламы,
//		               |	ЕСТЬNULL(ТекущийНабор.УсловиеРекламнойАкции, ЗаблокированныеЗаписи.УсловиеРекламнойАкции) КАК УсловиеРекламнойАкции,
//		               |	ЕСТЬNULL(ТекущийНабор.КтоВнесВМатрицу, ЗаблокированныеЗаписи.КтоВнесВМатрицу) КАК КтоВнесВМатрицу,
//		               |	ЕСТЬNULL(ТекущийНабор.ДатаВнесенияВМатрицу, ЗаблокированныеЗаписи.ДатаВнесенияВМатрицу) КАК ДатаВнесенияВМатрицу,
//		               |	ЕСТЬNULL(ТекущийНабор.Блок, ЗаблокированныеЗаписи.Блок) КАК Блок
//		               |ИЗ
//		               |	ТекущийНабор КАК ТекущийНабор
//		               |		ПОЛНОЕ СОЕДИНЕНИЕ ЗаблокированныеЗаписи КАК ЗаблокированныеЗаписи
//		               |		ПО ЗаблокированныеЗаписи.Аптека = ТекущийНабор.Аптека
//		               |			И ЗаблокированныеЗаписи.Товар = ТекущийНабор.Товар
//		               |			И ЗаблокированныеЗаписи.ВидНЗ = ТекущийНабор.ВидНЗ";
//	Запрос.УстановитьПараметр("ТекущийНабор", Источник.Выгрузить());
//	СуществующийНабор = Источник;
//	СуществующийНабор.Прочитать(); 
//	СуществующиеЗаписи = СуществующийНабор.Выгрузить(); 
//	Запрос.УстановитьПараметр("СуществующиеЗаписи", СуществующиеЗаписи);

//    Выгрузка = Запрос.Выполнить().Выгрузить();
//	Источник.Загрузить(Выгрузка);
//КонецПроцедуры	