// <Описание функции>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   – <описание возвращаемого значения>
//
Функция ПроверкаНаЛатинскийШрифт(Строчка,Заглавные=Ложь,Строчные=Ложь,ПохерCase =Ложь)
	
	Строчка=СокрЛП(Строчка);
	лим=СтрДлина(строчка);
	Для Ы=1 По Лим Цикл
		Сим=Сред(Строчка, Ы,1);
		КС=КодСимвола(Сим);
		
		//48(цифры)...65(А)...90(Z)
		//97...122 a..z
		
		Если  ПохерCase  Тогда
			если (КС>=48 и КС<=90) или (КС>=97 и КС<=122) тогда
				//ок
			иначе
				возврат Ложь;
			КонецЕсли;
		КонецЕсли; 
		
		Если  Заглавные  Тогда
			если (КС>=48 и КС<=90) тогда
				//ок
			иначе
				возврат Ложь;
			КонецЕсли;
		КонецЕсли; 
		
		Если  Строчные  Тогда
			если (КС>=97 и КС<=122) тогда
				//ок
			иначе
				возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	возврат истина;//ок все символы

КонецФункции // ПроверкаНаЛатинскийШрифт()
 
Функция КонтрольУникальности(ПолучившеесяНаименование)
	// позволяет избежать задвоенных наименовай
	Нашли=Справочники.КартаСклада.НайтиПоНаименованию(ПолучившеесяНаименование,истина,,ЭтотОбъект.Владелец.Ссылка);
	
	Если Нашли=Справочники.КартаСклада.ПустаяСсылка() тогда
		Возврат Истина;
	Иначе
		Если Нашли=ЭтотОбъект.Ссылка тогда
			Возврат Истина;// сам себя может редактировать
		Иначе
			Возврат Ложь;// это кто-то другой!
		КонецЕсли;
		 	
	КонецЕсли;
КонецФункции // КонтрольУникальности()
 


Процедура ПередЗаписью(Отказ)
	
	
	
	Если СокрЛп(Зона)=""   Тогда
		Сообщить("Зона не может быть пустой!");
		Отказ=Истина;
	КонецЕсли; 

	
	
	
	Если ПроверкаНаЛатинскийШрифт(Зона,Истина)=Ложь тогда 
		// проверка написания ряда заглавной латиницей
		Сообщить("Зона должна обозначаться латинскими заглавными буквами и/или цифрами!");
		Отказ=Истина;
	КонецЕсли;
		
	ПолучившеесяНаименование=Зона+"-"+Стеллаж+"-"+ Секция +"-"+ Полка; 
	
	Если КонтрольУникальности(ПолучившеесяНаименование)=Ложь Тогда // защита от дублей 
	     Сообщить("Уже существует ячейка склада с адресом "+ПолучившеесяНаименование);
		Отказ=Истина;
	КонецЕсли;
	 	
 
	ЭтотОбъект.Наименование	= ПолучившеесяНаименование;
КонецПроцедуры
