
Процедура ПередЗаписью(Отказ)
	//ENT-1317 +++
	Если Значение <> Константы.ВремяЗавершениеРаботыПользователей.Получить() Тогда
		Если Константы.ВремяЗавершениеРаботыПользователей.Получить() = Дата(1,1,1) ТОгда
			ОбщегоНазначения.ПослатьСообщениеВТелеграм("Пользователем " + Строка(ПараметрыСеанса.ТекущийСотр) + " установлено время завершения работы пользователей " + Строка(Значение),65); //ENT-1584
		Иначе
			ОбщегоНазначения.ПослатьСообщениеВТелеграм("Пользователем " + Строка(ПараметрыСеанса.ТекущийСотр) + " очищено время завершения работы пользователей",65);	//ENT-1584		
		КонецЕсли;
	КонецЕсли;
	//---
КонецПроцедуры
