
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтоНовыйДокумент = Ссылка.Пустая();

	Если ЭтоНовыйДокумент Тогда
		РанееУстановленнаяПометкаУдаления = Ложь;

	Иначе

		Запрос = Новый Запрос();		 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	0 КАК КолВо
		|ИЗ
		|	Документ.КорректировкаРасхода КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|	И НЕ Док.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);		
		Результат = Запрос.Выполнить(); 
		РанееУстановленнаяПометкаУдаления = Результат.Пустой();

	КонецЕсли;
	
	Если ПометкаУдаления <> РанееУстановленнаяПометкаУдаления Тогда
		
		Движ = Движения.КорректировкиРасхода;
		Движ.Записывать = Истина;
		
		Если Не Движ.Модифицированность() И Не Движ.Выбран() И Не ЭтоНовыйДокумент Тогда
			
			Движ.Прочитать();
			
		КонецЕсли;
		
		КоличествоПроводок = Движ.Количество();
		
		Если КоличествоПроводок > 0 Тогда
			
			// Определяем текущую активность проводок по первой проводке
			ТекущаяАктивностьПроводок = Движ[0].Активность;
			НужнаяАктивностьПроводок  = НЕ ПометкаУдаления;
			
			Если ТекущаяАктивностьПроводок <> НужнаяАктивностьПроводок Тогда
				Движ.УстановитьАктивность(НужнаяАктивностьПроводок);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
