Функция ОкультуритьПараметры(Параметры)
	
	Если ТипЗНч(Параметры)<>Тип("Форма") Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	//---------------<Выдергиваем все возможные данные из формы объекта>---------------------------// GtG // 09.02.2012 20:18:49
	ИгнорируемыеТипы=Новый СписокЗначений;
	ИгнорируемыеТипы.Добавить(тип("Надпись"));
	ИгнорируемыеТипы.Добавить(тип("Кнопка"));
	ИгнорируемыеТипы.Добавить(тип("Картинка"));
	ИгнорируемыеТипы.Добавить(тип("ПолеТабличногоДокумента"));
	ИгнорируемыеТипы.Добавить(тип("ПолеТабличногоДокументаФормы"));
	ИгнорируемыеТипы.Добавить(тип("ПолеHTMLДокумента"));
	ИгнорируемыеТипы.Добавить(тип("ПолеHTMLДокументаФормы"));
	//ИгнорируемыеТипы.Добавить(тип("ПолеТекстовогоДокумента")); // запросы в построителе консоли и т.д.
	//ИгнорируемыеТипы.Добавить(тип("ПолеТекстовогоДокументаФормы"));
	ИгнорируемыеТипы.Добавить(тип("Индикатор"));
	ИгнорируемыеТипы.Добавить(тип("КоманднаяПанель"));
	ИгнорируемыеТипы.Добавить(тип("КоманднаяПанельФормы"));
	ИгнорируемыеТипы.Добавить(тип("Разделитель"));
	ИгнорируемыеТипы.Добавить(тип("Панель"));
	
	СохраняемыеДанные=Новый Соответствие;
	
	Для Каждого ЭлемФормы Из Параметры.ЭлементыФормы Цикл
		// не пишем данные об элементах, в которых нет полезной информации
		Если ИгнорируемыеТипы.НайтиПоЗначению(ТипЗнч(ЭлемФормы))<>Неопределено Тогда
			продолжить;
		КонецЕсли;	
		
		
		СохраняемыеДанные.Вставить(ЭлемФормы.Имя,ЭлемФормы.Значение);
	КонецЦикла;	

	Возврат СохраняемыеДанные; // структура данных из формы, где ключ - имя элемента формы, а заначение - его значение.
	
КонецФункции	






// Вызываем так:
// ОтметкаАудита(ЭтотОбъект,ЭтаФорма,"Нажата какая-то там кнопка")

Процедура ОтметкаАудита(Объект,Параметры,Комментарий="") Экспорт
	
	МаксСтепеньСжатия=Новый СжатиеДанных(9);

	
	ЗаписьАудита=Справочники.Аудит.СоздатьЭлемент();
	ЗаписьАудита.Пользователь=ПараметрыСеанса.ТекущийСотр;
	ЗаписьАудита.Компьютер=ИмяКомпьютера();
	
	ЗаписьАудита.Объект=Объект;
		
	ЗаписьАудита.Дата=ТекущаяДата();
	ЗаписьАудита.Значение=Новый ХранилищеЗначения(ОкультуритьПараметры(Параметры),МаксСтепеньСжатия); // храним в сжатом виде для экономии места(?)
	
	Попытка
		ЗаписьАудита.Комментарий=""+Объект.ИспользуемоеИмяФайла+Символы.ПС+Комментарий;
	Исключение
		ЗаписьАудита.Комментарий=Комментарий;
	КонецПопытки;
	ЗаписьАудита.Записать();	
	
КонецПроцедуры	