
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	РешениеПоставщика = Истина;
	ПолностьюВыполнен = Истина;
	ЧастичноВыполнен = Ложь;
	Отправлен = Истина;
	
	Для Каждого ТекСтрока Из Товары Цикл
		
		Если ТекСтрока.Аннулировано Или ТекСтрока.Дубль Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.ЗакрывающийДокумент) Тогда			
			ЧастичноВыполнен = Истина;
			
		Иначе			
			ПолностьюВыполнен = Ложь;
			
			Если Не ЗначениеЗаполнено(ТекСтрока.КодРешенияПоставщика) Тогда
				РешениеПоставщика = Ложь;
				
				Если Не ТекСтрока.ОтправленоПоставщику Тогда
					Отправлен = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Просрочка21 = Дата + 21*24*60*60 < ТекущаяДата();
	Просрочка14 = Дата + 14*24*60*60 < ТекущаяДата(); 	
	
	Если ПолностьюВыполнен Тогда
		Статус = Перечисления.СтатусыДокументаПретензииПоставщику.Выполнен;
	ИначеЕсли Отправлен = Ложь Тогда
		Статус = Перечисления.СтатусыДокументаПретензииПоставщику.Зарегистрирован;
	ИначеЕсли ЧастичноВыполнен Тогда
		Статус = Перечисления.СтатусыДокументаПретензииПоставщику.ЧастичноВыполнен;	
	ИначеЕсли Просрочка21 Тогда
		Статус = Перечисления.СтатусыДокументаПретензииПоставщику.Просрочен;  		
	ИначеЕсли Просрочка14 Тогда
		Статус = Перечисления.СтатусыДокументаПретензииПоставщику.НеВыполнен;		
	ИначеЕсли РешениеПоставщика Тогда
		Статус = Перечисления.СтатусыДокументаПретензииПоставщику.РешениеПоставщика;
	Иначе
		Статус = Перечисления.СтатусыДокументаПретензииПоставщику.ОтправленПоставщику;
	КонецЕсли;
	
КонецПроцедуры

