Функция ПолучитьТоварПоКоду(ТоварКод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АССОРТИМЕНТНЫЙ_ПЛАН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
	|ГДЕ
	|	АССОРТИМЕНТНЫЙ_ПЛАН.Код = &Код";

	
	Запрос.УстановитьПараметр("Код", ТоварКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.АССОРТИМЕНТНЫЙ_ПЛАН.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.Ссылка;	

КонецФункции
