
Процедура ОбработкаЗаполнения(Основание)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаДоработку") Тогда
		// Заполнение шапки
		Текст = "Выполнена заявка на доработку №"+
		Основание.Номер+" от "+Формат(Основание.Дата,"ДФ=dd.MM.yyyy")+
		" заказчик:"+Основание.АвторЗаявки+Символы.ПС + Символы.ПС+
		"----------------------------------------------------"+ Символы.ПС+
		Основание.ТекстЗавяки+Символы.ПС+
		"----------------------------------------------------"+ Символы.ПС;
		АктуальнаДо=ТекущаяДАта()+5*24*60*60;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
