Функция ОМ8_СуперГдя(СписокГдей,Связка="AND",БезГде=Ложь) Экспорт
	// Формирует из списка значений условие Where с заданной связкой (AND по умолчанию)
	// в качестве значения передается список типа 
	//Оно= &ХЗ  
	//НуЕго=&Нах  
	//Засунуть В (&Pfl)
	//----------------------------<  >--------------------------------GtG---
	//В результате получим строку условия типа 
	// Where
	//   Оно= &ХЗ  
	// and
	//   НуЕго=&Нах  
	// and
	//   Засунуть В (&Pfl)
    //----------------------------< -------------------------- >--------------------------------GtG---
	
	
	
	Если СписокГдей.Количество()>0 Тогда
		Если БезГде=Ложь Тогда
			СуперГдя="
			|WHERE
			|";
		Иначе
			СуперГдя="
			|";
	КонецЕсли; 
	
		СтрГди=	СписокГдей.Получить(0);
		СуперГдя=СуперГдя+СтрГди.Значение+"
		|";
		
		Если СписокГдей.Количество()>1 Тогда					
			Для Ы=1 По 			СписокГдей.Количество()-1 Цикл
				СтрГди=	СписокГдей.Получить(Ы);
				СуперГдя=СуперГдя+Связка+"
				|  "+СтрГди.Значение+"
				|";
			КонецЦикла;
			
		КонецЕсли;
	Иначе
		СуперГдя="
		|";
	КонецЕсли;
	
	Возврат СуперГдя;		
КонецФункции			



//============================< унивесральная процедура выполнения запроса на сервере!!! >================================GtG===

//============================================================================ GtG ===
#IF SERVER THEN
	Функция ОМ8_ВыполнитьЗапросНаСервере  (Тхт,СПЗВнутрСтр="",Знач ПарамОбхода=1) Экспорт
		// Назначение:
		// Выполняет запрос на сервере возвращает таблицу значений
		// ТХТ- текст запроса
		// СПЗ - Структура сконверченная через ЗначениеВСтрокуВнутр()  (значение - значение парам запроса ключ - имя переменной запроса)
		//--------------------------------------------------------------------------------
		
		Запрос= Новый  Запрос;
		Запрос.Текст=тхт;
		
		//СПЗ= Новый  Структура();
		Если СтрДлина(СПЗВнутрСтр)>0 Тогда
			СПЗ= ЗначениеИзСтрокиВнутр(СПЗВнутрСтр);
			
			Для каждого Зн Из СПЗ Цикл
				Запрос.УстановитьПараметр(ЗН.Ключ,Зн.Значение);
			КонецЦикла; 
		КонецЕсли;
		
		Попытка
			Рез=Запрос.Выполнить();
		Исключение
			Сообщить("--------------------------------------------------------------");
			Сообщить("ОМ8_ВыполнитьЗапросНаСервере:	ОШИБКА при выполнении запроса!!!");
			Сообщить(тхт);
			Сообщить(ОписаниеОшибки());
			Сообщить("--------------------------------------------------------------");
			
			Возврат Неопределено;// затычка для последующего разбора 
		КонецПопытки;
		
		Если ПарамОбхода=1 Тогда
			ПОбх=ОбходРезультатаЗапроса.Прямой;
			Возврат Рез.Выгрузить(ПОбх); // Таблица значений
		ИначеЕсли ПарамОбхода=2 Тогда	
			ПОбх=ОбходРезультатаЗапроса.ПоГруппировкам;
			Возврат Рез; // 
		ИначеЕсли ПарамОбхода=3 Тогда	
			ПОбх=ОбходРезультатаЗапроса.ПоГруппировкамСИерархией;
			Возврат Рез; // 
		КонецЕсли;	
	КонецФункции
#ENDIF
 //============================================================================ GtG ===
 


//------------------<запрос к внешней sql базе данных>-------------------GtG---- 
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***//
Функция ОМ8_ВыполнитьSQLЗапросКВнешнейБД(АДО_Конн,ТекстЗапроса,ТАЙМАУТ=0,АдоИД=1,Способ=0) Экспорт // ---- by  GtG ---- 
	// Назначение:
	// Выполняет SQL запрос в рамках указаннонго
	// ADODB.Connection , причем оно должно быть открыто!
	// Возвращает ADODB.RecordSet если это Select или ничего
	// ТАЙМАУТ (СЕКУНД) ДЛЯ ДОЛГИХ ЗАПРОСОВ ОБЯЗАТЕЛЕН! 0-НЕОГРАНИЧЕНО
	// АдоИД - Код коннекшона. Ибо когда он сдохнет вместе с WiFi-em по распухшему трупу невозможно
	//         определить кто это был из двух. 1- инвентаризация, 2- центральная база
	// Если Способ=0 тогда получим на выходе рекорд сет 1- ничего
	//-------------------------------------------------------------------------- GtG ---
	
	
	
	//Если Константа.ВестиЛогSQLЗапросов=1 тогда
	//	ИФЛФ=КаталогИБ()+"SQL_QUERY_LOG.txt";
	//	ЛогФайл=СоздатьОбъект("Текст");
	//	Если ФС.СуществуетФайл(ИФЛФ)=1 тогда
	//		// !ДА файл есть  
	//		ЛогФайл.Открыть(ИФЛФ);
	//	Иначе
	//		// НЕТ файла
	//	КонецЕсли;
	//	ЛогФайл.ДобавитьСтроку("-------------------------- "+ТекущееВремя()+" --- "+ТекущаяДата()+" --------");
	//	ЛогФайл.ДобавитьСтроку(ТекстЗапроса); 
	//	ЛогФайл.Записать(ИФЛФ);
	//КонецЕсли; 	
	
	
	//  Could not send query to backend -- Отвалилась связь
	//  Could not send Query(connection dead) -- при попытке повторно отправить запрос к дохлому коннекшуну
	
	
	Адо_РекордСет=Новый COMОбъект("ADODB.recordset");
	 
	
	// Запросы обычно не приходят одни, они приводят с собой друзей!
	// поэтому потеря одного может капитально подосрать всей компании
	// ...значит будем долбить пока не пропихнем
	// .. Издержки WiFi...
	
	
	
	Если Способ=0 тогда
		// получим на выходе рекорд сет // для создания и апдейта таблиц и пр что рс не дает
		
		                                         
		Удачно=0;
		
		Пока Удачно =0 цикл 
			//=========[ Начали пропихивать запрос ]=========================GtG===
			Попытка 
				АДО_КОНН.CommandTimeout=ТАЙМАУТ; 
				Адо_РекордСет.Open(ТекстЗапроса,АДО_Конн,0,3);
				Удачно =1;
			Исключение
				//Сообщить(ОписаниеОшибки());
				Если (Найти(ОписаниеОшибки(),"Could not send query to backend")<>0) ИЛИ 
				(Найти(ОписаниеОшибки(),"Could not send Query(connection dead)")<>0) или 
				(Найти(ОписаниеОшибки(),"The connection cannot be used to perform this operation. It is either closed or invalid in this context")<>0)
				
				
				ТОгда
					//Если Константа.ЭтоУправляющаяКопия=0 тогда
					//	//СуперПиск(Перечисление.СистемныеСобытия.ОшибкаСвязиССервером,"");
					//	ПРедупреждение("WRN0001"+РазделительСтрок +ПредупреждениеWiFi_ОбрывСвязи); 
					//							  
					//КонецЕсли;
					
					//------< Коннекшон сдох  >--------------------------------------------------------GtG---
					// Надо его реинкарнировать , тут пригодится лопата для эксгумации марки "АдоИД"
					Удачно=0;
					Если АдоИД =1 ТОгда
						
						//если Константа.ЭтоУправляющаяКопия=1 тогда
						//	ОткрытьФормуМодально("Обработка.УправлениеСерверомPostgres","");
						//КонецЕсли;
						
						//ПодключитьИнвентаризацию_АДО(АДО_Конн);
						Сообщить("Реинкарнируем подключение к базе инвентаризации...");
					ИначеЕсли АдоИД=2 ТОгда //- центральная база
						//ПодключитьЦентральнуюБазу_АДО(АДО_Конн);
						Сообщить("Реинкарнируем подключение к центральной базе...");
					КонецЕсли;
				Иначе
					Возврат "";
				КонецЕсли; 	
			КонецПопытки; 
			
		КонецЦикла;
		
	ИначеЕсли Способ=1 тогда
		// ничего не получим
		Удачно=0;
		
		Пока Удачно =0 цикл 
			//=========[ Начали пропихивать запрос ]=========================GtG===
			Попытка  
				АДО_КОНН.CommandTimeout=ТАЙМАУТ; 
				АДО_КОНН.Execute(ТекстЗапроса);
				Удачно=1;
			Исключение  
				
				Если Найти(ВРег(ОписаниеОшибки()),Врег("Cannot drop the table"))<>0 Тогда
					Возврат "";
				КонецЕсли; 	
				
				
				Если (Найти( ВРег(ТекстЗапроса),ВРег("Drop"))=0) ИЛи
				(Найти( ВРег(ТекстЗапроса),ВРег("Create"))=0)
				тогда
					// все дропы нах - это временные таблицы
					Сообщить(ОписаниеОшибки());
					Сообщить("----------------------------------------------------------------");
					Сообщить(ТекстЗапроса);
					Сообщить("----------------------------------------------------------------");
				Иначе
					// Дроп НЕ временной таблицы
					//Если Найти(ТекстЗапроса,"#")=0 тогда
						  Сообщить(ОписаниеОшибки());
						  Возврат " Error";
					//КонецЕсли; 	  
				КонецЕсли; 
				//------< Обрыв связи  >--------------------------------------------------------GtG---
				Если (Найти(ОписаниеОшибки(),"Could not send query to backend")<>0) ИЛИ 
				(Найти(ОписаниеОшибки(),"Could not send Query(connection dead)")<>0) или 
				(Найти(ОписаниеОшибки(),"The connection cannot be used to perform this operation. It is either closed or invalid in this context")<>0)
				
				
				ТОгда
					//Сигнал();
					//////едупреждение("WRN0002"+РазделительСтрок +ПредупреждениеWiFi_ОбрывСвязи); 
					//Сигнал(); 
					
					//------< Коннекшон сдох  >--------------------------------------------------------GtG---
					// Надо его реинкарнировать , тут пригодится "Электрическая 
					// самоходная лопата для эксгумации марки "АдоИД"
					Удачно=0;
					Если АдоИД =1 ТОгда
						//ПодключитьИнвентаризацию_АДО(АДО_Конн);
						Сообщить("Реинкарнируем подключение к базе инвентаризации...");
					ИначеЕсли АдоИД=2 ТОгда //- центральная база
						//ПодключитьЦентральнуюБазу_АДО(АДО_Конн);
						Сообщить("Реинкарнируем подключение к центральной базе...");
					КонецЕсли; 	
					
				Иначе
					ВОЗВРАТ "";
					
				КонецЕсли; 	
				
				
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли; 	
	
//	глПРоверкаСостоянияАДО(АДО_Конн,"Инвентаризация");
	
	Возврат Адо_РекордСет; 
КонецФункции // ----< ВыполнитьSQLЗапрос >---- by  GtG ----
//===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***===***//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#IF SERVER THEN
	Функция ОМ8_ВыполнитьПостроительНаСервере(ПостроительЗапросаПарам) Экспорт
		Попытка
			ПостроительЗапросаПарам.Выполнить();
			Возврат ПостроительЗапросаПарам.Результат;
		Исключение
			Возврат "Ошибка выполнения построителя на сервере!";
		КонецПопытки; 
	КонецФункции
#ENDIF


