//===============================================================================
//               Соединение с FTP
//===============================================================================
Функция ОМ19_Соединиться_С_FTP(Поставщик)
	
	FTP = Неопределено;
	
	Сервер = СокрЛП(Поставщик.FTPАдрес);
	Порт = Поставщик.FTPПорт;
	Логин = СокрЛП(Поставщик.FTPИмяПользователя);
	Пароль = СокрЛП(Поставщик.FTPПароль);
	
	Попытка
		FTP = Новый FTPСоединение(Сервер, Порт, Логин, Пароль , , Истина,5);
	Исключение
	КонецПопытки;
	
	Возврат FTP;
	
КонецФункции

//===============================================================================
//               Загрузка файлов с FTP
//===============================================================================
Функция ОМ19_ЗагрузитьФайлы_С_FTP(Поставщик,КаталогИсточника,КаталогПриемника)  Экспорт
	
	FTP = ОМ19_Соединиться_С_FTP(Поставщик);
	
	Если FTP = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивФайлов = FTP.НайтиФайлы(КаталогИсточника,"*.*"); 
	
	Для Каждого Файл Из МассивФайлов Цикл 
		Если Файл.ЭтоФайл() Тогда 
			Попытка
				FTP.Получить(Файл.ПолноеИмя, КаталогПриемника+ "" + Файл.Имя); 
				FTP.Удалить(Файл.Путь,Файл.Имя);
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла;
	
	FTP = Неопределено;	
	Возврат Истина;
	
	
КонецФункции


//===============================================================================
//               Выгрузка файла на FTP
//===============================================================================
Функция ОМ19_ВыгрузитьОдинФайл_На_FTP(Поставщик,ПолноеИмяФайла,КаталогПриемника) Экспорт
	
	FTP = ОМ19_Соединиться_С_FTP(Поставщик);
	
	Если FTP = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
		
	ТекФайл = Новый Файл(ПолноеИмяФайла);
	//Загоняем файлик на FTP
	Попытка
		FTP.Записать(ТекФайл.ПолноеИмя,КаталогПриемника + ТекФайл.Имя);
	Исключение
		FTP = Неопределено;
		Возврат Ложь;
	КонецПопытки;
	//Удаляем файл из папки заказа
	УдалитьФайлы(ТекФайл.ПолноеИмя);
	//Закрываем соединение с FTP
	FTP = Неопределено;
	
	Возврат Истина;
	
	
КонецФункции
//===============================================================================