
Функция КорректировкаСпецСимволов(Значение)
	
	//Возврат Значение;
	
   Результат = СтрЗаменить(Значение, "&", "&amp;");
   Результат = СтрЗаменить(Результат, "<", "&lt;");
   Результат = СтрЗаменить(Результат, ">", "&gt;");
   Результат = СтрЗаменить(Результат, """", "&quot;");
   Результат = СтрЗаменить(Результат, "'", "&apos;");
   Результат = СтрЗаменить(Результат, "/", "&#x2F;");	
   Возврат Результат;
   
КонецФункции

Процедура ЗаписатьЭлементXML(ЗаписьXML, Имя, Значение) 
	
	//ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	//ЗаписьXML.ЗаписатьТекст(Значение);
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	Если Значение = "" Тогда
		ЗаписьXML.ДобавитьСтроку("<" + Имя + "/>");
	Иначе
		ЗаписьXML.ДобавитьСтроку("<" + Имя + ">" + Значение + "</" + Имя + ">");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНачалоЭлемента(ЗаписьXML,Имя)
	
	ЗаписьXML.ДобавитьСтроку("<" + Имя + ">");
	
КонецПроцедуры

Процедура ЗаписатьКонецЭлемента(ЗаписьXML,Имя)
	
	ЗаписьXML.ДобавитьСтроку("</" + Имя + ">");
	
КонецПроцедуры

Процедура ВыгрузитьПоСубъектам()
	
	Выборка = Справочники.ОпросникОтветы.Выбрать(,Ссылка);
	
	ЗаписьXML = Новый ТекстовыйДокумент;
	
	
	ЗаписьXML.ДобавитьСтроку("<?xml version=""1.0"" encoding=""WINDOWS-1251""?>");

	ЗаписьXML.ДобавитьСтроку("<document>"); 

	
	ЗаписатьЭлементXML(ЗаписьXML, "pack_type", "CUSTOMER_SURVEY"); 
	ЗаписатьЭлементXML(ЗаписьXML, "fmt_ver", "1"); 
	ЗаписьXML.ДобавитьСтроку("<hdr>");
		ЗаписатьЭлементXML(ЗаписьXML, "id",	Формат(Код,"ЧГ=0; ЧН=0") );				
		ЗаписатьЭлементXML(ЗаписьXML, "is_active", Число(Активный)); 
		ЗаписатьЭлементXML(ЗаписьXML, "question_txt",	КорректировкаСпецСимволов(СокрЛП(Вопрос)));
	ЗаписьXML.ДобавитьСтроку("</hdr>");
	
	
	ЗаписьXML.ДобавитьСтроку("<str>");
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Активный и ЗначениеЗаполнено(Выборка.Наименование) Тогда
			ЗаписьXML.ДобавитьСтроку("<row>");
				ЗаписатьЭлементXML(ЗаписьXML, "id",	Формат(Выборка.Код,"ЧГ=0; ЧН=0") );				
				ЗаписатьЭлементXML(ЗаписьXML, "answer_txt",		КорректировкаСпецСимволов(СокрЛП(Выборка.Наименование)));
			ЗаписьXML.ДобавитьСтроку("</row>");
		КонецЕсли;
	КонецЦикла;
	ЗаписьXML.ДобавитьСтроку("</str>"); 
	
	ЗаписьXML.ДобавитьСтроку("<subject_rf>");
	Для каждого стр из Субъекты Цикл
		Если ЗначениеЗаполнено(стр.Субъект) Тогда
			ЗаписьXML.ДобавитьСтроку("<row>");
				ЗаписатьЭлементXML(ЗаписьXML, "id",	Формат(стр.Субъект.Код,"ЧГ=0; ЧН=0") );	
			ЗаписьXML.ДобавитьСтроку("</row>");
		КонецЕсли;
	КонецЦикла;
	ЗаписьXML.ДобавитьСтроку("</subject_rf>");
	
	ЗаписьXML.ДобавитьСтроку("<brand_pharm_network>");
	Для каждого стр из Бренды Цикл
		Если ЗначениеЗаполнено(стр.Бренд) Тогда
			ЗаписьXML.ДобавитьСтроку("<row>");
				ЗаписатьЭлементXML(ЗаписьXML, "id",	Формат(стр.Бренд.Код,"ЧГ=0; ЧН=0") );
			ЗаписьXML.ДобавитьСтроку("</row>");
		КонецЕсли;
	КонецЦикла;
	ЗаписьXML.ДобавитьСтроку("</brand_pharm_network>");	
	
	
	ЗаписьXML.ДобавитьСтроку("</document>"); 
	
	ВесьТекст = ЗаписьXML.ПолучитьТекст();
	ЗаписьXML.Очистить();
	ЗаписьXML = Неопределено;
	
	
	КодСчетчика = ОМ_ТСО.ПолучитьКодСчетчика("ОбменАптекаОфисШВ");
	Если КодСчетчика = -1 Тогда
		КодСчетчика = ОМ_ТСО.ПолучитьКодСчетчика("ОбменАптекаОфисШВ");
		Если КодСчетчика = -1 Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ОфисАптекаШироковещание.СоздатьМенеджерЗаписи();
	МЗ.Код = КодСчетчика;
	МЗ.ТипУпаковки = "CUSTOMER_SURVEY";
	МЗ.Приоритет = 1;
	МЗ.ВерсияФормата = 1;
	МЗ.ИмяФайла = "customer_survey_" + Формат(Код,"ЧГ=0") + "_" + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") +".xml";
	МЗ.ИдентификаторКодировки = 1;
	МЗ.ХМЛСтрока = ВесьТекст;
	МЗ.Записать();	
	
	
КонецПроцедуры


Процедура ВыгрузитьПоАптекам(МассивАптек, АктивностьДокумента)
	
	Если МассивАптек.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МХ.СубъектРФ.Код КАК СубъектРФКод
	               |ИЗ
	               |	Справочник.МестаХранения КАК МХ
	               |ГДЕ
	               |	МХ.Ссылка В(&Аптеки)
	               |	И НЕ МХ.СубъектРФ.Код ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МХ.Бренд.Код КАК БрендКод
	               |ИЗ
	               |	Справочник.МестаХранения КАК МХ
	               |ГДЕ
	               |	МХ.Ссылка В(&Аптеки)
	               |	И НЕ МХ.Бренд.Код ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МХ.Код КАК АптекаКод
	               |ИЗ
	               |	Справочник.МестаХранения КАК МХ
	               |ГДЕ
	               |	МХ.Ссылка В(&Аптеки)";
	
	Запрос.УстановитьПараметр("Аптеки", МассивАптек);
	Рез = Запрос.ВыполнитьПакет();
	ТЗСубъекты	= Рез[0].Выгрузить();
	ТЗБренды	= Рез[1].Выгрузить();
	ТЗКодыАптек	= Рез[2].Выгрузить();
	
	
	Выборка = Справочники.ОпросникОтветы.Выбрать(,Ссылка);
	
	ЗаписьXML = Новый ТекстовыйДокумент;
	
	
	ЗаписьXML.ДобавитьСтроку("<?xml version=""1.0"" encoding=""WINDOWS-1251""?>");

	ЗаписьXML.ДобавитьСтроку("<document>"); 

	
	ЗаписатьЭлементXML(ЗаписьXML, "pack_type", "CUSTOMER_SURVEY"); 
	ЗаписатьЭлементXML(ЗаписьXML, "fmt_ver", "1"); 
	ЗаписьXML.ДобавитьСтроку("<hdr>");
		ЗаписатьЭлементXML(ЗаписьXML, "id",	Формат(Код,"ЧГ=0; ЧН=0") );				
		ЗаписатьЭлементXML(ЗаписьXML, "is_active", Число(АктивностьДокумента)); 
		ЗаписатьЭлементXML(ЗаписьXML, "question_txt",	КорректировкаСпецСимволов(СокрЛП(Вопрос)));
	ЗаписьXML.ДобавитьСтроку("</hdr>");
	
	
	ЗаписьXML.ДобавитьСтроку("<str>");
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Активный и ЗначениеЗаполнено(Выборка.Наименование) Тогда
			ЗаписьXML.ДобавитьСтроку("<row>");
				ЗаписатьЭлементXML(ЗаписьXML, "id",	Формат(Выборка.Код,"ЧГ=0; ЧН=0") );				
				ЗаписатьЭлементXML(ЗаписьXML, "answer_txt",		КорректировкаСпецСимволов(СокрЛП(Выборка.Наименование)));
			ЗаписьXML.ДобавитьСтроку("</row>");
		КонецЕсли;
	КонецЦикла;
	ЗаписьXML.ДобавитьСтроку("</str>"); 
	
	ЗаписьXML.ДобавитьСтроку("<subject_rf>");
	Для каждого стр из ТЗСубъекты Цикл
			ЗаписьXML.ДобавитьСтроку("<row>");
				ЗаписатьЭлементXML(ЗаписьXML, "id",	Формат(стр.СубъектРФКод,"ЧГ=0; ЧН=0") );	
			ЗаписьXML.ДобавитьСтроку("</row>");
	КонецЦикла;
	ЗаписьXML.ДобавитьСтроку("</subject_rf>");
	
	ЗаписьXML.ДобавитьСтроку("<brand_pharm_network>");
	Для каждого стр из ТЗБренды Цикл
			ЗаписьXML.ДобавитьСтроку("<row>");
				ЗаписатьЭлементXML(ЗаписьXML, "id",	Формат(стр.БрендКод,"ЧГ=0; ЧН=0") );
			ЗаписьXML.ДобавитьСтроку("</row>");
	КонецЦикла;
	ЗаписьXML.ДобавитьСтроку("</brand_pharm_network>");	
	
	
	ЗаписьXML.ДобавитьСтроку("</document>"); 
	
	ВесьТекст = ЗаписьXML.ПолучитьТекст();
	ЗаписьXML.Очистить();
	ЗаписьXML = Неопределено;
	
	
	Для каждого стр из ТЗКодыАптек Цикл
		
		
		МЗ = РегистрыСведений.ОфисАптекаЦелевые.СоздатьМенеджерЗаписи();
		МЗ.Код = 1;
		МЗ.КодАптеки = стр.АптекаКод;
		МЗ.ТипУпаковки = "CUSTOMER_SURVEY";
		МЗ.Приоритет = 1;
		МЗ.ВерсияФормата = 1;
		МЗ.ИмяФайла = "customer_survey_" + Формат(Код,"ЧГ=0") + "_" + Формат(стр.АптекаКод,"ЧГ=0") + "_" + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") +".xml";
		МЗ.ИдентификаторКодировки = 1;
		МЗ.ХМЛСтрока = ВесьТекст;
		МЗ.Записать();		
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьАптекиДляДеактивацииДокумента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОА.Аптека КАК Аптека
	               |ИЗ
	               |	Справочник.ОпросникАптек.Аптеки КАК ОА
	               |ГДЕ
	               |	ОА.Ссылка = &Ссылка
	               |	И НЕ ОА.Аптека в (&Аптеки)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Аптеки", Аптеки.Выгрузить(,"Аптека").ВыгрузитьКолонку("Аптека"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Аптека");
		
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Вопрос) Тогда
		#Если Клиент Тогда
			Предупреждение("Не задан вопрос. Выполнение не может быть продолжено");
		#КонецЕсли
		Отказ = Истина;
	Иначе
		Если НЕ ЭтоНовый() и Аптеки.Количество() > 0 Тогда
			МассивАптек = ПолучитьАптекиДляДеактивацииДокумента();
			ВыгрузитьПоАптекам(МассивАптек,Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если Аптеки.Количество() = 0 Тогда
		ВыгрузитьПоСубъектам();
	Иначе
		
		МассивАптек = Аптеки.Выгрузить(,"Аптека").ВыгрузитьКолонку("Аптека");
		ВыгрузитьПоАптекам(МассивАптек,Активный);
		
	КонецЕсли;
	
КонецПроцедуры
