

#Если Сервер ТОгда
Функция ПолучитьПрямоеПодключение() 
	ODBC=Новый COMОбъект("ADODB.Connection"); 
	
	ConnectionString="DSN=AVE_SKDx64";
	Try
		ODBC.Open(ConnectionString);
	Except
		ODBC=Неопределено;
	КонецПопытки;

	Возврат	ODBC;
КонецФункции	
#КонецЕсли

#Если Сервер ТОгда
Функция ПолучитьСоответствиеПодмены() 
	 СоответствиеПодмены=Новый Соответствие;
	
	СоответствиеПодмены.Вставить("А","[АЯО]{1,2}");
	СоответствиеПодмены.Вставить("Б","[БП]");
	СоответствиеПодмены.Вставить("В","[ВФ]");
	СоответствиеПодмены.Вставить("Г","[ГК]");
	СоответствиеПодмены.Вставить("Д","[ДТ]");
	СоответствиеПодмены.Вставить("Е","[ЕЭЁИОЯА]");
	СоответствиеПодмены.Вставить("Ё","[ЁЕЭИО]");
	СоответствиеПодмены.Вставить("Ж","[ЖШЩ]");
	СоответствиеПодмены.Вставить("З","[ЗС]");
	СоответствиеПодмены.Вставить("И","[ИЕЫЭ]");
	СоответствиеПодмены.Вставить("Й","[ЙИЫ]");
	СоответствиеПодмены.Вставить("К","[КГ]{1,2}");
	СоответствиеПодмены.Вставить("Л","Л{1,2}");
	СоответствиеПодмены.Вставить("М","[МН]{1,2}");
	СоответствиеПодмены.Вставить("Н","[НМ]{1,2}");
	СоответствиеПодмены.Вставить("О","[ОАЁЕУ]{1,2}");
	СоответствиеПодмены.Вставить("П","[ПБ]{1,2}");
	СоответствиеПодмены.Вставить("Р","Р{1,2}");
	СоответствиеПодмены.Вставить("С","[СЗ]{1,2}");
	СоответствиеПодмены.Вставить("Т","[ТД]{1,2}");
	СоответствиеПодмены.Вставить("У","[УЮО]");
	СоответствиеПодмены.Вставить("Ф","[ФВ]{1,2}");
	СоответствиеПодмены.Вставить("Х","[ХГ]");
	СоответствиеПодмены.Вставить("Ц","[ЦСЗ]");
	СоответствиеПодмены.Вставить("Ч","[ЧЩ]");
	СоответствиеПодмены.Вставить("Ш","[ШЩЖ]");
	СоответствиеПодмены.Вставить("Щ","[ШЩЖ]");
	СоответствиеПодмены.Вставить("Ъ","[ЪЬ]");
	СоответствиеПодмены.Вставить("Ы","[ЫИЕ]");
	СоответствиеПодмены.Вставить("Ь","[ЬЪ]");
	СоответствиеПодмены.Вставить("Э","[ЭЕИ]");
	СоответствиеПодмены.Вставить("Ю","[ЮУО]");
	СоответствиеПодмены.Вставить("Я","[ЯАИЕ]");
	
	Возврат СоответствиеПодмены;
	
КонецФункции	
#КонецЕсли

#Если Сервер ТОгда
Функция ПреобразоватьСтрокуПоиска(ТекстПоиска) 
	//ТекстПоиска="хетрапирид";
	
	СоответствиеПодмены=ПолучитьСоответствиеПодмены();
	
	ТекстПоиска=Врег(ТекстПоиска);
	
	СтрокаПоиска="";
	
	Для Ы=1 По СтрДлина(ТекстПоиска) Цикл
		СтрокаПоиска=СтрокаПоиска+СоответствиеПодмены.Получить(Сред(ТекстПоиска,Ы,1));
	КонецЦикла;	
	
	СтрокаПоиска=""+СтрокаПоиска+"%";
		
	Возврат СтрокаПоиска;
	
КонецФункции	
#КонецЕсли

#Если Сервер ТОгда
Функция ПолучитьУсловиеОтбораПоНечеткомуСоответствию(ТекстПоиска,неСНачала=Ложь) Экспорт 
		
		ODBC=ПолучитьПрямоеПодключение();
		
		Если ODBC=Неопределено ТОгда
			//	Состояние("Поиск по вхождению стандартный");
			Если Найти (ТекстПоиска,"%")=0 и пустаяСтрока(ТекстПоиска)=Ложь тогда
				ТекстПоиска="%"+СокрЛП(ТекстПоиска)+"%";
			КонецЕсли;
			
			Возврат неопределено;
		КонецЕсли;
		

	
	
	СтрокаПоиска=ПреобразоватьСтрокуПоиска(ТекстПоиска);
	
	СтрокаПоиска=СтрЗаменить(СтрокаПоиска," ","");
	СтрокаПоиска=СтрЗаменить(СтрокаПоиска,"-","");
	
	
	Если неСНачала=Ложь
		Тогда
		СтрокаПоиска="%"+СтрокаПоиска;
	КонецЕсли;	
	
	
	ТХТ = "select 
			|	_code,
			|	_description 
			|from _reference2 
			|where 
			|	replace(
			|		replace(
			|			cast(
			|				upper(_description)
			|				as text)
			|			,'-','')
			|		,' ','') 
			|	SIMILAR TO '"+СтрокаПоиска+"' order by _description";
	
	RecordSet = ОМ_ТП.ВыполнитьЗапросНаВнешнемИсточнике(ODBC,ТХТ);
	Если RecordSet = Неопределено Тогда
		Возврат СтрокаПоиска;
	КонецЕсли;
	
	
	УсловиеПоискаТоваров="АССОРТИМЕНТНЫЙ_ПЛАН.Код в (";
	
	Если RecordSet.RecordCount()<>0 ТОгда
		
		RecordSet.MoveFirst();
		
		Пока RecordSet.EOF()=0 Цикл
			
			УсловиеПоискаТоваров=УсловиеПоискаТоваров+Формат(Число(RecordSet.Fields(0).VAlue),"ЧГ=0")+",";
			
			RecordSet.MoveNext();
		КонецЦикла;	
		
		УсловиеПоискаТоваров=Лев(УсловиеПоискаТоваров,СтрДлина(УсловиеПоискаТоваров)-1);
		УсловиеПоискаТоваров=УсловиеПоискаТоваров+")";
	Иначе
		RecordSet.Close();
		ODBC.Close();
		RecordSet = Неопределено;
		ODBC = Неопределено;
		Возврат Неопределено;
	КонецЕсли;
	
	RecordSet.Close();
	ODBC.Close();
	RecordSet = Неопределено;
	ODBC = Неопределено;
	Возврат УсловиеПоискаТоваров;
	
КонецФункции   
#КонецЕсли


	
	