
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движение = Движения.ПартииЖНВЛС.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Склад = Склад;
	Движение.СтавкаНДС = СтавкаНДС;
	Движение.Фирма = Склад.Фирма;
	Движение.Партия = Партия;
	Движение.Колво = КолвоДельта;
	Движение.СуммаЗакупСНДС = СуммаЗакупДельта;
	Движение.СуммаНДСЗакуп=СуммаЗакупНДСДельта;
	Движение.СуммаРознСНДС=СуммаРознДельта;
	Движение.СуммаРознНДС=СуммаРознНДСДельта;
	
	Движения.ПартииЖНВЛС.Записать();
	
	если КорректироватьРегистрПоСтавкамНДС=Истина тогда
		Движение = Движения.ОстаткиПоСтНДСПоСкладам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.СтавкаНДС = СтавкаНДС;
		Движение.Фирма = Склад.Фирма;
		Движение.СуммаЗакупСНДС = СуммаЗакупДельтаНДС;
		Движение.СуммаНДСЗакуп=СуммаЗакупНДСДельтаНДС;
		Движение.СуммаРознСНДС=СуммаРознДельтаНДС;
		Движение.СуммаРознНДС=СуммаРознНДСДельтаНДС;
		
		Движения.ПартииЖНВЛС.Записать();
		
	КонецЕсли; 
	
	
	
	
	
	
	
КонецПроцедуры
