
Процедура ПередЗаписью(Отказ)
	
			ТХТ="ВЫБРАТЬ
			    |	Базы.Ссылка
			    |ИЗ
			    |	Справочник.ВнешниеБазыДанных КАК Базы
			    |ГДЕ
			    |	Базы.ИмяБазы = &ИмяБазы
			    |	И Базы.Ссылка <> &Ссылка";
		
		Запрос=Новый Запрос;
		Запрос.Текст=ТХТ;
		Запрос.УстановитьПараметр("ИмяБазы",ИмяБазы);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		
		Если  ТЗ.Количество()>0  Тогда  
			#Если   Клиент Тогда
			Предупреждение("Уже существует запись в справочнике с такой базой!",5);
			#Конецесли 
			Отказ=Истина;
		КонецЕсли; 

	
	
КонецПроцедуры
