
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ФиктивныеОстаткиТовара Расход
	Движения.ФиктивныеОстаткиТовара.Записывать = Истина;
	Движения.ФиктивныеОстаткиТовара.Очистить();
	
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ФиктивныеОстаткиТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период			= Дата;
		Движение.КодСклада		= Склад.Код;
		Движение.КодТовара		= ТекСтрокаТовар.КодТовара;
		Движение.Количество		= ТекСтрокаТовар.Количество;
		Движение.СуммаЗакуп		= ТекСтрокаТовар.СуммаЗакуп;
		Движение.СуммаРозн		= ТекСтрокаТовар.СуммаРозн;
		Движение.СуммаНДСЗакуп	= ТекСтрокаТовар.СуммаНДСЗакуп;
		Движение.СуммаНДСРозн	= ТекСтрокаТовар.СуммаНДСРозн;		
		Движение.ДокументРеализации	= ТекСтрокаТовар.ДокументРеализации;
		Движение.НомерККМ		= ТекСтрокаТовар.НомерККМ;
		Движение.НомерСмены		= ТекСтрокаТовар.НомерСмены;
		Движение.БаркодТовара	= ТекСтрокаТовар.БаркодТовара;
		
	КонецЦикла;

КонецПроцедуры
