
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если Статус = Перечисления.СтатусыЗапросовАннулированияЭД.Черновик Тогда		
			Статус = Перечисления.СтатусыЗапросовАннулированияЭД.ОжидаетОтправки;
		КонецЕсли;
		
		Если Действие = Перечисления.ДействияНадЭлектроннымиДокументами.Отклонить 
			И Не ЗначениеЗаполнено(ОписаниеПричиныОтклоненияАннулирования) Тогда
			
			Сообщить("Поле ""Описание причины отклонения аннулирования"" не заполнено");			
			Отказ = Истина;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры
