Процедура ПроверитьНаЗаполнение(Отказ)

	ДатаНачалаКонтракта = МаркетинговыйКонтракт.НачалоДействия;
	ДатаОкончанияКонтракта = МаркетинговыйКонтракт.ОкончаниеДействия;
	Если НачалоДействия < ДатаНачалаКонтракта или НачалоДействия > ДатаОкончанияКонтракта Тогда
	
		#Если Клиент Тогда
		Сообщить ("Дата начала действия статьи выходит за рамки действия контракта: с "+Формат(ДатаНачалаКонтракта,"ДФ=dd.MM.yyyy")+ " по "+
					Формат(ДатаОкончанияКонтракта,"ДФ=dd.MM.yyyy"));	
		#КонецЕсли	
	    Отказ = Истина;
		
	КонецЕсли;
	
	Если ОкончаниеДействия < ДатаНачалаКонтракта или ОкончаниеДействия > ДатаОкончанияКонтракта Тогда
	
		#Если Клиент Тогда
		Сообщить ("Дата окончания действия статьи выходит за рамки действия контракта: с "+Формат(ДатаНачалаКонтракта,"ДФ=dd.MM.yyyy")+ " по "+
					Формат(ДатаОкончанияКонтракта,"ДФ=dd.MM.yyyy"));	
		#КонецЕсли	
	    Отказ = Истина;
	
	КонецЕсли;
	
	Если НачалоДействия > ОкончаниеДействия Тогда
	
		#Если Клиент Тогда
		Сообщить("Дата начала действия статьи превышает дату окончания дейятвия!");
		#КонецЕсли	
	    Отказ = Истина;
	
	КонецЕсли; 
	
	Если Товары.Количество() > 0 и ПланПоСтатье <> Товары.Итог("РазбивкаПоПериодам") Тогда
		
		#Если Клиент Тогда
			Если Вопрос("Сумма плана в ТЧ ""Товары"" не соответствует сумме плана по статье документа. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена) <> КодВозвратаДиалога.Да Тогда
			
				Отказ = Истина;	
			
			КонецЕсли; 
	    #КонецЕсли
	КонецЕсли; 
	
	Если Периоды.Количество() > 0 И ПланПоСтатье <> Периоды.Итог("ПланНаПериод") Тогда
		
		#Если Клиент Тогда
			Если Вопрос("Сумма плана в ТЧ ""Периоды"" не соответствует сумме плана по статье документа. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена) <> КодВозвратаДиалога.Да Тогда
			
				Отказ = Истина;	
			
			КонецЕсли; 
	    #КонецЕсли
	КонецЕсли;
	
	Если (ТипСтатьи = Перечисления.ТипСтатьиКонтрактов.Суперпромо И ВРамкахБюджета) Тогда
	
		// В этом случае проверка на согласование и утверждение в МЛК не требуется
		
	Иначе
		
		Если Утвержден Тогда
		
			Если МаркетинговыйКонтракт.Утвержден Тогда
			
				#Если Клиент Тогда
				Сообщить ("Документ контракт: "+МаркетинговыйКонтракт + ?(МаркетинговыйКонтракт.Утвержден, " утвержден"," согласован"));	
				#КонецЕсли	
			    Отказ = Истина;
			
			Иначе
			
				//  проводим
			
			КонецЕсли; 
		
		Иначе
		
			Если МаркетинговыйКонтракт.Согласован Тогда
				
				#Если Клиент Тогда
				Сообщить ("Документ контракт: "+МаркетинговыйКонтракт + " согласован");	
				#КонецЕсли	
			    Отказ = Истина;
			
			КонецЕсли; 
			
		КонецЕсли;
		
		//Если МаркетинговыйКонтракт.Согласован или МаркетинговыйКонтракт.Утвержден Тогда
		//	
		//	#Если Клиент Тогда
		//	Сообщить ("Документ контракт: "+МаркетинговыйКонтракт + ?(МаркетинговыйКонтракт.Утвержден, " утвержден"," согласован"));	
		//	#КонецЕсли	
		//    Отказ = Истина;
		//
		//КонецЕсли; 
	
	КонецЕсли; 
	
	Если Исполнен Тогда
	
		Если НЕ ЗначениеЗаполнено(АктНомер) Тогда
		
		#Если Клиент Тогда
		Сообщить ("Укажите номер акта исполнения!");	
		#КонецЕсли	
	    Отказ = Истина;
		
		КонецЕсли; 	
		
		Если НЕ ЗначениеЗаполнено(АктДата) Тогда
		
		#Если Клиент Тогда
		Сообщить ("Укажите дату акта исполнения!");	
		#КонецЕсли	
	    Отказ = Истина;
		
		КонецЕсли; 	
	
	КонецЕсли; 

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения)

	Если ДанныеЗаполнения <> Неопределено Тогда
	
		МаркетинговыйКонтракт	= ДанныеЗаполнения;
		НачалоДействия			= ДанныеЗаполнения.НачалоДействия;	
		ОкончаниеДействия		= ДанныеЗаполнения.ОкончаниеДействия;		
	
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		
		Изменение = Изменения.Добавить();
		Изменение.Дата = ТекущаяДата();
		Изменение.КомментарийИзменения = "Создан новый документ";
		Изменение.Сотрудник = ПараметрыСеанса.ТекущийСотр;
		Изменение.ТипИзм = Перечисления.ДействияНадДокументами.ВводНового;
		
	КонецЕсли;
	
	ЗаписатьДействияВИсториюДокумента(Изменения,РежимЗаписи,ПометкаУдаления);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
		ПроверитьНаЗаполнение(Отказ);
		Если Отказ Тогда
			Возврат
		КонецЕсли; 
	
	Иначе
	
		
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Согласован	= Ложь;
	Утвержден	= Ложь;
	Изменения.Очистить();
	
КонецПроцедуры
