Функция ПередатьНаКомиссию() Экспорт
	
	Если ДокОснование.Пустая() или ФирмаКомиссионер.Пустая() или СкладКомиссионер.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	ФирмаКомитент = ДокОснование.Склад.Фирма;
	
	ДокПередачи = Документы.ПередачаНаКомиссию.СоздатьДокумент();
	ДокПередачи.Дата = ТекущаяДата();
	ДокПередачи.ДокОснование = ДокОснование;
	ДокПередачи.ВхДатаНакл = ДокОснование.ВхДатаНакл;
	ДокПередачи.ВхДатаСФ = ДокОснование.ВхДатаСФ;
	ДокПередачи.ВхНомерНакл = ДокОснование.ВхНомерНакл;
	ДокПередачи.ВхНомерСФ = ДокОснование.ВхНомерНакл;
	ДокПередачи.Поставщик = ДокОснование.Поставщик;
	ДокПередачи.Склад = ДокОснование.Склад;
	ДокПередачи.СкладКомиссионер = СкладКомиссионер;
	ДокПередачи.Фирма = ФирмаКомитент;
	ДокПередачи.ФирмаКомиссионер = ФирмаКомиссионер;
	
	ТЧТовара = ДокОснование.Товар.Выгрузить(); 
	ДокПередачи.Товар.Загрузить(ТЧТовара);
	Удачно = Ложь;
	Для н = 0 по 5 Цикл 
		Попытка
			ДокПередачи.Записать(РежимЗаписиДокумента.Проведение);
			Удачно = Истина;
			Прервать;
		Исключение
			ОбщегоНазначения.Задержка(1);
			Сообщить(ОписаниеОшибки());
			н=н+1;
		КонецПопытки;
	КонецЦикла;
	Если Удачно = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	//Создаем окончательный документ прихода на аптеку комиссионер

	НомерДокументаПередачи = ДокПередачи.Номер;
	ДокПоступления = Документы.ПоступлениеТовара.СоздатьДокумент();
	ДокПоступления.Дата = ТекущаяДата();
	ДокПоступления.ДокОснование = ДокПередачи.Ссылка;
	ДокПоступления.ВхДатаНакл = ДокОснование.ВхДатаНакл;
	ДокПоступления.ВхДатаСФ = ДокОснование.ВхДатаСФ;
	ДокПоступления.ВхНомерНакл = ДокОснование.ВхНомерНакл + "-(" + НомерДокументаПередачи + ")";
	ДокПоступления.ВхНомерСФ = ДокОснование.ВхНомерНакл + "-(" + НомерДокументаПередачи + ")";	
	ДокПоступления.Фирма = ФирмаКомиссионер;
	ДокПоступления.Склад = СкладКомиссионер;
	ДокПоступления.ВидПоступленияТовара = Перечисления.ВидыПоступленияТоваров.Комиссия;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Поставщики.Ссылка
	|ИЗ
	|	Справочник.Поставщики КАК Поставщики
	|ГДЕ
	|	Поставщики.ИНН = &ИНН");
	Запрос.УстановитьПараметр("ИНН",ФирмаКомитент.ИНН);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() = Ложь Тогда
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		ДокПоступления.Поставщик = Выборка.Получить(0).Ссылка;
		ДокПоступления.ОтсрочкаПлатежа=ДокПоступления.Поставщик.ОтсрочкаПлатежа ;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ДокПоступления.ДоговорПоставки = ОМ_Справочники.ПолучитьДоговорПоставщикаБезДаты(ФирмаКомиссионер,ДокПоступления.Поставщик);
	Исключение
	КонецПопытки;
	
	
	ДокПоступления.Товар.Загрузить(ТЧТовара);
	
	Для каждого стр из ДокПоступления.Товар Цикл
		
		ПартияИсходная = стр.Партия;
		
		НоваяПартия=ПартияИсходная.Скопировать();
		НоваяПартия.УстановитьНовыйКод();
		НоваяПартия.ПартияРодитель=ПартияИсходная;
		ПартияЗаписана = Ложь;
		Для н = 0 по 3 Цикл 
			Попытка
             	НоваяПартия.Записать();
				ПартияЗаписана = Истина;
				Прервать;
			Исключение
				ОбщегоНазначения.Задержка(1);
			КонецПопытки;
		КонецЦикла;
		Если ПартияЗаписана = Ложь Тогда
			Возврат Ложь;
		КонецЕсли;
		стр.Партия = НоваяПартия.Ссылка;
	КонецЦикла;
	
	СтрИзм=ДокПоступления.Изменения.Добавить();
	СтрИзм.Сотрудник    = ПараметрыСеанса.ТекущийСотр;
	СтрИзм.Дата   = ТекущаяДата();
	СтрИзм.ТипИзм   = Перечисления.ДействияНадДокументами.Загрузка;
	СтрИзм.КомментарийИзменения = "Загружен из обработки: Передача на комиссию" ;	
	Удачно = Ложь;
	Для н = 0 по 5 Цикл 
		Попытка
			ДокПоступления.Записать(РежимЗаписиДокумента.Проведение);
			ДокПоступления.ВыгрузитьВАптеку();
			Удачно = Истина;
			Прервать;
		Исключение
			ОбщегоНазначения.Задержка(2);
			Сообщить(ОписаниеОшибки());
			н=н+1;
		КонецПопытки;
	КонецЦикла;
	Если Удачно = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции