
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ВидОперации = Перечисления.ВидыОпераций.РасходныйОрдер Тогда
		Движение = Движения.ОперационнаяКасса.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Сумма = Сумма;
		Движение.Счет = Счет;
	ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.ПриходныйОрдер Тогда
		Движение = Движения.ОперационнаяКасса.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Сумма = Сумма;
		Движение.Счет = Счет;
	ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.Инвентаризация Тогда
		Движение = Движения.ОперационнаяКасса.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Сумма = Сумма;
		Движение.Счет = Счет;
	КонецЕсли;
	
КонецПроцедуры
