
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ПередачаНаКомиссиюСтороннемуКомиссионеру.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПередачаНаКомиссиюСтороннемуКомиссионеру КАК ПередачаНаКомиссиюСтороннемуКомиссионеру
	             |ГДЕ
	             |	ПередачаНаКомиссиюСтороннемуКомиссионеру.ДокОснование = &ДокОснование
	             |	И ПередачаНаКомиссиюСтороннемуКомиссионеру.Ссылка <> &Ссылка
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Ссылка";
				 
	Запрос.УстановитьПараметр("ДокОснование",ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	
	Рез=Запрос.Выполнить();
	
	Если НЕ Рез.Пустой() тогда
		#Если клиент тогда
			Выб=Рез.Выбрать();
			Выб.Следующий();
			
			Предупреждение("По этому перемещению уже создан документ передачи на комиссию !
			|  "+Выб.Ссылка);
			
			СуществующийДок=Выб.Ссылка;
			СуществующийДок.ПолучитьФорму("ФормаДокумента").Открыть();
		#конецесли
		
		Возврат;		
	КонецЕсли;	
	
	
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТовара") Тогда
		// Заполнение шапки
		Дата=КонецДня(ДанныеЗаполнения.Дата);
		НомДокАптеки = ДанныеЗаполнения.НомДокАптеки;
		Склад = ДанныеЗаполнения.СкладПолучатель;
		ДокОснование = ДанныеЗаполнения.Ссылка;
		СуммаЗакупочная = ДанныеЗаполнения.СуммаДок;
		Фирма = ДанныеЗаполнения.Фирма;
		Для Каждого ТекСтрокаТовар Из ДанныеЗаполнения.Товар Цикл
			НоваяСтрока = Товар.Добавить();
			НоваяСтрока.Баркод = ТекСтрокаТовар.Баркод;
			НоваяСтрока.Коэфф = ТекСтрокаТовар.ЕИТ;
			НоваяСтрока.ЕИТ = ТекСтрокаТовар.ЕИТ;
			НоваяСтрока.Количество = ТекСтрокаТовар.Количество;
			НоваяСтрока.КоличествоФакт = ТекСтрокаТовар.КоличествоФакт;
			НоваяСтрока.НДСЗакуп = ТекСтрокаТовар.НДСЗакуп;
			НоваяСтрока.Партия = ТекСтрокаТовар.Партия;
			НоваяСтрока.Серия = ТекСтрокаТовар.Серия;
			НоваяСтрока.Сертификат = ТекСтрокаТовар.Сертификат;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовар.СтавкаНДС;
			НоваяСтрока.СуммаЗакуп = ТекСтрокаТовар.СуммаЗакуп;
			НоваяСтрока.Товар = ТекСтрокаТовар.Товар;
			НоваяСтрока.ЦенаЗакуп = ТекСтрокаТовар.ЦенаЗакуп;
			НоваяСтрока.ЦенаЗакупБезНДС = окр(ТекСтрокаТовар.ЦенаЗакуп/(100+НоваяСтрока.СтавкаНДС.Ставка)*100,2);
			//---------------<>---------------------------// GtG // 21.10.2014 16:10:18
			НоваяСтрока.Коэфф=НоваяСтрока.ЕИТ.К;
			НоваяСтрока.ЦенаГосРегистрации  =  НоваяСтрока.Партия.ЦенаГосРегистрации;
			НоваяСтрока.ЦенаПроизводителя   =  НоваяСтрока.Партия.ЦенаПроизводителяБезНДС;
			НоваяСтрока.НомерГТД = НоваяСтрока.Партия.НомерГТД;
			НоваяСтрока.Производитель = НоваяСтрока.Партия.Производитель;
			
			НоваяСтрока.СерияСтрока=НоваяСтрока.Партия.СерияСтрока;
			НоваяСтрока.СрокГодности=НоваяСтрока.Партия.СрокГодности;
			
		КонецЦикла;
		
		
		Изм=Изменения.Добавить();
		
		Изм.Дата=ТекущаяДата();
		Изм.КомментарийИзменения="Заполнен на основании "+ ДанныеЗаполнения;
		Изм.ТипИзм=Перечисления.ДействияНадДокументами.ВводНового;
		Изм.Сотрудник=ПараметрыСеанса.ТекущийСотр;
		
		
		
		
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Комиссионер.Пустая() ТОгда
		#Если Клиент Тогда
			Предупреждение("Не указан комиссионер! Не могу записать документ!");
		#КонецЕсли
		
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	
	
	Если ДоговорКомиссии.Пустая() ТОгда
		#Если Клиент Тогда
			Предупреждение("Не указан договор комиссии! Не могу записать документ!");
		#КонецЕсли
		
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	
	СуммаЗакупочная=Товар.Итог("СуммаЗакуп");
	СуммаПередачи=Товар.Итог("СуммаРозн");
	
	
	
	
	
	
	
	
	
КонецПроцедуры




Процедура ОбработкаПроведения_ТПнК(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ТоварПереданныйНаКомиссиюСК Приход
	Движения.ТоварПереданныйНаКомиссиюСК.Записывать = Истина;
	Движения.ТоварПереданныйНаКомиссиюСК.Очистить();
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ТоварПереданныйНаКомиссиюСК.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Фирма = Фирма;
		Движение.Комиссионер = Комиссионер;
		Движение.Товар = ТекСтрокаТовар.Товар;
		Движение.Партия = ТекСтрокаТовар.Партия;
		Движение.СтавкаНДС = ТекСтрокаТовар.СтавкаНДС;
		Движение.Колво = ТекСтрокаТовар.КоличествоФакт*ТекСтрокаТовар.Коэфф;
		Движение.СуммаЗакупСНДС = ТекСтрокаТовар.СуммаЗакуп;
		Движение.СуммаНДСЗакуп = ТекСтрокаТовар.НДСЗакуп;
		Движение.СуммаРознСНДС = ТекСтрокаТовар.СуммаРозн;
		Движение.СуммаНДСРозн = ТекСтрокаТовар.НДСРозн;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроведения_Партии(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПартииЖНВЛС Расход
	Движения.ПартииЖНВЛС.Записывать = Истина;
	Движения.ПартииЖНВЛС.Очистить();
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ПартииЖНВЛС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовар.Товар;
		Движение.Склад = Склад;
		Движение.Партия = ТекСтрокаТовар.Партия;
		Движение.СтавкаНДС = ТекСтрокаТовар.СтавкаНДС;
		Движение.Фирма = Фирма;
		Движение.Колво = ТекСтрокаТовар.КоличествоФакт*ТекСтрокаТовар.Коэфф;
		Движение.СуммаЗакупСНДС = ТекСтрокаТовар.СуммаЗакуп;
		Движение.СуммаНДСЗакуп = ТекСтрокаТовар.НДСЗакуп;
		Движение.СуммаРознСНДС = ТекСтрокаТовар.СуммаЗакуп;
		Движение.СуммаРознНДС = ТекСтрокаТовар.НДСЗакуп;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроведения_НДС(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиПоСтНДСПоСкладам Расход
	Движения.ОстаткиПоСтНДСПоСкладам.Записывать = Истина;
	Движения.ОстаткиПоСтНДСПоСкладам.Очистить();
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ОстаткиПоСтНДСПоСкладам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Фирма = Фирма;
		Движение.СтавкаНДС = ТекСтрокаТовар.СтавкаНДС;
		Движение.СуммаЗакупСНДС = ТекСтрокаТовар.СуммаЗакуп;
		Движение.СуммаНДСЗакуп = ТекСтрокаТовар.НДСЗакуп;
		Движение.СуммаРознСНДС = ТекСтрокаТовар.СуммаЗакуп;
		Движение.СуммаРознНДС = ТекСтрокаТовар.НДСЗакуп;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ОбработкаПроведения_ТПнК(Отказ, РежимПроведения);
	ОбработкаПроведения_Партии(Отказ, РежимПроведения);
	ОбработкаПроведения_НДС(Отказ, РежимПроведения);
	
КонецПроцедуры
