
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	// регистр Взаиморасчеты Приход
	Движение = Движения.Взаиморасчеты.Добавить();
	Если Сумма>=0 Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.СуммаСНДС = Сумма;

	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.СуммаСНДС = -Сумма;

	КонецЕсли;
	 
	
	Движение.Период = Дата;
	Движение.НомерНакладнойПоставщика = НакладнаяПост;
	Движение.СуммаСНДС = Сумма;
	Движение.ВидОперации=Перечисления.ВидыОпераций.ОплатаПоставщику;

	// записываем движения регистров
	Движения.Взаиморасчеты.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
