
Процедура ЗаписатьВИсториюИзменения(Файл)
	
	стрИзм = Изменения.Добавить();
	стрИзм.Дата = ТекущаяДата();
	стрИзм.Сотрудник = ПараметрыСеанса.ТекущийСотр;
	стрИзм.ТипИзм = Перечисления.ДействияНадДокументами.Выгрузка;
	стрИзм.КомментарийИзменения = "выгружен " + Файл;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	 
КонецПроцедуры                                

Процедура ОбработкаУдаленияПроведения(Отказ)
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДок = Товар.Итог("Сумма");
	
КонецПроцедуры
