Функция О_СгенерироватьПароль(КоличествоЗнаков=8,Прописн=Истина,Строчн=Истина,Циф=истина) Экспорт
    
    ПрописныеБуквы  = "ABCDEFGHJKLMNPQRSTUVWXYZ"; 
	СтрочныеБуквы   = "abcdefghijkmnpqrstuvwxyz";  
	Цифровые        = "123456789"; //Без "0"
	НаборНаборов = Новый Массив;
	
	Если Прописн Тогда
		НаборНаборов.Добавить(ПрописныеБуквы);
	КонецЕсли;
	Если Строчн Тогда
		НаборНаборов.Добавить(СтрочныеБуквы);
	КонецЕсли;
	Если Циф Тогда
		НаборНаборов.Добавить(Цифровые);
	КонецЕсли;
	КоличествоВНаборе = НаборНаборов.Количество();
	Если КоличествоВНаборе = 0 Тогда
		Сообщить("Не указан ни один вид символов!");
		Возврат "Неверные параметры вызова функции!";
	КонецЕсли;

	ГСЧ = Новый ГенераторСлучайныхЧисел();
		НовыйПароль = "";
		Для НомерСимвола = 1 По КоличествоЗнаков Цикл
			ТекущийНабор = НаборНаборов.Получить(ГСЧ.СлучайноеЧисло(0, КоличествоВНаборе-1));
			ДлинаНабора = СтрДлина(ТекущийНабор);
			НачальныйНомер = ГСЧ.СлучайноеЧисло(1, ДлинаНабора);
			НовыйПароль = НовыйПароль + Сред(ТекущийНабор, НачальныйНомер, 1);
		КонецЦикла;
		Возврат НовыйПароль;
КонецФункции
