
//============================================================================ GtG ===
Процедура ДвижениеТОвара()  
	
	ДТ= ЭтотОбъект.Движения.ПартииЖНВЛС;
	
	Если Склад.ТипСклада=Перечисления.ТипыМХ.Опт ТОгда
		ОптовыйСклад=ИСтина;
	Иначе
		ОптовыйСклад=Ложь;
	КонецЕсли;	
	
	
	
	Для каждого Стр из ТОвар Цикл
		
		СтрДТ=ДТ.Добавить();
		
		СтрДТ.ВидДвижения=ВидДвиженияНакопления.Расход;
		СтрДТ.ВидОперации=Перечисления.ВидыОпераций.ПродажаТМЦ;
		СтрДТ.Активность=Истина;
		СтрДТ.Колво=Стр.Количество*Стр.К;
		СтрДТ.Партия=Стр.Партия;
		СтрДТ.Период=Дата;
		СтрДТ.Регистратор= ЭтотОбъект.Ссылка;
		СтрДТ.Склад= ЭтотОбъект.Склад;
		СтрДТ.СтавкаНДС=Стр.СтавкаНДС;
		СтрДТ.СуммаЗакупСНДС=Стр.СуммаЗакуп;
		СтрДТ.СуммаНДСЗакуп=Стр.НДСЗакуп;
		
		ЕСли ОптовыйСклад=Истина Тогда
			СтрДТ.СуммаРознСНДС=Стр.СуммаЗакуп;
			СтрДТ.СуммаРознНДС=Стр.НДСЗакуп;
		Иначе	
			СтрДТ.СуммаРознНДС=Стр.СуммаНДС;
			СтрДТ.СуммаРознСНДС=Стр.Сумма;
		КонецЕсли;
		
		СтрДТ.Товар=Стр.Товар;
		СтрДТ.Фирма= Склад.Фирма; 
	КонецЦикла;	
	
	//Движения.ПартииЖНВЛС.Записать();
КонецПроцедуры

//============================================================================ GtG ===


//==========================================================GtG====
Процедура ДвижениеБухгалтерии ()  Экспорт
	//----------------------------------
	//Назначение:
	//  
	//  
	// по регистру ОстаткиПоСтНДСПоСкладам 
	//  
	//----------------------------------
	СвБухгалтерия= Бухгалтерия.Выгрузить();
	СвБухгалтерия.Свернуть("Касса,СтавкаНДС,ЗетОчет","ЗакупочнаяСНДС,НДСЗакуп,СуммаНДСБезСкидки,СуммаБезСкидки");
	
	
	Если Склад.ТипСклада=Перечисления.ТипыМХ.Опт ТОгда
		ОптовыйСклад=ИСтина;
	Иначе
		ОптовыйСклад=Ложь;
	КонецЕсли;	

	
	
	Для каждого Стр из СвБухгалтерия Цикл
		ДВ=Движения.ОстаткиПоСтНДСПоСкладам.Добавить();
		
		ДВ.ZОтчет=Стр.ЗетОчет;
		ДВ.Активность=Истина;
		ДВ.ВидДвижения=ВидДвиженияНакопления.Расход;
		ДВ.ВидОперации=Перечисления.ВидыОпераций.ПродажаТМЦ;
		ДВ.Касса=Стр.Касса;
		ДВ.Период= ЭтотОбъект.Дата;
		ДВ.Регистратор= ЭтотОбъект.Ссылка; 
		ДВ.Склад=Склад;
		ДВ.СтавкаНДС=Стр.СтавкаНДС;
		ДВ.СуммаЗакупСНДС=Стр.ЗакупочнаяСНДС;
		ДВ.СуммаНДСЗакуп=Стр.НДСЗакуп;
		
		Если ОптовыйСклад=ИСтина ТОгда
			ДВ.СуммаРознСНДС=Стр.ЗакупочнаяСНДС;
			ДВ.СуммаРознНДС=Стр.НДСЗакуп;
		Иначе
			ДВ.СуммаРознНДС=Стр.СуммаНДСБезСкидки;
			ДВ.СуммаРознСНДС=Стр.СуммаБезСкидки;
		КонецЕсли;

		ДВ.Фирма=Склад.Фирма;
	КонецЦикла;	
	
	//Движения.ОстаткиПоСтНДСПоСкладам.Записать();
	
	
	
	
	
	
	
	
	
КонецПроцедуры	//ДвижениеБухгалтерии
//==========================================================GtG====


//==========================================================GtG====
Процедура ДвижениеДисконта ()  Экспорт
	//----------------------------------
	//Назначение:
	//  
	//  
	//  по регистру   ДисконтныеКарты
	//  
	//----------------------------------
	
	Если Дисконт.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РеализацияККМТовар.Партия КАК Партия,
		               |	РеализацияККМТовар.СтавкаНДС
		               |ПОМЕСТИТЬ Ставки
		               |ИЗ
		               |	Документ.РеализацияККМ.Товар КАК РеализацияККМТовар
		               |ГДЕ
		               |	РеализацияККМТовар.Ссылка = &Документ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Партия
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	&Склад,
		               |	&Фирма,
		               |	ИСТИНА КАК Активность,
		               |	РеализацияККМДисконт.Товар,
		               |	РеализацияККМДисконт.Партия,
		               |	РеализацияККМДисконт.Карта КАК НомерДК,
		               |	Ставки.СтавкаНДС КАК СтавкаНДС,
		               |	РеализацияККМДисконт.Количество * РеализацияККМДисконт.К КАК КолВо,
		               |	РеализацияККМДисконт.СуммаСоСкидкой,
		               |	РеализацияККМДисконт.СуммаСкидки,
		               |	РеализацияККМДисконт.НомерЧека
		               |ИЗ
		               |	Документ.РеализацияККМ.Дисконт КАК РеализацияККМДисконт
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Ставки КАК Ставки
		               |		ПО (Ставки.Партия = РеализацияККМДисконт.Партия)
		               |ГДЕ
		               |	РеализацияККМДисконт.Ссылка = &Документ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ Ставки";
		
		Запрос.УстановитьПараметр("Документ",Ссылка);
		Запрос.УстановитьПараметр("Период",Дата);
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("Фирма",Фирма);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			Движения.ДисконтПоПартиям.Записывать = Истина;
			Движения.ДисконтПоПартиям.Загрузить(ТЗ);	
		КонецЕсли;
	КонецЕсли;
	
	Для каждого Стр из Дисконт Цикл
		ДВ=Движения.ДисконтныеКарты.Добавить();
		
		ДВ.Активность=Истина;
		//ДВ.ВидДвижения=ВидДвиженияНакопления.Приход;
		ДВ.Колво=Стр.Количество*Стр.К;
		ДВ.НомерДК=СокрЛП(Стр.Карта);
		ДВ.Период=Дата;
		ДВ.Регистратор= ЭтотОбъект.Ссылка;
		ДВ.СуммаРознСоСк=Стр.СуммаСоСкидкой;
		ДВ.СуммаСкидки=Стр.СуммаСкидки;
		ДВ.Товар=Стр.Товар;
				
		//---------------<Дисконт по партиям>---------------------------// GtG // 30.05.2012 11:08:47 
		//ДВ=Движения.ДисконтПоПартиям.Добавить();// обороты
		//
		//ДВ.Активность=Истина;
		//ДВ.Период=Дата;
		//ДВ.Регистратор= ЭтотОбъект.Ссылка;
		//
		//ДВ.Товар=Стр.Товар;
		//ДВ.Склад     =Склад ;
		//ДВ.Партия    =Стр.Партия ;
		//ДВ.СтавкаНДС =Стр.Партия.СтавкаНДС;
		//ДВ.Фирма     =Фирма ;
		//ДВ.НомерДК=СокрЛП(Стр.Карта);
		//
		//ДВ.Колво=Стр.Количество*Стр.К;
		//ДВ.СуммаСоСкидкой=Стр.СуммаСоСкидкой;
		//ДВ.СуммаСкидки=Стр.СуммаСкидки;
		

		
	КонецЦикла;	
	
	//Движения.ДисконтныеКарты.Записать();
	
	
	
	
КонецПроцедуры	//ДвижениеДисконта
//==========================================================GtG====

Процедура ДвижениеПродажиПоПартиямДляОптовыхСкладов()
	
	Если Склад.ТипСклада<>Перечисления.ТипыМХ.Опт тогда
		Возврат;  // розница не подходит
	КонецЕсли;	
	
	
	ДТ= ЭтотОбъект.Движения.ПродажиПоПартиям;
	
	
	
	
	Для каждого Стр из ТОвар Цикл
		
		СтрДТ=ДТ.Добавить();
		
		//СтрДТ.ВидДвижения=ВидДвиженияНакопления.Приход;
		СтрДТ.ВидОперации=Перечисления.ВидыОпераций.ПродажаТМЦ;
		СтрДТ.Активность=Истина;
		СтрДТ.Колво=Стр.Количество*Стр.К;
		СтрДТ.Партия=Стр.Партия;
		СтрДТ.Период=Дата;
		СтрДТ.Регистратор= ЭтотОбъект.Ссылка;
		СтрДТ.Склад= ЭтотОбъект.Склад;
		СтрДТ.СтавкаНДС=Стр.СтавкаНДС;
		СтрДТ.СуммаЗакупСНДС=Стр.СуммаЗакуп;
		СтрДТ.СуммаНДСЗакуп=Стр.НДСЗакуп;
		
			
		СтрДТ.СуммаРознНДС=Стр.СуммаНДС;
		СтрДТ.СуммаРознСНДС=Стр.Сумма;
		
		
		СтрДТ.Товар=Стр.Товар;
		СтрДТ.Фирма= Склад.Фирма; 
	КонецЦикла;	

КонецПроцедуры	


//==========================================================GtG====
Процедура ДвижениеСертификатов ()  Экспорт
	//----------------------------------
	//Назначение:
	//  
	//  
	//  по регистру   Сертификаты
	//  
	//----------------------------------
	
	Для каждого Стр из Сертификаты Цикл
		ДВ=Движения.ПодарочныеСертификаты.Добавить();
		
		ДВ.Активность=Истина;
		
		ДВ.НомерСертификата=Стр.НомерСертификата;
		ДВ.Номинал=Стр.Номинал;
		ДВ.Период=Дата;
		ДВ.Регистратор= ЭтотОбъект;
		ДВ.Склад=Склад;
		
		ДВ.СтавкаНДС=Стр.СтавкаНДС;
		
		ДВ.Сумма=(Стр.Сумма+Стр.СуммаВнереализационныхДоходов);
		ДВ.СуммаВнереализационныхДоходов=Стр.СуммаВнереализационныхДоходов;
		
		Если Стр.ОперацияССертификатом=Перечисления.ВидыОперацийССертификатами.Зачет Тогда
			ДВ.ВидДвижения=ВидДвиженияНакопления.Расход;
		Иначе	
			ДВ.ВидДвижения=ВидДвиженияНакопления.Приход;
		КонецЕсли;	
		
		
		
		
		
	КонецЦикла;	
	
//	Движения.ПодарочныеСертификаты.Записать();
	
	
	
	
КонецПроцедуры	//ДвижениеДисконта
//==========================================================GtG====

Процедура ДвижениеПродажПоТипамДляЦО() Экспорт
		 
		 
	ТХТ = "ВЫБРАТЬ
	      |	РеализацияККМТовар.Товар.ТипДляЦО КАК ТипЦО,
	      |	СУММА(РеализацияККМТовар.СуммаЗакуп) КАК СуммаЗакуп,
	      |	СУММА(РеализацияККМТовар.Сумма) КАК Сумма
	      |ПОМЕСТИТЬ ТЗТовар
	      |ИЗ
	      |	Документ.РеализацияККМ.Товар КАК РеализацияККМТовар
	      |ГДЕ
	      |	РеализацияККМТовар.Ссылка = &Ссылка
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	РеализацияККМТовар.Товар.ТипДляЦО
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	РеализацияККМДисконт.Товар.ТипДляЦО КАК ТипЦО,
	      |	СУММА(РеализацияККМДисконт.СуммаСкидки) КАК СуммаСкидки
	      |ПОМЕСТИТЬ Скидка
	      |ИЗ
	      |	Документ.РеализацияККМ.Дисконт КАК РеализацияККМДисконт
	      |ГДЕ
	      |	РеализацияККМДисконт.Ссылка = &Ссылка
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	РеализацияККМДисконт.Товар.ТипДляЦО
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	ТЗТовар.ТипЦО КАК ТипДляЦО,
	      |	СУММА(ТЗТовар.СуммаЗакуп) КАК СуммаЗакуп,
	      |	СУММА(ТЗТовар.Сумма - ЕСТЬNULL(Скидка.СуммаСкидки, 0)) КАК СуммаСоСкидкой,
	      |	СУММА(ТЗТовар.Сумма) КАК Сумма,
	      |	СУММА(ЕСТЬNULL(Скидка.СуммаСкидки, 0)) КАК Скидка
	      |ИЗ
	      |	ТЗТовар КАК ТЗТовар
	      |		ЛЕВОЕ СОЕДИНЕНИЕ Скидка КАК Скидка
	      |		ПО ТЗТовар.ТипЦО = Скидка.ТипЦО
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	ТЗТовар.ТипЦО
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |УНИЧТОЖИТЬ Скидка
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |УНИЧТОЖИТЬ ТЗТовар";	 
		 //-------------------- Запрос by GtG -----------------------
		 // Назначение: Выборка из табличных частей документа для записи в регистр
		 //----------------------------------------------------------
		 
		 Запрос=Новый Запрос;
		 Запрос.Текст=ТХТ;
		 
		 Запрос.Параметры.Вставить("Ссылка", ЭтотОбъект.Ссылка);
		 
		 ТЗ=Запрос.Выполнить().Выгрузить();
		 
		 Для каждого  Стр Из ТЗ  Цикл
		 	Движение=Движения.ПродажиПоТипамДляЦО.Добавить();
			
			Движение.Активность=Истина;
			Движение.Период=Дата;
			Движение.Регистратор= ЭтотОбъект.Ссылка;
			Движение.Склад=Склад;
			Движение.СуммаЗакупочная=Стр.СуммаЗакуп;
			Движение.СуммаПродажСоСкидкой= Стр.СуммаСоСкидкой;
			Движение.СуммаСкидки=стр.Скидка;
			Движение.ТипДляЦО=Стр.ТипДляЦО;
		 КонецЦикла; 
		 
		 
		 
	//	Движения.ПродажиПоТипамДляЦО.Записать(); 
		 
		 
		 
		 
		 
		 //----------------------------------------------------------
		 
		 
	
КонецПроцедуры  


Процедура ДвижениеПрограммЛояльности() Экспорт
	
	Для каждого  Стр Из  ПрограммыЛояльности Цикл
		
		Если  Стр.СуммаСкидки=0 Тогда
			Продолжить;
		КонецЕсли; 	
		
		
		Дв= ЭтотОбъект.Движения.ПрограммыЛояльности.Добавить();
		
		ДВ.Активность=Истина;
		ДВ.Аптека= Склад;
		ДВ.БарКодТовара=Стр.БарКодТовара;
		ДВ.Количество=Стр.Количество;
		ДВ.Контрагент=Стр.Контрагент;
		ДВ.НомерКарты=Стр.НомерКарты;
		ДВ.НомерККМ=Стр.НомерККМ;
		ДВ.НомерСмены=Стр.НомерСмены;
		ДВ.НомерЧека=Стр.НомерЧека;
		ДВ.Период=Дата;
		ДВ.Регистратор=ЭтотОбъект;
		ДВ.СуммаНДС=Стр.СуммаНДС;
		ДВ.СуммаНДССкидки=Стр.СуммаНДССкидки;
		ДВ.СуммаСкидки=Стр.СуммаСкидки;
		ДВ.СуммаСоСкидкой=Стр.СуммаСоСкидкой;
		ДВ.Товар=Стр.Товар;
		ДВ.Поставщик=Стр.Поставщик;
	КонецЦикла; 	
	
//	ЭтотОбъект.Движения.ПрограммыЛояльности.Записать();
	
	
КонецПроцедуры

Процедура ДвиженияМотивации()
	    запрос=новый запрос(
		"ВЫБРАТЬ
		|	РеализацияККМПерсональныеПродажиТовар.Ссылка.Дата КАК Период,
		|	ИСТИНА КАК Активность,
		|	РеализацияККМПерсональныеПродажиТовар.Ссылка КАК Регистратор,
		|	РеализацияККМПерсональныеПродажиТовар.Ссылка.Фирма КАК Фирма,
		|	РеализацияККМПерсональныеПродажиТовар.Ссылка.Склад КАК Склад,
		|	РеализацияККМПерсональныеПродажиТовар.Сотрудник КАК Сотрудник,
		|	РеализацияККМПерсональныеПродажиТовар.Товар КАК Товар,
		|	РеализацияККМПерсональныеПродажиТовар.Количество КАК Количество,
		|	РеализацияККМПерсональныеПродажиТовар.СуммаРознФакт КАК СуммаРознФакт,
		|	РеализацияККМПерсональныеПродажиТовар.СуммаСкидки КАК СуммаСкидки,
		|	РеализацияККМПерсональныеПродажиТовар.СуммаЗакуп КАК СуммаЗакуп,
		|	РеализацияККМПерсональныеПродажиТовар.Коэффициент КАК Коэффициент
		|ИЗ
		|	Документ.РеализацияККМ.ПерсональныеПродажиТовар КАК РеализацияККМПерсональныеПродажиТовар
		|ГДЕ
		|	РеализацияККМПерсональныеПродажиТовар.Ссылка = &Ссылка");

		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		
		Если Дата<Дата("20140101000000") Тогда
			МесяцДаты="";
		Иначе	
			МесяцДаты=Месяц(Дата);
		КонецЕсли;
			
		Движения["ПродажиДляМотивации"+МесяцДаты].Загрузить(ТЗ);
		
		//---------------<по регистру сведений>---------------------------// GtG // 07.02.2013 20:38:43
		
		
	запрос.Текст=	"ВЫБРАТЬ
	             	|	РеализацияККМПерсональныеПродажиКонтроль.Ссылка КАК Регистратор,
	             	|	ИСТИНА КАК активность,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.Сотрудник КАК Сотрудник,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.КоличествоЧеков КАК КоличествоЧеков,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.НачалоСмены КАК НачалоСмены,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.КонецСмены КАК КонецСмены,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.СуммаРознФакт КАК СуммаРознФакт,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.СуммаЗакуп КАК СуммаЗакуп,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.СуммаСкидки КАК СуммаСкидки,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.Ссылка.Фирма КАК Фирма,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.Ссылка.Склад КАК Склад,
	             	|	РеализацияККМПерсональныеПродажиКонтроль.Ссылка.Дата КАК Период
	             	|ИЗ
	             	|	Документ.РеализацияККМ.ПерсональныеПродажиКонтроль КАК РеализацияККМПерсональныеПродажиКонтроль
	             	|ГДЕ
	             	|	РеализацияККМПерсональныеПродажиКонтроль.Ссылка = &Ссылка";
		
		ТЗ=Запрос.Выполнить().Выгрузить();

		Движения.ПДМ_КонтрольСотрудников.Загрузить(ТЗ);
		
	
КонецПроцедуры

Процедура ДвижениеККМСводный()  Экспорт
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияККМБухгалтерия.Ссылка.Дата КАК Период,
	               |	РеализацияККМБухгалтерия.Ссылка.Фирма КАК Фирма,
	               |	РеализацияККМБухгалтерия.Ссылка.Склад КАК Склад,
	               |	ВЫБОР
	               |		КОГДА РеализацияККМБухгалтерия.ВидПоступленияТовара = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.Покупка)
	               |			ТОГДА 0
	               |		КОГДА РеализацияККМБухгалтерия.ВидПоступленияТовара = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.Комиссия)
	               |			ТОГДА 1
	               |		КОГДА РеализацияККМБухгалтерия.ВидПоступленияТовара = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.БонусныйТовар)
	               |			ТОГДА 2
	               |		КОГДА РеализацияККМБухгалтерия.ВидПоступленияТовара = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.Подарки)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВидПоступленияТовара,
	               |	ВЫБОР
	               |		КОГДА РеализацияККМБухгалтерия.ТипНалогообложенияПТ = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложения.НДС)
	               |			ТОГДА 0
	               |		КОГДА РеализацияККМБухгалтерия.ТипНалогообложенияПТ = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложения.ЕНВД)
	               |			ТОГДА 1
	               |		КОГДА РеализацияККМБухгалтерия.ТипНалогообложенияПТ = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложения.УСН)
	               |			ТОГДА 2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТипНОПоступленияТовара,
	               |	РеализацияККМБухгалтерия.СтавкаНДС.Ставка КАК СтавкаНДС,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	СУММА(РеализацияККМБухгалтерия.ЗакупочнаяСНДС) КАК СуммаЗакуп,
	               |	СУММА(РеализацияККМБухгалтерия.СуммаБезСкидки) КАК СуммаРозн,
	               |	СУММА(РеализацияККМБухгалтерия.СуммаСкидки) КАК СуммаСкидки,
	               |	СУММА(РеализацияККМБухгалтерия.НДСЗакуп) КАК СуммаЗакупНДС,
	               |	СУММА(РеализацияККМБухгалтерия.СуммаНДСБезСкидки) КАК СуммаРознНДС
	               |ИЗ
	               |	Документ.РеализацияККМ.Бухгалтерия КАК РеализацияККМБухгалтерия
	               |ГДЕ
	               |	РеализацияККМБухгалтерия.Ссылка = &Документ
	               |	И РеализацияККМБухгалтерия.СуммаБезСкидки > 0
	               |	И РеализацияККМБухгалтерия.ЗакупочнаяСНДС > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияККМБухгалтерия.Ссылка.Дата,
	               |	РеализацияККМБухгалтерия.ТипНалогообложенияПТ,
	               |	РеализацияККМБухгалтерия.ВидПоступленияТовара,
	               |	РеализацияККМБухгалтерия.СтавкаНДС.Ставка,
	               |	РеализацияККМБухгалтерия.Ссылка.Фирма,
	               |	РеализацияККМБухгалтерия.Ссылка.Склад";
				   
	Запрос.УстановитьПараметр("Документ",Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда
		Движения.ПродажаККМСводный.Записывать = Истина;
		Движения.ПродажаККМСводный.Загрузить(ТЗ);	
	КонецЕсли;
	
КонецПроцедуры



Процедура ПодготовитьТаблицыДвижений(ТаблицыДвижений)
	
	ТипСклада = Склад.ТипСклада;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("КодСклада",Склад.Код);
	Запрос.УстановитьПараметр("Фирма",Склад.Фирма);
	Запрос.УстановитьПараметр("КодФирмы",Склад.Фирма.Код);
	Запрос.УстановитьПараметр("ТипСклада",ТипСклада);
	Запрос.УстановитьПараметр("ЗачетСертификата",Перечисления.ВидыОперацийССертификатами.Зачет);
	Запрос.УстановитьПараметр("ВыполнятьЗапрос",?(ТипСклада = Перечисления.ТипыМХ.Опт,Истина,Ложь));
    Запрос.УстановитьПараметр("ПолучениеАванса",Перечисления.ВидДвиженияАвансов.ПолучениеАванса);

	//движение по  дисконту отдельно надо будет сделать после ПДМ_КонтрольСотрудников
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияККМПерсональныеПродажиКонтроль.Ссылка КАК Регистратор,
	               |	ИСТИНА КАК активность,
	               |	РеализацияККМПерсональныеПродажиКонтроль.Сотрудник КАК Сотрудник,
	               |	РеализацияККМПерсональныеПродажиКонтроль.КоличествоЧеков КАК КоличествоЧеков,
	               |	РеализацияККМПерсональныеПродажиКонтроль.НачалоСмены КАК НачалоСмены,
	               |	РеализацияККМПерсональныеПродажиКонтроль.КонецСмены КАК КонецСмены,
	               |	РеализацияККМПерсональныеПродажиКонтроль.СуммаРознФакт КАК СуммаРознФакт,
	               |	РеализацияККМПерсональныеПродажиКонтроль.СуммаЗакуп КАК СуммаЗакуп,
	               |	РеализацияККМПерсональныеПродажиКонтроль.СуммаСкидки КАК СуммаСкидки,
				   |	РеализацияККМПерсональныеПродажиКонтроль.СРН КАК СРН,
				   |	РеализацияККМПерсональныеПродажиКонтроль.Бонус КАК Бонус,
				   |	РеализацияККМПерсональныеПродажиКонтроль.БонусТД КАК БонусТД,
	               |	&Фирма КАК Фирма,
	               |	&Склад КАК Склад,
	               |	&Дата КАК Период
	               |ИЗ
	               |	Документ.РеализацияККМ.ПерсональныеПродажиКонтроль КАК РеализацияККМПерсональныеПродажиКонтроль
	               |ГДЕ
	               |	РеализацияККМПерсональныеПродажиКонтроль.Ссылка = &Ссылка
	               |;
				   //1
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Фирма КАК Фирма,
	               |	&Склад КАК Склад,
	               |	&Дата КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПродажаТМЦ) КАК ВидОперации,
	               |	РеализацияККМБухгалтерия.Касса,
	               |	РеализацияККМБухгалтерия.СтавкаНДС,
	               |	РеализацияККМБухгалтерия.ЗетОчет КАК ZОтчет,
	               |	СУММА(РеализацияККМБухгалтерия.ЗакупочнаяСНДС) КАК СуммаЗакупСНДС,
	               |	СУММА(РеализацияККМБухгалтерия.НДСЗакуп) КАК СуммаНДСЗакуп,
	               |	ВЫБОР
	               |		КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыМХ.Розн)
	               |			ТОГДА СУММА(РеализацияККМБухгалтерия.СуммаНДСБезСкидки)
	               |		ИНАЧЕ СУММА(РеализацияККМБухгалтерия.НДСЗакуп)
	               |	КОНЕЦ КАК СуммаРознНДС,
	               |	ВЫБОР
	               |		КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыМХ.Розн)
	               |			ТОГДА СУММА(РеализацияККМБухгалтерия.СуммаБезСкидки)
	               |		ИНАЧЕ СУММА(РеализацияККМБухгалтерия.ЗакупочнаяСНДС)
	               |	КОНЕЦ КАК СуммаРознСНДС
	               |ИЗ
	               |	Документ.РеализацияККМ.Бухгалтерия КАК РеализацияККМБухгалтерия
	               |ГДЕ
	               |	РеализацияККМБухгалтерия.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияККМБухгалтерия.Касса,
	               |	РеализацияККМБухгалтерия.СтавкаНДС,
	               |	РеализацияККМБухгалтерия.ЗетОчет
	               |;
	               |
				   //2
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Фирма КАК Фирма,
	               |	&Склад КАК Склад,
	               |	&Дата КАК Период,
	               |	ИСТИНА КАК Активность,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПродажаТМЦ) КАК ВидОперации,
	               |	РеализацияККМТовар.Товар,
	               |	РеализацияККМТовар.Партия,
	               |	РеализацияККМТовар.СтавкаНДС,
	               |	РеализацияККМТовар.Количество * РеализацияККМТовар.К КАК КолВо,
	               |	РеализацияККМТовар.СуммаЗакуп КАК СуммаЗакупСНДС,
	               |	РеализацияККМТовар.НДСЗакуп КАК СуммаНДСЗакуп,
	               |	ВЫБОР
	               |		КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыМХ.Розн)
	               |			ТОГДА РеализацияККМТовар.СуммаНДС
	               |		ИНАЧЕ РеализацияККМТовар.НДСЗакуп
	               |	КОНЕЦ КАК СуммаРознНДС,
	               |	ВЫБОР
	               |		КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыМХ.Розн)
	               |			ТОГДА РеализацияККМТовар.Сумма
	               |		ИНАЧЕ РеализацияККМТовар.СуммаЗакуп
	               |	КОНЕЦ КАК СуммаРознСНДС
	               |ИЗ
	               |	Документ.РеализацияККМ.Товар КАК РеализацияККМТовар
	               |ГДЕ
	               |	РеализацияККМТовар.Ссылка = &Ссылка
	               |;
	               |
				   //3
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Фирма КАК Фирма,
	               |	&Склад КАК Склад,
	               |	&Дата КАК Период,
	               |	ИСТИНА КАК Активность,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПродажаТМЦ) КАК ВидОперации,
	               |	РеализацияККМТовар.Товар,
	               |	РеализацияККМТовар.Партия,
	               |	РеализацияККМТовар.СтавкаНДС,
	               |	РеализацияККМТовар.Количество * РеализацияККМТовар.К КАК КолВо,
	               |	РеализацияККМТовар.СуммаЗакуп КАК СуммаЗакупСНДС,
	               |	РеализацияККМТовар.НДСЗакуп КАК СуммаНДСЗакуп,
	               |	РеализацияККМТовар.СуммаНДС КАК СуммаРознНДС,
	               |	РеализацияККМТовар.Сумма КАК СуммаРознСНДС
	               |ИЗ
	               |	Документ.РеализацияККМ.Товар КАК РеализацияККМТовар
	               |ГДЕ
	               |	РеализацияККМТовар.Ссылка = &Ссылка
	               |	И ИСТИНА = &ВыполнятьЗапрос
	               |;
	               |
				   //4
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Склад КАК Склад,
	               |	&Дата КАК Период,
	               |	ИСТИНА КАК Активность,
	               |	РеализацияККМСертификаты.НомерСертификата,
	               |	РеализацияККМСертификаты.Номинал,
	               |	РеализацияККМСертификаты.СтавкаНДС,
	               |	РеализацияККМСертификаты.Сумма + РеализацияККМСертификаты.СуммаВнереализационныхДоходов КАК Сумма,
	               |	РеализацияККМСертификаты.СуммаВнереализационныхДоходов,
	               |	ВЫБОР
	               |		КОГДА РеализацияККМСертификаты.ОперацияССертификатом = &ЗачетСертификата
	               |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |	КОНЕЦ КАК ВидДвижения
	               |ИЗ
	               |	Документ.РеализацияККМ.Сертификаты КАК РеализацияККМСертификаты
	               |ГДЕ
	               |	РеализацияККМСертификаты.Ссылка = &Ссылка
	               |;
	               |
				   //5
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Склад КАК Аптека,
	               |	&Дата КАК Период,
	               |	ИСТИНА КАК Активность,
	               |	РеализацияККМПрограммыЛояльности.БарКодТовара,
	               |	РеализацияККМПрограммыЛояльности.Количество,
	               |	РеализацияККМПрограммыЛояльности.Контрагент,
	               |	РеализацияККМПрограммыЛояльности.НомерКарты,
	               |	РеализацияККМПрограммыЛояльности.НомерККМ,
	               |	РеализацияККМПрограммыЛояльности.НомерСмены,
	               |	РеализацияККМПрограммыЛояльности.НомерЧека,
	               |	РеализацияККМПрограммыЛояльности.СуммаНДС,
	               |	РеализацияККМПрограммыЛояльности.СуммаНДССкидки,
	               |	РеализацияККМПрограммыЛояльности.СуммаСкидки,
	               |	РеализацияККМПрограммыЛояльности.СуммаСоСкидкой,
	               |	РеализацияККМПрограммыЛояльности.Товар,
	               |	РеализацияККМПрограммыЛояльности.Поставщик
	               |ИЗ
	               |	Документ.РеализацияККМ.ПрограммыЛояльности КАК РеализацияККМПрограммыЛояльности
	               |ГДЕ
	               |	РеализацияККМПрограммыЛояльности.Ссылка = &Ссылка
	               |	И РеализацияККМПрограммыЛояльности.СуммаСкидки <> 0
	               |;
	               |
				   //6
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Фирма КАК Фирма,
	               |	&Склад КАК Склад,
	               |	&Дата КАК Период,
	               |	ИСТИНА КАК Активность,
	               |	ВЫБОР
	               |		КОГДА РеализацияККМБухгалтерия.ВидПоступленияТовара = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.Покупка)
	               |			ТОГДА 0
	               |		КОГДА РеализацияККМБухгалтерия.ВидПоступленияТовара = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.Комиссия)
	               |			ТОГДА 1
	               |		КОГДА РеализацияККМБухгалтерия.ВидПоступленияТовара = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.БонусныйТовар)
	               |			ТОГДА 2
	               |		КОГДА РеализацияККМБухгалтерия.ВидПоступленияТовара = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.Подарки)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВидПоступленияТовара,
	               |	ВЫБОР
	               |		КОГДА РеализацияККМБухгалтерия.ТипНалогообложенияПТ = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложения.НДС)
	               |			ТОГДА 0
	               |		КОГДА РеализацияККМБухгалтерия.ТипНалогообложенияПТ = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложения.ЕНВД)
	               |			ТОГДА 1
	               |		КОГДА РеализацияККМБухгалтерия.ТипНалогообложенияПТ = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложения.УСН)
	               |			ТОГДА 2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТипНОПоступленияТовара,
	               |	РеализацияККМБухгалтерия.СтавкаНДС.Ставка КАК СтавкаНДС,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	СУММА(РеализацияККМБухгалтерия.ЗакупочнаяСНДС) КАК СуммаЗакуп,
	               |	СУММА(РеализацияККМБухгалтерия.СуммаБезСкидки) КАК СуммаРозн,
	               |	СУММА(РеализацияККМБухгалтерия.СуммаСкидки) КАК СуммаСкидки,
	               |	СУММА(РеализацияККМБухгалтерия.НДСЗакуп) КАК СуммаЗакупНДС,
	               |	СУММА(РеализацияККМБухгалтерия.СуммаНДСБезСкидки) КАК СуммаРознНДС
	               |ИЗ
	               |	Документ.РеализацияККМ.Бухгалтерия КАК РеализацияККМБухгалтерия
	               |ГДЕ
	               |	РеализацияККМБухгалтерия.Ссылка = &Ссылка
	               |	И РеализацияККМБухгалтерия.СуммаБезСкидки > 0
	               |	И РеализацияККМБухгалтерия.ЗакупочнаяСНДС > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияККМБухгалтерия.ТипНалогообложенияПТ,
	               |	РеализацияККМБухгалтерия.ВидПоступленияТовара,
	               |	РеализацияККМБухгалтерия.СтавкаНДС.Ставка
	               |;
	               |
				   //7
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Фирма КАК Фирма,
	               |	&Склад КАК Склад,
	               |	&Дата КАК Период,
	               |	ИСТИНА КАК Активность,
	               |	РеализацияККМПерсональныеПродажиТовар.Сотрудник КАК Сотрудник,
	               |	РеализацияККМПерсональныеПродажиТовар.Товар КАК Товар,
	               |	РеализацияККМПерсональныеПродажиТовар.Количество КАК Количество,
	               |	РеализацияККМПерсональныеПродажиТовар.СуммаРознФакт КАК СуммаРознФакт,
	               |	РеализацияККМПерсональныеПродажиТовар.СуммаСкидки КАК СуммаСкидки,
	               |	РеализацияККМПерсональныеПродажиТовар.СуммаЗакуп КАК СуммаЗакуп,
				   |	РеализацияККМПерсональныеПродажиТовар.СРН КАК СРН,
				   |	РеализацияККМПерсональныеПродажиТовар.Бонус КАК Бонус,
				   |	РеализацияККМПерсональныеПродажиТовар.БонусТД КАК БонусТД,				   
	               |	РеализацияККМПерсональныеПродажиТовар.Коэффициент КАК Коэффициент
	               |ИЗ
	               |	Документ.РеализацияККМ.ПерсональныеПродажиТовар КАК РеализацияККМПерсональныеПродажиТовар
	               |ГДЕ
	               |	РеализацияККМПерсональныеПродажиТовар.Ссылка = &Ссылка
	               |;
	               |
				   //8
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияККМТовар.Товар.ТипДляЦО КАК ТипЦО,
	               |	СУММА(РеализацияККМТовар.СуммаЗакуп) КАК СуммаЗакуп,
	               |	СУММА(РеализацияККМТовар.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ТЗТовар
	               |ИЗ
	               |	Документ.РеализацияККМ.Товар КАК РеализацияККМТовар
	               |ГДЕ
	               |	РеализацияККМТовар.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияККМТовар.Товар.ТипДляЦО
	               |;
	               |
				   //9
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияККМДисконт.Товар.ТипДляЦО КАК ТипЦО,
	               |	СУММА(РеализацияККМДисконт.СуммаСкидки) КАК СуммаСкидки
	               |ПОМЕСТИТЬ Скидка
	               |ИЗ
	               |	Документ.РеализацияККМ.Дисконт КАК РеализацияККМДисконт
	               |ГДЕ
	               |	РеализацияККМДисконт.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияККМДисконт.Товар.ТипДляЦО
	               |;
	               |
				   //10
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Склад КАК Склад,
	               |	&Дата КАК Период,
	               |	ИСТИНА КАК Активность,
	               |	ТЗТовар.ТипЦО КАК ТипДляЦО,
	               |	СУММА(ТЗТовар.СуммаЗакуп) КАК СуммаЗакупочная,
	               |	СУММА(ТЗТовар.Сумма - ЕСТЬNULL(Скидка.СуммаСкидки, 0)) КАК СуммаПродажСоСкидкой,
	               |	СУММА(ЕСТЬNULL(Скидка.СуммаСкидки, 0)) КАК СуммаСкидки
	               |ИЗ
	               |	ТЗТовар КАК ТЗТовар
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Скидка КАК Скидка
	               |		ПО ТЗТовар.ТипЦО = Скидка.ТипЦО
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЗТовар.ТипЦО
	               |;
                   //11
                   |ВЫБРАТЬ
                   |   &Дата КАК Период,
                   |   &Ссылка КАК Регистратор,
                   |   ИСТИНА КАК Активность,
                   |   ВЫБОР
                   |       КОГДА РеализацияККМАвансы.ВидДвижения = &ПолучениеАванса
                   |           ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
                   |       ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
                   |   КОНЕЦ КАК ВидДвижения,
                   |   РеализацияККМАвансы.ИДАванса,
                   |   РеализацияККМАвансы.ТипАванса,
                   |   РеализацияККМАвансы.Сумма,
                   |   РеализацияККМАвансы.СтавкаНДС
                   |ИЗ
                   |   Документ.РеализацияККМ.Авансы КАК РеализацияККМАвансы
                   |ГДЕ
                   |   РеализацияККМАвансы.Ссылка = &Ссылка 
                   |;
                   //12
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&КодФирмы КАК КодФирмы,
	               |	&КодСклада КАК КодСклада,
	               |	&Дата КАК Период,
	               |	ИСТИНА КАК Активность,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	РККМ.Товар.Код			как КодТовара,
	               |	РККМ.Партия.Код			как КодПартии,
	               |	РККМ.СтавкаНДС.Ставка 	как СтавкаНДС,
	               |	РККМ.Количество * РККМ.К КАК Количество,
	               |	РККМ.СуммаЗакуп 		КАК СуммаЗакуп,
				   |	РККМ.Сумма 				КАК СуммаРозн,
	               |	РККМ.НДСЗакуп 			КАК НДСЗакуп,
	               |	РККМ.СуммаНДС 			как НДСРозн,
	               |    РККМ.Партия.ВидПоступленияТовара.Порядок как ВидПоступленияТовара,
				   |	РККМ.Партия.К КАК К
	               |ИЗ
	               |	Документ.РеализацияККМ.Товар КАК РККМ
	               |ГДЕ
	               |	РККМ.Ссылка = &Ссылка
	               |;				   
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Скидка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТЗТовар";	
				   
			Результат = Запрос.ВыполнитьПакет();	   
			ТаблицыДвижений.Вставить("ПДМ_КонтрольСотрудников",	Результат[0].Выгрузить());
			ТаблицыДвижений.Вставить("ОстаткиПоСтНДСПоСкладам",	Результат[1].Выгрузить());
			ТаблицыДвижений.Вставить("ПартииЖНВЛС",				Результат[2].Выгрузить());
			ТаблицыДвижений.Вставить("ПродажиПоПартиям",		Результат[3].Выгрузить());
			ТаблицыДвижений.Вставить("Сертификаты",				Результат[4].Выгрузить());
			ТаблицыДвижений.Вставить("ПрограммыЛояльности",		Результат[5].Выгрузить());
			ТаблицыДвижений.Вставить("ПродажаККМСводный",		Результат[6].Выгрузить());
			ТаблицыДвижений.Вставить("ПродажиДляМотивации",		Результат[7].Выгрузить());			
			ТаблицыДвижений.Вставить("ПродажиПоТипамДляЦО",		Результат[10].Выгрузить());			
            ТаблицыДвижений.Вставить("Авансы",					Результат[11].Выгрузить());
			ТаблицыДвижений.Вставить("РеализацииККМ",			Результат[12].Выгрузить());			
			Результат = Неопределено;
            Запрос = Неопределено;
            
            
            
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	#IF CLIENT Then
		ОчиститьСообщения(); 
	#ENDIF
	
	Если Бухгалтерия.Итог("СуммаСоСкидкой")<>0 Тогда
		
		ТаблицыДвижений = Новый Структура();
		ПодготовитьТаблицыДвижений(ТаблицыДвижений);
		
			//ТаблицыДвижений.Вставить("ПДМ_КонтрольСотрудников",	Результат[0].Выгрузить());
			//ТаблицыДвижений.Вставить("ОстаткиПоСтНДСПоСкладам",	Результат[1].Выгрузить());
			//ТаблицыДвижений.Вставить("ПартииЖНВЛС",				Результат[2].Выгрузить());
			//ТаблицыДвижений.Вставить("ПродажиПоПартиям",		Результат[3].Выгрузить());
			//ТаблицыДвижений.Вставить("Сертификаты",				Результат[4].Выгрузить());
			//ТаблицыДвижений.Вставить("ПрограммыЛояльности",		Результат[5].Выгрузить());
			//ТаблицыДвижений.Вставить("ПродажаККМСводный",		Результат[6].Выгрузить());
			//ТаблицыДвижений.Вставить("ПродажиДляМотивации",		Результат[7].Выгрузить());			
			//ТаблицыДвижений.Вставить("ПродажиПоТипамДляЦО",		Результат[10].Выгрузить());			
			//ТаблицыДвижений.Вставить("Авансы",		Результат[11].Выгрузить());

			
			Таблица= ТаблицыДвижений.ПДМ_КонтрольСотрудников;
			Если Таблица.Количество() > 0 Тогда
				Движения.ПДМ_КонтрольСотрудников.Записывать = Истина;
				Движения.ПДМ_КонтрольСотрудников.Загрузить(Таблица);
			КонецЕсли;
			
			Таблица= ТаблицыДвижений.ПартииЖНВЛС;
			Если Таблица.Количество() > 0 Тогда
				Движения.ПартииЖНВЛС.Записывать = Истина;
				Движения.ПартииЖНВЛС.Загрузить(Таблица);
			КонецЕсли;
			
			Таблица= ТаблицыДвижений.ОстаткиПоСтНДСПоСкладам;
			Если Таблица.Количество() > 0 Тогда
				Движения.ОстаткиПоСтНДСПоСкладам.Записывать = Истина;
				Движения.ОстаткиПоСтНДСПоСкладам.Загрузить(Таблица);
			КонецЕсли;
			
			
			Таблица= ТаблицыДвижений.ПродажиПоПартиям;
			Если Таблица.Количество() > 0 Тогда
				Движения.ПродажиПоПартиям.Записывать = Истина;
				Движения.ПродажиПоПартиям.Загрузить(Таблица);
			КонецЕсли;
			
			
			Таблица= ТаблицыДвижений.Сертификаты;
			Если Таблица.Количество() > 0 Тогда
				Движения.ПодарочныеСертификаты.Записывать = Истина;
				Движения.ПодарочныеСертификаты.Загрузить(Таблица);
			КонецЕсли;
			
			Таблица= ТаблицыДвижений.ПрограммыЛояльности;
			Если Таблица.Количество() > 0 Тогда
				Движения.ПрограммыЛояльности.Записывать = Истина;
				Движения.ПрограммыЛояльности.Загрузить(Таблица);
			КонецЕсли;
			
			Таблица= ТаблицыДвижений.ПродажаККМСводный;
			Если Таблица.Количество() > 0 Тогда
				Движения.ПродажаККМСводный.Записывать = Истина;
				Движения.ПродажаККМСводный.Загрузить(Таблица);
			КонецЕсли;
			
			Таблица= ТаблицыДвижений.ПродажиДляМотивации;
			Если Таблица.Количество() > 0 Тогда
				
				Если Дата<Дата("20140101000000") Тогда
					МесяцДаты="";
				Иначе	
					МесяцДаты=Месяц(Дата);
				КонецЕсли;
				Движения["ПродажиДляМотивации"+МесяцДаты].Записывать = Истина;
				Движения["ПродажиДляМотивации"+МесяцДаты].Загрузить(Таблица);
			КонецЕсли;
			
			Таблица= ТаблицыДвижений.ПродажиПоТипамДляЦО;
			Если Таблица.Количество() > 0 Тогда
				Движения.ПродажиПоТипамДляЦО.Записывать = Истина;
				Движения.ПродажиПоТипамДляЦО.Загрузить(Таблица);
			КонецЕсли;
            
            
            Таблица= ТаблицыДвижений.Авансы;
			Если Таблица.Количество() > 0 Тогда
				Движения.Авансы.Записывать = Истина;
				Движения.Авансы.Загрузить(Таблица);
			КонецЕсли;
			
			Таблица= ТаблицыДвижений.РеализацииККМ;
			Если Таблица.Количество() > 0 Тогда
				Движения.РеализацииККМ.Записывать = Истина;
				Движения.РеализацииККМ.Загрузить(Таблица);
			КонецЕсли;			

			
			ДвижениеДисконта();

			
			
			
			
			
		//ДвижениеТОвара();
		//
		//ДвижениеПродажиПоПартиямДляОптовыхСкладов();
		//
		//ДвижениеБухгалтерии();
		//ДвижениеСертификатов ();
		//ДвижениеПродажПоТипамДляЦО();
		//ДвижениеПрограммЛояльности();
		//ДвижениеККМСводный();
		////---------------<Персональные продажи>---------------------------// GtG // 07.02.2013 14:11:25
		//ДвиженияМотивации();

	Иначе
		// это затычка пустого дня
	КонецЕсли;

	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Запрос=Новый Запрос;
	
	Если  ЭтотОбъект.ЭтоНовый()=Истина Тогда
		СтрокаИзм=ЭтотОбъект.Изменения.Добавить();
		СтрокаИзм.Дата=ТекущаяДата();
		СтрокаИзм.Сотрудник=ПараметрыСеанса.ТекущийСотр.Ссылка;
		СтрокаИзм.КомментарийИзменения="Создан новый";
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоНовый()=Ложь Тогда //фиксируем изменение затычки в историю изменений
		Запрос.Текст="ВЫБРАТЬ
		                    |	РеализацияККМ.Затычка
		                    |ИЗ
		                    |	Документ.РеализацияККМ КАК РеализацияККМ
		                    |ГДЕ
		                    |	РеализацияККМ.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		
		Рез=Запрос.Выполнить();
		Выборка=Рез.Выбрать();
		Выборка.Следующий();
		ПредыдущееСостояниеЗатычки=Выборка.Затычка;
		
		Если Затычка<>ПредыдущееСостояниеЗатычки ТОгда
			СтрокаИзм=ЭтотОбъект.Изменения.Добавить();
			СтрокаИзм.Дата=ТекущаяДата();
			СтрокаИзм.Сотрудник=ПараметрыСеанса.ТекущийСотр.Ссылка;
			СтрокаИзм.КомментарийИзменения="Изменена затычка с "+Формат(ПредыдущееСостояниеЗатычки,"БЛ=Нет; БИ=Да")+" на "+Формат(Затычка,"БЛ=Нет; БИ=Да");
		КонецЕСли;
		
	КонецЕсли;
	
	
	СуммаВозврата=СуммыПоЗетОтчетам.Итог("ВозвратыПоЗетОтчетуНал")+СуммыПоЗетОтчетам.Итог("ВозвратыПоЗетОтчетуБезНал");
	
	Сумма=Бухгалтерия.Итог("СуммаБезСкидки");
	СуммаСоСкидкой=Бухгалтерия.Итог("СуммаСоСкидкой");
	
	
	//---------------<Розыск ККМ>---------------------------// GtG // 08.04.2015 18:45:11
	Запрос.Текст="ВЫБРАТЬ
	             |	Розыск_ККМ.Ссылка
	             |ИЗ
	             |	Справочник.Розыск_ККМ КАК Розыск_ККМ
	             |ГДЕ
	             |	Розыск_ККМ.НомерРазыскиваемойККМ = &НомерРазыскиваемойККМ
	             |	И Розыск_ККМ.ДатаОбнаружения = ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("НомерРазыскиваемойККМ",ЗаводскойНомерККМ);
	Рез=Запрос.Выполнить();
	Если рез.Пустой()=Ложь Тогда
		Выб=Рез.Выбрать();
		Выб.Следующий();
		Розыск=Выб.Ссылка.ПолучитьОбъект();
		Розыск.ДатаОбнаружения=ТекущаяДата();
		Розыск.Аптека=Склад;
		Розыск.Записать();
	КонецЕсли;	

КонецПроцедуры







