
Процедура ПриЗаписи(Отказ)
	
	//Товар=ТоварФирмы.ПолучитьОбъект();
	//Товар.ЕстьСвязкаСПоставщиком=Истина;
	//Товар.Записать();
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//|	isnull(СУММА(1),0) КАК ЕстьЕщеСвязок
	//|ИЗ
	//|	Справочник.СвязкиТовараСПоставщиком КАК СвязкиТовараСПоставщиком
	//|ГДЕ
	//|	СвязкиТовараСПоставщиком.ТоварФирмы = &ТоварФирмы
	//|	И СвязкиТовараСПоставщиком.Ссылка <> &Ссылка");	
	//
	//Запрос.УстановитьПараметр("ТоварФирмы",ТоварФирмы);
	//Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	//
	//Если Запрос.Выполнить().Выгрузить().Получить(0).ЕстьЕщеСвязок=0 тогда // это последняя связка и она удаляется
	//	Товар=ТоварФирмы.ПолучитьОбъект();
	//	Товар.ЕстьСвязкаСПоставщиком=Ложь;
	//	Товар.Записать();
	//КонецЕсли;
	
	
	
КонецПроцедуры
