Процедура ОчиститьКорзину(НомерКорзины) Экспорт
	
	//---------------<Чистим корзину и все поля на форме>---------------------------// GtG // 29.08.2012 19:36:28
	МенЗап=РегистрыСведений.Корзина.СоздатьНаборЗаписей();
	МенЗап.Отбор["Пользователь"].Установить(ПараметрыСеанса.ТекущийСотр,Истина);
	МенЗап.Отбор["НомерКорзины"].Установить(НомерКорзины,Истина);

    МенЗап.Прочитать();
	МенЗап.Очистить();
	МенЗап.Записать();
КонецПроцедуры

Процедура ДобавитьВКорзину(Склад,Товар,Цена,Количество,ЕИТ,НомерКорзины) Экспорт
	
	МЗ=РегистрыСведений.Корзина.СоздатьМенеджерЗаписи();
	
	МЗ.Пользователь=ПараметрыСеанса.ТекущийСотр;
	МЗ.Склад=Склад;
	МЗ.Товар=Товар;
	МЗ.Цена =Цена;
	МЗ.ЕИТ=ЕИТ;
	МЗ.НомерКорзины=НомерКорзины;
	
	МЗ.Прочитать();
	
	Если МЗ.Выбран()=Истина Тогда // Уже есть запись с такими парамтрами
		// Складываем количество в результирующей
		НовоеКолво=МЗ.Количество+Количество;
	Иначе	
		НовоеКолво=Количество;
	КонецЕсли;
	
	//---------------<Записываем>---------------------------// GtG // 31.08.2012 10:57:46
	
	МЗ.Пользователь=ПараметрыСеанса.ТекущийСотр;
	МЗ.Склад=Склад;
	МЗ.Товар=Товар;
	МЗ.Цена =Цена;
	МЗ.ЕИТ=ЕИТ;
	МЗ.НомерКорзины=НомерКорзины;
    МЗ.Количество=НовоеКолво;
	МЗ.ПроцентСкидки=0; // НЕХ, ибо скидку даем в корзине при окончаельном оформлении заказа
	МЗ.СуммаБезСкидки=Цена* НовоеКолво ;
	МЗ.СуммаСкидки   =0;
	МЗ.СуммаСоСкидкой =МЗ.СуммаБезСкидки;
	
	МЗ.Записать();
	
КонецПроцедуры	


Функция МО_ТекстЗапросаПолученияОстатков_Старый(ВнешнийВызов=ложь, ПоказыватьДатуПоследнейПоставки=ложь) Экспорт
	  
	ЗапросПоОстаткамТоваров_Текст=  "ВЫБРАТЬ
								|	ТСписокТоваров.Код как ТоварКод,
                                |	ТСписокТоваров.Товар,
                                |	ТСписокТоваров.Количество
                                |ПОМЕСТИТЬ ТСписокТоваров
                                |ИЗ
                                |	&ТСписокТоваров КАК ТСписокТоваров
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	МестаХранения.Ссылка КАК Ссылка,
                                |	МестаХранения.Метро КАК Метро,
                                |	МестаХранения.Бренд КАК Бренд,
                                |	МестаХранения.ОсуществляетДоставкуКлиенту,
                                |	МестаХранения.ОсуществляетБронирование,
                                |	МестаХранения.ТелефонДляСправки,
                                |	МестаХранения.РежимРаботы
                                |ПОМЕСТИТЬ ТоргующиеАптеки
                                |ИЗ
                                |	Справочник.МестаХранения КАК МестаХранения
                                |ГДЕ
                                |	МестаХранения.СторонаДоговораКомиссии <> ЗНАЧЕНИЕ(Перечисление.СтороныДоговораКомиссии.Комитент)
                                |	И ВЫБОР
                                |			КОГДА &ОсуществляетДоставкуКлиенту = ЛОЖЬ
                                |				ТОГДА МестаХранения.ОсуществляетДоставкуКлиенту
                                |			ИНАЧЕ &ОсуществляетДоставкуКлиенту
                                |		КОНЕЦ = МестаХранения.ОсуществляетДоставкуКлиенту
                                |	И МестаХранения.ПометкаУдаления = ЛОЖЬ
                                |	И (МестаХранения.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                                |			ИЛИ МестаХранения.ДатаЗакрытия > &ТекущаяДата)
                                |	И МестаХранения.ДатаПерехода < &ТекущаяДата
                                |	И ВЫБОР
                                |			КОГДА &БронированиеПоАптеке = ИСТИНА
                                |				ТОГДА &АптекаБронирования
                                |			ИНАЧЕ МестаХранения.Ссылка
                                |		КОНЕЦ = МестаХранения.Ссылка
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Ссылка,
                                |	Бренд,
                                |	Метро
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	ГруппировкаБрендовДляСССписокБрендовГруппировки.Бренд КАК Бренд
                                |ПОМЕСТИТЬ ВыбраннаяГруппировкаБрендов
                                |ИЗ
                                |	Справочник.ГруппировкаБрендовДляСС.СписокБрендовГруппировки КАК ГруппировкаБрендовДляСССписокБрендовГруппировки
                                |ГДЕ
                                |	ГруппировкаБрендовДляСССписокБрендовГруппировки.Ссылка = &ГруппировкаБрендов
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Бренд
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ РАЗЛИЧНЫЕ
                                |	ТоргующиеАптеки.Ссылка,
                                |	ВЫБОР
                                |		КОГДА ВыбраннаяГруппировкаБрендов.Бренд ЕСТЬ NULL 
                                |			ТОГДА 0
                                |		ИНАЧЕ 1
                                |	КОНЕЦ КАК Подходит,
                                |	ТоргующиеАптеки.Метро,
                                |	ТоргующиеАптеки.ОсуществляетДоставкуКлиенту,
                                |	ТоргующиеАптеки.ОсуществляетБронирование,
                                |	ТоргующиеАптеки.ТелефонДляСправки,
                                |	ТоргующиеАптеки.РежимРаботы
                                |ПОМЕСТИТЬ АптекиПоБрендуАС
                                |ИЗ
                                |	ТоргующиеАптеки КАК ТоргующиеАптеки
                                |		ЛЕВОЕ СОЕДИНЕНИЕ ВыбраннаяГруппировкаБрендов КАК ВыбраннаяГруппировкаБрендов
                                |		ПО ТоргующиеАптеки.Ссылка.Бренд = ВыбраннаяГруппировкаБрендов.Бренд
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	СУММА(АптекиПоБрендуАС.Подходит) КАК Подходит
                                |ПОМЕСТИТЬ АптекПоБренду
                                |ИЗ
                                |	АптекиПоБрендуАС КАК АптекиПоБрендуАС
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	АптекиПоБрендуАС.Ссылка КАК Аптека,
                                |	АптекиПоБрендуАС.Метро КАК Метро,
                                |	АптекиПоБрендуАС.ОсуществляетДоставкуКлиенту,
                                |	АптекиПоБрендуАС.ОсуществляетБронирование,
                                |	АптекиПоБрендуАС.ТелефонДляСправки,
                                |	АптекиПоБрендуАС.РежимРаботы
                                |ПОМЕСТИТЬ Аптеки_ОтфильтрованныеПоБрендуАС
                                |ИЗ
                                |	АптекиПоБрендуАС КАК АптекиПоБрендуАС,
                                |	АптекПоБренду КАК АптекПоБренду
                                |ГДЕ
                                |	ВЫБОР
                                |			КОГДА АптекПоБренду.Подходит = 0
                                |				ТОГДА 1
                                |			ИНАЧЕ АптекиПоБрендуАС.Подходит
                                |		КОНЕЦ = 1
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Аптека,
                                |	Метро
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ТоргующиеАптеки
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ВыбраннаяГруппировкаБрендов
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ АптекиПоБрендуАС
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ АптекПоБренду
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	МетроПоМаршрутизатору.Метро КАК Метро,
                                |	МетроПоМаршрутизатору.УдаленностьОтКлиента
                                |ПОМЕСТИТЬ МетроФильтр
                                |ИЗ
                                |	&МетроПоМаршрутизатору КАК МетроПоМаршрутизатору
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Метро
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	СУММА(1) КАК ВыбраноСтанций
                                |ПОМЕСТИТЬ СтанцийВФильтреПоМетро
                                |ИЗ
                                |	МетроФильтр КАК МетроФильтр
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
								|	АПБ_КФСМ.Аптека.Код КАК КодСклада,
                                |	АПБ_КФСМ.Аптека КАК Аптека,
                                |	АПБ_КФСМ.Метро КАК Метро,
                                |	ВЫБОР
                                |		КОГДА МетроФильтр.Метро ЕСТЬ NULL 
                                |			ТОГДА 0
                                |		ИНАЧЕ МетроФильтр.УдаленностьОтКлиента
                                |	КОНЕЦ КАК УдаленностьОтКлиента,
                                |	АПБ_КФСМ.ОсуществляетДоставкуКлиенту,
                                |	АПБ_КФСМ.ОсуществляетБронирование,
                                |	АПБ_КФСМ.ТелефонДляСправки,
                                |	АПБ_КФСМ.РежимРаботы
                                |ПОМЕСТИТЬ Аптеки
                                |ИЗ
                                |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.Аптека КАК Аптека,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.Метро КАК Метро,
                                |		СтанцийВФильтреПоМетро.ВыбраноСтанций КАК ВыбраноСтанций,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.ОсуществляетДоставкуКлиенту КАК ОсуществляетДоставкуКлиенту,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.ОсуществляетБронирование КАК ОсуществляетБронирование,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.ТелефонДляСправки КАК ТелефонДляСправки,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.РежимРаботы КАК РежимРаботы
                                |	ИЗ
                                |		Аптеки_ОтфильтрованныеПоБрендуАС КАК Аптеки_ОтфильтрованныеПоБрендуАС,
                                |		СтанцийВФильтреПоМетро КАК СтанцийВФильтреПоМетро) КАК АПБ_КФСМ
                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МетроФильтр КАК МетроФильтр
                                |		ПО (ВЫБОР
                                |				КОГДА АПБ_КФСМ.ВыбраноСтанций = 0
                                |					ТОГДА АПБ_КФСМ.Метро
                                |				ИНАЧЕ МетроФильтр.Метро
                                |			КОНЕЦ = АПБ_КФСМ.Метро)
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Аптека,
                                |	Метро
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ Аптеки_ОтфильтрованныеПоБрендуАС
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ МетроФильтр
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ СтанцийВФильтреПоМетро
                                |;
                                |
								|////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|	ПродажиСменККМОбороты.ТоварКод как КодТовара,
								|	ПродажиСменККМОбороты.СкладКод как КодСклада,
								|	ПродажиСменККМОбороты.ПартияКод как КодПартии,
								|	СУММА(ПродажиСменККМОбороты.КоличествоОборот) КАК КолвоОборот
								|ПОМЕСТИТЬ НепроведенныеЧеки
								|ИЗ
								|	РегистрНакопления.УЗ_ПродажиСменККМ.Обороты(
								|			,
								|			,
								|			,
								|			ТоварКод В (&СписокКодовТоваров)
								|				И СкладКод В
								|					(ВЫБРАТЬ
								|						А.КодСклада
								|					ИЗ
								|						Аптеки КАК А)) КАК ПродажиСменККМОбороты
								|
								|СГРУППИРОВАТЬ ПО
								|	ПродажиСменККМОбороты.ПартияКод,
								|	ПродажиСменККМОбороты.СкладКод,
								|	ПродажиСменККМОбороты.ТоварКод
								|;
								|
								|////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ РАЗЛИЧНЫЕ
								|	ПартииЖНВЛСОбороты.ТоварКод как КодТовара,
								|	ПартииЖНВЛСОбороты.СкладКод как КодСклада,
								|	ПартииЖНВЛСОбороты.ПартияКод как КодПартии
								|ПОМЕСТИТЬ НеоприходованныеПартии
								|ИЗ
								|	РегистрНакопления.УЗ_Партии.Обороты(
								|			ДобавитьКДате(&ТекущаяДата, Месяц, -1),
								|			&ТекущаяДата,
								|			Регистратор,
								|			ТоварКод В (&СписокКодовТоваров)
								|				И СкладКод В
								|					(ВЫБРАТЬ
								|						А.КодСклада
								|					ИЗ
								|						Аптеки КАК А)) КАК ПартииЖНВЛСОбороты
								|ГДЕ
								|	ПартииЖНВЛСОбороты.Регистратор ССЫЛКА Документ.УЗ_ПоступлениеТовара
								|	И ВЫРАЗИТЬ(ПартииЖНВЛСОбороты.Регистратор КАК Документ.УЗ_ПоступлениеТовара).ДатаФактПоступления = ДАТАВРЕМЯ(1, 1, 1)
								|; 		
								|
								|////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|	Аптеки.Аптека,
                                |	Аптеки.Метро,
                                |	Аптеки.УдаленностьОтКлиента,
                                |	РегПартии.ТоварКод,
								|	РегПартии.СкладКод,
								|	РегПартии.ПартияКод,
								|	ВЫБОР
								|		КОГДА РегПартии.КоличествоОстаток - ЕСТЬNULL(НепроведенныеЧеки.КолвоОборот, 0) < 0
								|			ТОГДА 0
								|		ИНАЧЕ РегПартии.КоличествоОстаток - ЕСТЬNULL(НепроведенныеЧеки.КолвоОборот, 0)
								|	КОНЕЦ КАК КолвоОстаток,								
								|	Выразить(РегПартии.СуммаЗакупБезНДСОстаток*(1 + РегПартии.СтавкаНДСЗакуп/100) КаК Число(12,2)) как СуммаЗакуп,
								|	1 КАК ИсточникДанных,
                                |	Аптеки.ОсуществляетДоставкуКлиенту,
                                |	Аптеки.ОсуществляетБронирование,
                                |	Аптеки.ТелефонДляСправки,
                                |	Аптеки.РежимРаботы
                                |ПОМЕСТИТЬ ПоОстаткам
                                |ИЗ
                                |	РегистрНакопления.УЗ_Партии.Остатки(
                                |			,
                                |			ТоварКод В (&СписокКодовТоваров)
                                |				И СкладКод В
                                |					(ВЫБРАТЬ
                                |						А.КодСклада
                                |					ИЗ
                                |						Аптеки КАК А)) КАК РегПартии
								|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Аптеки КАК Аптеки
								|		ПО РегПартии.СкладКод = Аптеки.КодСклада
								|		ЛЕВОЕ СОЕДИНЕНИЕ НепроведенныеЧеки КАК НепроведенныеЧеки
								|		ПО РегПартии.ТоварКод = НепроведенныеЧеки.КодТовара
								|			И РегПартии.СкладКод = НепроведенныеЧеки.КодСклада
								|			И РегПартии.ПартияКод = НепроведенныеЧеки.КодПартии
								|		ЛЕВОЕ СОЕДИНЕНИЕ НеоприходованныеПартии КАК НеоприходованныеПартии
								|		ПО РегПартии.ТоварКод = НеоприходованныеПартии.КодТовара
								|			И РегПартии.СкладКод = НеоприходованныеПартии.КодСклада
								|			И РегПартии.ПартияКод = НеоприходованныеПартии.КодПартии
								|ГДЕ
								|	РегПартии.КоличествоОстаток - ЕСТЬNULL(НепроведенныеЧеки.КолвоОборот, 0) > 0 								
								|	И НеоприходованныеПартии.КодПартии ЕСТЬ NULL
								|;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ НепроведенныеЧеки
                                |;
								|
								|////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ НеоприходованныеПартии
                                |;
								|
								|////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|		БлокТоваровДляСС.ТоварКод,
								|		БлокТоваровДляСС.ПартияКод,
								|		БлокТоваровДляСС.СкладКод
								|   Into БлокированныйТоварПоАптекам
								|	ИЗ
								|		РегистрСведений.ВременнаяБлокировкаТоваровДляСС КАК БлокТоваровДляСС
								|	ГДЕ
								|		НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) МЕЖДУ БлокТоваровДляСС.НачалоБлокировки И БлокТоваровДляСС.КонецБлокировки
								|		И БлокТоваровДляСС.ТоварКод В(&СписокКодовТоваров)
								|;
								|////////////////////////////////////////////////////////////////////////////////
								|	ВЫБРАТЬ
								|		ПоОстаткам.Аптека КАК Аптека,
								|		ПоОстаткам.Метро КАК Метро,
								|		ПоОстаткам.УдаленностьОтКлиента КАК УдаленностьОтКлиента,
                                |		ПоОстаткам.ТоварКод,
                                |		ПоОстаткам.ПартияКод,
                                |		ПоОстаткам.КолвоОстаток КАК Количество,
                                |		ПоОстаткам.СуммаЗакуп,
                                |		ПоОстаткам.ИсточникДанных КАК ИсточникДанных,
                                |		ПоОстаткам.ОсуществляетДоставкуКлиенту КАК ОсуществляетДоставкуКлиенту,
                                |		ПоОстаткам.ОсуществляетБронирование КАК ОсуществляетБронирование,
                                |		ПоОстаткам.ТелефонДляСправки КАК ТелефонДляСправки,
                                |		ПоОстаткам.РежимРаботы КАК РежимРаботы
								|       ПОМЕСТИТЬ ВТТовар                           
                                |	ИЗ
                                |		ПоОстаткам КАК ПоОстаткам 
								|      левое соединение  
								|       БлокированныйТоварПоАптекам как БлокированныйТоварПоАптекам
								|       on  ПоОстаткам.СкладКод=БлокированныйТоварПоАптекам.СкладКод 
								|       and ПоОстаткам.ТоварКод=БлокированныйТоварПоАптекам.ТоварКод
								|       and ПоОстаткам.ПартияКод=БлокированныйТоварПоАптекам.ПартияКод
								|   where
								|        БлокированныйТоварПоАптекам.ТоварКод is null 
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	АптекиСКолвомТовара.Аптека,
                                |	АптекиСКолвомТовара.ТоварКод
                                |ПОМЕСТИТЬ ФильтрПоКолвуОстаткаПоСпискуТоваров
                                |ИЗ
                                |	(ВЫБРАТЬ
                                |		ВТТовар.Аптека КАК Аптека,
                                |		ВТТовар.ТоварКод,
                                |		СУММА(ВТТовар.Количество) КАК Количество
                                |	ИЗ
                                |		ВТТовар КАК ВТТовар
                                |	
                                |	СГРУППИРОВАТЬ ПО
                                |		ВТТовар.Аптека,
                                |		ВТТовар.ТоварКод) КАК АптекиСКолвомТовара
                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТСписокТоваров КАК ТСписокТоваров
                                |		ПО АптекиСКолвомТовара.ТоварКод = ТСписокТоваров.ТоварКод
                                |ГДЕ
                                |	АптекиСКолвомТовара.Количество >= ТСписокТоваров.Количество
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
								|	ВТТовар.Аптека.Код как КодАптеки,
                                |	ВТТовар.Аптека"+?(ВнешнийВызов=Истина,".Код","")+" как Аптека,
                                |	ВТТовар.Метро"+?(ВнешнийВызов=Истина,".Код","")+" как Метро,
                                |	ВТТовар.УдаленностьОтКлиента как УдаленностьОтКлиента,
                                |	ВТТовар.ТоварКод,
                                |	ВТТовар.ПартияКод,
                                |	ВТТовар.Количество,
                                |	ВТТовар.СуммаЗакуп,
                                |	ВТТовар.ИсточникДанных,
                                |	ВТТовар.ОсуществляетДоставкуКлиенту,
                                |	ВТТовар.ОсуществляетБронирование,
                                |	ВТТовар.ТелефонДляСправки,
                                |	ВТТовар.РежимРаботы.наименование как РежимРаботы
                                |ПОМЕСТИТЬ ВтТовар1
                                |ИЗ
                                |	ВТТовар КАК ВТТовар
                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФильтрПоКолвуОстаткаПоСпискуТоваров КАК ФильтрПоКолвуОстаткаПоСпискуТоваров
                                |		ПО ВТТовар.Аптека = ФильтрПоКолвуОстаткаПоСпискуТоваров.Аптека
                                |			И ВТТовар.ТоварКод = ФильтрПоКолвуОстаткаПоСпискуТоваров.ТоварКод
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ВТТовар
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	ВтТовар1.Аптека,
                                |	ВтТовар1.ТоварКод,
                                |	СУММА(ВтТовар1.Количество) КАК Количество
                                |ПОМЕСТИТЬ ФильтрПоМинОстатку
                                |ИЗ
                                |	ВтТовар1 КАК ВтТовар1
                                |
                                |СГРУППИРОВАТЬ ПО
                                |	ВтТовар1.Аптека,
                                |	ВтТовар1.ТоварКод
                                |
                                |ИМЕЮЩИЕ
                                |	СУММА(ВтТовар1.Количество) >= &МинОстаток
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	КолваНаименованийПоАптекам.Аптека
                                |ПОМЕСТИТЬ ДопФильтрНаСписокТоваровПоАптекам
                                |ИЗ
                                |	(ВЫБРАТЬ
                                |		ВтТовар1.Аптека КАК Аптека,
                                |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтТовар1.ТоварКод) КАК КолвоНаименованийПоАптеке
                                |	ИЗ
                                |		ВтТовар1 КАК ВтТовар1
                                |	
                                |	СГРУППИРОВАТЬ ПО
                                |		ВтТовар1.Аптека) КАК КолваНаименованийПоАптекам,
                                |	(ВЫБРАТЬ
                                |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АССОРТИМЕНТНЫЙ_ПЛАН.Код) КАК КолвоНаименованийВСписке
                                |	ИЗ
                                |		Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
                                |	ГДЕ
                                |		АССОРТИМЕНТНЫЙ_ПЛАН.Код В(&СписокКодовТоваров)) КАК РазмерСпискаТоваров
                                |ГДЕ
                                |	КолваНаименованийПоАптекам.КолвоНаименованийПоАптеке = РазмерСпискаТоваров.КолвоНаименованийВСписке
								|;
								|"
								+ ?(ПоказыватьДатуПоследнейПоставки,
								"////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|	ПартииЖНВЛСОбороты.ТоварКод,
								|	ПартииЖНВЛСОбороты.СкладКод,
								|	МАКСИМУМ(ПартииЖНВЛСОбороты.Период) КАК Период
								|ПОМЕСТИТЬ ПоследниеПоступления
								|ИЗ
								|	РегистрНакопления.УЗ_Партии.Обороты(
								|			ДобавитьКДате(&ТекущаяДата, МЕСЯЦ, -1),
								|			&ТекущаяДата,
								|			Регистратор,
								|			ТоварКод В (&СписокКодовТоваров)
								|				И СкладКод В
								|					(ВЫБРАТЬ
								|						А.КодСклада
								|					ИЗ
								|						Аптеки КАК А)) КАК ПартииЖНВЛСОбороты
								|ГДЕ
								|	ПартииЖНВЛСОбороты.Регистратор ССЫЛКА Документ.УЗ_ПоступлениеТовара
								|
								|СГРУППИРОВАТЬ ПО
								|	ПартииЖНВЛСОбороты.ТоварКод,
								|	ПартииЖНВЛСОбороты.СкладКод
								|;
								|", "") + 
								"////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|	ВтТовар1.КодАптеки КАК КодАптеки,
                                |	ВтТовар1.Аптека КАК Аптека,
                                |	ВтТовар1.Метро,
                                |	ВЫБОР
                                |		КОГДА ВтТовар1.ИсточникДанных = 1
                                |			ТОГДА ВтТовар1.Количество / Партии.К
                                |		ИНАЧЕ 0
                                |	КОНЕЦ КАК Остаток,
                                |	ЕСТЬNULL(РЦП.Цена, ЕСТЬNULL(РЦ.Цена,0))/Партии.К КАК Цена,
                                |	АП.ЕдиницаПоУмолчанию"+?(ВнешнийВызов=Истина,".наименование","")+" КАК ЕИТ,
                                |	ВтТовар1.ТелефонДляСправки,
                                |	ВтТовар1.РежимРаботы,
                                |	ВЫРАЗИТЬ(ВтТовар1.СуммаЗакуп / ВтТовар1.Количество * Партии.К * 1.04 КАК ЧИСЛО(10, 1)) КАК Мин_Розн_Цена,
                                |	АП.Коэффициент КАК К,
                                |	ВтТовар1.ОсуществляетДоставкуКлиенту КАК Доставка,
                                |	ВтТовар1.ОсуществляетБронирование КАК ОсуществляетБронирование,
                                |	ВтТовар1.УдаленностьОтКлиента КАК УдаленностьОтКлиента,
								|	ВтТовар1.ПартияКод,
								|	Партии.СрокГодности,
                                |	Партии.Производитель"+?(ВнешнийВызов=Истина,".Наименование","")+" КАК Производитель,"
								+ ?(ПоказыватьДатуПоследнейПоставки, "ЕстьNull(ПоследниеПоступления.Период, Партии.ДатаПоступления) КАК ПоследняяПоставка,", "") +
								"АП."+?(ВнешнийВызов=Истина,"Код","Ссылка")+" КАК Товар 								
                                |ИЗ
                                |	ВтТовар1 КАК ВтТовар1
                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФильтрПоМинОстатку КАК ФильтрПоМинОстатку
                                |		ПО ВтТовар1.Аптека = ФильтрПоМинОстатку.Аптека
                                |			И ВтТовар1.ТоварКод = ФильтрПоМинОстатку.ТоварКод"
								+ ?(ПоказыватьДатуПоследнейПоставки, " ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеПоступления КАК ПоследниеПоступления ПО ВтТовар1.Аптека = ПоследниеПоступления.Склад И ВтТовар1.ТоварКод = ПоследниеПоступления.ТоварКод ", " ") +
                                "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопФильтрНаСписокТоваровПоАптекам КАК ДопФильтрНаСписокТоваровПоАптекам
                                |		ПО ВтТовар1.Аптека = ДопФильтрНаСписокТоваровПоАптекам.Аптека
								|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УЗ_Партии как Партии по Партии.Код = ВтТовар1.ПартияКод
                                |ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ассортиментный_план как АП по АП.Код = ВтТовар1.ТоварКод
								|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РозничныеЦены как РЦ по РЦ.АптекаКод = ВтТовар1.КодАптеки и  РЦ.ТоварКод = ВтТовар1.ТоварКод
								|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РозничныеЦеныПоПартиям как РЦП по РЦП.АптекаКод = ВтТовар1.КодАптеки и  РЦП.ПартияКод = ВтТовар1.ПартияКод и  РЦП.ТоварКод = ВтТовар1.ТоварКод

                                |УПОРЯДОЧИТЬ ПО
                                |	Товар,
                                |	УдаленностьОтКлиента,
                                |	Аптека,
                                |	Цена
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ Аптеки
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ДопФильтрНаСписокТоваровПоАптекам
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ПоОстаткам
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ФильтрПоМинОстатку";
								
								
	Возврат ЗапросПоОстаткамТоваров_Текст;
	
КонецФункции	


Функция МО_ТекстЗапросаПолученияОстатков(ВнешнийВызов=ложь, ПоказыватьДатуПоследнейПоставки=ложь) Экспорт
	  
	ЗапросПоОстаткамТоваров_Текст=  "ВЫБРАТЬ
								|	ТСписокТоваров.Код как ТоварКод,
                                |	ТСписокТоваров.Товар,
                                |	ТСписокТоваров.Количество
                                |ПОМЕСТИТЬ ТСписокТоваров
                                |ИЗ
                                |	&ТСписокТоваров КАК ТСписокТоваров
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	МестаХранения.Ссылка КАК Ссылка,
                                |	МестаХранения.Метро КАК Метро,
                                |	МестаХранения.Бренд КАК Бренд,
								|	МестаХранения.СубъектРФ КАК СубъектРФ,
                                |	МестаХранения.ОсуществляетДоставкуКлиенту,
                                |	МестаХранения.ОсуществляетБронирование,
                                |	МестаХранения.ТелефонДляСправки,
                                |	МестаХранения.РежимРаботы
                                |ПОМЕСТИТЬ ТоргующиеАптеки
                                |ИЗ
                                |	Справочник.МестаХранения КАК МестаХранения
                                |ГДЕ
                                |	МестаХранения.СторонаДоговораКомиссии <> ЗНАЧЕНИЕ(Перечисление.СтороныДоговораКомиссии.Комитент)
                                |	И ВЫБОР
                                |			КОГДА &ОсуществляетДоставкуКлиенту = ЛОЖЬ
                                |				ТОГДА МестаХранения.ОсуществляетДоставкуКлиенту
                                |			ИНАЧЕ &ОсуществляетДоставкуКлиенту
                                |		КОНЕЦ = МестаХранения.ОсуществляетДоставкуКлиенту
                                |	И МестаХранения.ПометкаУдаления = ЛОЖЬ
                                |	И (МестаХранения.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                                |			ИЛИ МестаХранения.ДатаЗакрытия > &ТекущаяДата)
                                |	И МестаХранения.ДатаПерехода < &ТекущаяДата
                                |	И ВЫБОР
                                |			КОГДА &БронированиеПоАптеке = ИСТИНА
                                |				ТОГДА &АптекаБронирования
                                |			ИНАЧЕ МестаХранения.Ссылка
                                |		КОНЕЦ = МестаХранения.Ссылка
								|	И (&ВсеСубъектыРФ ИЛИ МестаХранения.СубъектРФ В (&СубъектыРФ))
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Ссылка,
                                |	Бренд,
                                |	Метро
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	ГруппировкаБрендовДляСССписокБрендовГруппировки.Бренд КАК Бренд
                                |ПОМЕСТИТЬ ВыбраннаяГруппировкаБрендов
                                |ИЗ
                                |	Справочник.ГруппировкаБрендовДляСС.СписокБрендовГруппировки КАК ГруппировкаБрендовДляСССписокБрендовГруппировки
                                |ГДЕ
                                |	ГруппировкаБрендовДляСССписокБрендовГруппировки.Ссылка = &ГруппировкаБрендов
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Бренд
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ РАЗЛИЧНЫЕ
                                |	ТоргующиеАптеки.Ссылка,
                                |	ВЫБОР
                                |		КОГДА ВыбраннаяГруппировкаБрендов.Бренд ЕСТЬ NULL 
                                |			ТОГДА 0
                                |		ИНАЧЕ 1
                                |	КОНЕЦ КАК Подходит,
                                |	ТоргующиеАптеки.Метро,
								|	ТоргующиеАптеки.СубъектРФ,
                                |	ТоргующиеАптеки.ОсуществляетДоставкуКлиенту,
                                |	ТоргующиеАптеки.ОсуществляетБронирование,
                                |	ТоргующиеАптеки.ТелефонДляСправки,
                                |	ТоргующиеАптеки.РежимРаботы
                                |ПОМЕСТИТЬ АптекиПоБрендуАС
                                |ИЗ
                                |	ТоргующиеАптеки КАК ТоргующиеАптеки
                                |		ЛЕВОЕ СОЕДИНЕНИЕ ВыбраннаяГруппировкаБрендов КАК ВыбраннаяГруппировкаБрендов
                                |		ПО ТоргующиеАптеки.Ссылка.Бренд = ВыбраннаяГруппировкаБрендов.Бренд
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	СУММА(АптекиПоБрендуАС.Подходит) КАК Подходит
                                |ПОМЕСТИТЬ АптекПоБренду
                                |ИЗ
                                |	АптекиПоБрендуАС КАК АптекиПоБрендуАС
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	АптекиПоБрендуАС.Ссылка КАК Аптека,
                                |	АптекиПоБрендуАС.Метро КАК Метро,
								|	АптекиПоБрендуАС.СубъектРФ КАК СубъектРФ,
                                |	АптекиПоБрендуАС.ОсуществляетДоставкуКлиенту,
                                |	АптекиПоБрендуАС.ОсуществляетБронирование,
                                |	АптекиПоБрендуАС.ТелефонДляСправки,
                                |	АптекиПоБрендуАС.РежимРаботы
                                |ПОМЕСТИТЬ Аптеки_ОтфильтрованныеПоБрендуАС
                                |ИЗ
                                |	АптекиПоБрендуАС КАК АптекиПоБрендуАС,
                                |	АптекПоБренду КАК АптекПоБренду
                                |ГДЕ
                                |	ВЫБОР
                                |			КОГДА АптекПоБренду.Подходит = 0
                                |				ТОГДА 1
                                |			ИНАЧЕ АптекиПоБрендуАС.Подходит
                                |		КОНЕЦ = 1
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Аптека,
                                |	Метро
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ТоргующиеАптеки
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ВыбраннаяГруппировкаБрендов
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ АптекиПоБрендуАС
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ АптекПоБренду
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	МетроПоМаршрутизатору.Метро КАК Метро,
                                |	МетроПоМаршрутизатору.УдаленностьОтКлиента
                                |ПОМЕСТИТЬ МетроФильтр
                                |ИЗ
                                |	&МетроПоМаршрутизатору КАК МетроПоМаршрутизатору
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Метро
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	СУММА(1) КАК ВыбраноСтанций
                                |ПОМЕСТИТЬ СтанцийВФильтреПоМетро
                                |ИЗ
                                |	МетроФильтр КАК МетроФильтр
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
								|	АПБ_КФСМ.Аптека.Код КАК КодСклада,
                                |	АПБ_КФСМ.Аптека КАК Аптека,
                                |	АПБ_КФСМ.Метро КАК Метро,
								|	АПБ_КФСМ.СубъектРФ КАК СубъектРФ,
                                |	ВЫБОР
                                |		КОГДА МетроФильтр.Метро ЕСТЬ NULL 
                                |			ТОГДА 0
                                |		ИНАЧЕ МетроФильтр.УдаленностьОтКлиента
                                |	КОНЕЦ КАК УдаленностьОтКлиента,
                                |	АПБ_КФСМ.ОсуществляетДоставкуКлиенту,
                                |	АПБ_КФСМ.ОсуществляетБронирование,
                                |	АПБ_КФСМ.ТелефонДляСправки,
                                |	АПБ_КФСМ.РежимРаботы
                                |ПОМЕСТИТЬ Аптеки
                                |ИЗ
                                |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.Аптека КАК Аптека,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.Метро КАК Метро,
								|		Аптеки_ОтфильтрованныеПоБрендуАС.СубъектРФ КАК СубъектРФ,
                                |		СтанцийВФильтреПоМетро.ВыбраноСтанций КАК ВыбраноСтанций,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.ОсуществляетДоставкуКлиенту КАК ОсуществляетДоставкуКлиенту,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.ОсуществляетБронирование КАК ОсуществляетБронирование,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.ТелефонДляСправки КАК ТелефонДляСправки,
                                |		Аптеки_ОтфильтрованныеПоБрендуАС.РежимРаботы КАК РежимРаботы
                                |	ИЗ
                                |		Аптеки_ОтфильтрованныеПоБрендуАС КАК Аптеки_ОтфильтрованныеПоБрендуАС,
                                |		СтанцийВФильтреПоМетро КАК СтанцийВФильтреПоМетро) КАК АПБ_КФСМ
                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МетроФильтр КАК МетроФильтр
                                |		ПО (ВЫБОР
                                |				КОГДА АПБ_КФСМ.ВыбраноСтанций = 0
                                |					ТОГДА АПБ_КФСМ.Метро
                                |				ИНАЧЕ МетроФильтр.Метро
                                |			КОНЕЦ = АПБ_КФСМ.Метро)
                                |
                                |ИНДЕКСИРОВАТЬ ПО
                                |	Аптека,
                                |	Метро
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ Аптеки_ОтфильтрованныеПоБрендуАС
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ МетроФильтр
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ СтанцийВФильтреПоМетро
                                |;
                                |
								|////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|	ПродажиСменККМОбороты.ТоварКод как КодТовара,
								|	ПродажиСменККМОбороты.СкладКод как КодСклада,
								|	ПродажиСменККМОбороты.ПартияКод как КодПартии,
								|	СУММА(ПродажиСменККМОбороты.КоличествоОборот) КАК КолвоОборот
								|ПОМЕСТИТЬ НепроведенныеЧеки
								|ИЗ
								|	РегистрНакопления.УЗ_ПродажиСменККМ.Обороты(
								|			,
								|			,
								|			,
								|			ТоварКод В (&СписокКодовТоваров)
								|				И СкладКод В
								|					(ВЫБРАТЬ
								|						А.КодСклада
								|					ИЗ
								|						Аптеки КАК А)) КАК ПродажиСменККМОбороты
								|
								|СГРУППИРОВАТЬ ПО
								|	ПродажиСменККМОбороты.ПартияКод,
								|	ПродажиСменККМОбороты.СкладКод,
								|	ПродажиСменККМОбороты.ТоварКод
								|;
								|
								|////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|	Аптеки.Аптека,
                                |	Аптеки.Метро,
								|	Аптеки.СубъектРФ,
                                |	Аптеки.УдаленностьОтКлиента,
                                |	РегПартии.ТоварКод,
								|	РегПартии.СкладКод,
								|	РегПартии.ПартияКод,
								|	ВЫБОР
								|		КОГДА РегПартии.КоличествоОстаток - ЕСТЬNULL(НепроведенныеЧеки.КолвоОборот, 0) < 0
								|			ТОГДА 0
								|		ИНАЧЕ РегПартии.КоличествоОстаток - ЕСТЬNULL(НепроведенныеЧеки.КолвоОборот, 0)
								|	КОНЕЦ КАК КолвоОстаток,								
								|	Выразить(РегПартии.СуммаЗакупБезНДСОстаток*(1 + РегПартии.СтавкаНДСЗакуп/100) КаК Число(12,2)) как СуммаЗакуп,
								|	1 КАК ИсточникДанных,
                                |	Аптеки.ОсуществляетДоставкуКлиенту,
                                |	Аптеки.ОсуществляетБронирование,
                                |	Аптеки.ТелефонДляСправки,
                                |	Аптеки.РежимРаботы
                                |ПОМЕСТИТЬ ПоОстаткам
                                |ИЗ
                                |	РегистрНакопления.УЗ_Партии.Остатки(
                                |			,
                                |			ТоварКод В (&СписокКодовТоваров)
                                |				И СкладКод В
                                |					(ВЫБРАТЬ
                                |						А.КодСклада
                                |					ИЗ
                                |						Аптеки КАК А)) КАК РегПартии
								|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Аптеки КАК Аптеки
								|		ПО РегПартии.СкладКод = Аптеки.КодСклада
								|		ЛЕВОЕ СОЕДИНЕНИЕ НепроведенныеЧеки КАК НепроведенныеЧеки
								|		ПО РегПартии.ТоварКод = НепроведенныеЧеки.КодТовара
								|			И РегПартии.СкладКод = НепроведенныеЧеки.КодСклада
								|			И РегПартии.ПартияКод = НепроведенныеЧеки.КодПартии
								|ГДЕ
								|	РегПартии.КоличествоОстаток - ЕСТЬNULL(НепроведенныеЧеки.КолвоОборот, 0) > 0 								
								|	
								|;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ НепроведенныеЧеки
                                |;
								|
								|
								|////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|		БлокТоваровДляСС.ТоварКод,
								|		БлокТоваровДляСС.ПартияКод,
								|		БлокТоваровДляСС.СкладКод
								|   Into БлокированныйТоварПоАптекам
								|	ИЗ
								|		РегистрСведений.ВременнаяБлокировкаТоваровДляСС КАК БлокТоваровДляСС
								|	ГДЕ
								|		НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) МЕЖДУ БлокТоваровДляСС.НачалоБлокировки И БлокТоваровДляСС.КонецБлокировки
								|		И БлокТоваровДляСС.ТоварКод В(&СписокКодовТоваров)
								|;
								|////////////////////////////////////////////////////////////////////////////////
								|	ВЫБРАТЬ
								|		ПоОстаткам.Аптека КАК Аптека,
								|		ПоОстаткам.Метро КАК Метро,
								|		ПоОстаткам.СубъектРФ КАК СубъектРФ,
								|		ПоОстаткам.УдаленностьОтКлиента КАК УдаленностьОтКлиента,
                                |		ПоОстаткам.ТоварКод,
                                |		ПоОстаткам.ПартияКод,
                                |		ПоОстаткам.КолвоОстаток КАК Количество,
                                |		ПоОстаткам.СуммаЗакуп,
                                |		ПоОстаткам.ИсточникДанных КАК ИсточникДанных,
                                |		ПоОстаткам.ОсуществляетДоставкуКлиенту КАК ОсуществляетДоставкуКлиенту,
                                |		ПоОстаткам.ОсуществляетБронирование КАК ОсуществляетБронирование,
                                |		ПоОстаткам.ТелефонДляСправки КАК ТелефонДляСправки,
                                |		ПоОстаткам.РежимРаботы КАК РежимРаботы
								|       ПОМЕСТИТЬ ВТТовар                           
                                |	ИЗ
                                |		ПоОстаткам КАК ПоОстаткам 
								|      левое соединение  
								|       БлокированныйТоварПоАптекам как БлокированныйТоварПоАптекам
								|       on  ПоОстаткам.СкладКод=БлокированныйТоварПоАптекам.СкладКод 
								|       and ПоОстаткам.ТоварКод=БлокированныйТоварПоАптекам.ТоварКод
								|       and ПоОстаткам.ПартияКод=БлокированныйТоварПоАптекам.ПартияКод
								|   where
								|        БлокированныйТоварПоАптекам.ТоварКод is null 
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	АптекиСКолвомТовара.Аптека,
                                |	АптекиСКолвомТовара.ТоварКод
                                |ПОМЕСТИТЬ ФильтрПоКолвуОстаткаПоСпискуТоваров
                                |ИЗ
                                |	(ВЫБРАТЬ
                                |		ВТТовар.Аптека КАК Аптека,
                                |		ВТТовар.ТоварКод,
                                |		СУММА(ВТТовар.Количество) КАК Количество
                                |	ИЗ
                                |		ВТТовар КАК ВТТовар
                                |	
                                |	СГРУППИРОВАТЬ ПО
                                |		ВТТовар.Аптека,
                                |		ВТТовар.ТоварКод) КАК АптекиСКолвомТовара
                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТСписокТоваров КАК ТСписокТоваров
                                |		ПО АптекиСКолвомТовара.ТоварКод = ТСписокТоваров.ТоварКод
                                |ГДЕ
                                |	АптекиСКолвомТовара.Количество >= ТСписокТоваров.Количество
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
								|	ВТТовар.Аптека.Код как КодАптеки,
                                |	ВТТовар.Аптека"+?(ВнешнийВызов=Истина,".Код","")+" как Аптека,
                                |	ВТТовар.Метро"+?(ВнешнийВызов=Истина,".Код","")+" как Метро,
								|	ВТТовар.СубъектРФ,
                                |	ВТТовар.УдаленностьОтКлиента как УдаленностьОтКлиента,
                                |	ВТТовар.ТоварКод,
                                |	ВТТовар.ПартияКод,
                                |	ВТТовар.Количество,
                                |	ВТТовар.СуммаЗакуп,
                                |	ВТТовар.ИсточникДанных,
                                |	ВТТовар.ОсуществляетДоставкуКлиенту,
                                |	ВТТовар.ОсуществляетБронирование,
                                |	ВТТовар.ТелефонДляСправки,
                                |	ВТТовар.РежимРаботы.наименование как РежимРаботы
                                |ПОМЕСТИТЬ ВтТовар1
                                |ИЗ
                                |	ВТТовар КАК ВТТовар
                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФильтрПоКолвуОстаткаПоСпискуТоваров КАК ФильтрПоКолвуОстаткаПоСпискуТоваров
                                |		ПО ВТТовар.Аптека = ФильтрПоКолвуОстаткаПоСпискуТоваров.Аптека
                                |			И ВТТовар.ТоварКод = ФильтрПоКолвуОстаткаПоСпискуТоваров.ТоварКод
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ВТТовар
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	ВтТовар1.Аптека,
                                |	ВтТовар1.ТоварКод,
                                |	СУММА(ВтТовар1.Количество) КАК Количество
                                |ПОМЕСТИТЬ ФильтрПоМинОстатку
                                |ИЗ
                                |	ВтТовар1 КАК ВтТовар1
                                |
                                |СГРУППИРОВАТЬ ПО
                                |	ВтТовар1.Аптека,
                                |	ВтТовар1.ТоварКод
                                |
                                |ИМЕЮЩИЕ
                                |	СУММА(ВтТовар1.Количество) >= &МинОстаток
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |ВЫБРАТЬ
                                |	КолваНаименованийПоАптекам.Аптека
                                |ПОМЕСТИТЬ ДопФильтрНаСписокТоваровПоАптекам
                                |ИЗ
                                |	(ВЫБРАТЬ
                                |		ВтТовар1.Аптека КАК Аптека,
                                |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтТовар1.ТоварКод) КАК КолвоНаименованийПоАптеке
                                |	ИЗ
                                |		ВтТовар1 КАК ВтТовар1
                                |	
                                |	СГРУППИРОВАТЬ ПО
                                |		ВтТовар1.Аптека) КАК КолваНаименованийПоАптекам,
                                |	(ВЫБРАТЬ
                                |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АССОРТИМЕНТНЫЙ_ПЛАН.Код) КАК КолвоНаименованийВСписке
                                |	ИЗ
                                |		Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
                                |	ГДЕ
                                |		АССОРТИМЕНТНЫЙ_ПЛАН.Код В(&СписокКодовТоваров)) КАК РазмерСпискаТоваров
                                |ГДЕ
                                |	КолваНаименованийПоАптекам.КолвоНаименованийПоАптеке = РазмерСпискаТоваров.КолвоНаименованийВСписке
								|;
								|"
								+ ?(ПоказыватьДатуПоследнейПоставки,
								"////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|	ПартииЖНВЛСОбороты.ТоварКод,
								|	ПартииЖНВЛСОбороты.СкладКод,
								|	МАКСИМУМ(ПартииЖНВЛСОбороты.Период) КАК Период
								|ПОМЕСТИТЬ ПоследниеПоступления
								|ИЗ
								|	РегистрНакопления.УЗ_Партии.Обороты(
								|			ДобавитьКДате(&ТекущаяДата, МЕСЯЦ, -1),
								|			&ТекущаяДата,
								|			Регистратор,
								|			ТоварКод В (&СписокКодовТоваров)
								|				И СкладКод В
								|					(ВЫБРАТЬ
								|						А.КодСклада
								|					ИЗ
								|						Аптеки КАК А)) КАК ПартииЖНВЛСОбороты
								|ГДЕ
								|	ПартииЖНВЛСОбороты.Регистратор ССЫЛКА Документ.УЗ_ПоступлениеТовара
								|
								|СГРУППИРОВАТЬ ПО
								|	ПартииЖНВЛСОбороты.ТоварКод,
								|	ПартииЖНВЛСОбороты.СкладКод
								|;
								|", "") + 
								"////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|	ВтТовар1.КодАптеки КАК КодАптеки,
                                |	ВтТовар1.Аптека КАК Аптека,
                                |	ВтТовар1.Метро,
								|	ВтТовар1.СубъектРФ,
                                |	ВЫБОР
                                |		КОГДА ВтТовар1.ИсточникДанных = 1
                                |			ТОГДА ВтТовар1.Количество / Партии.К
                                |		ИНАЧЕ 0
                                |	КОНЕЦ КАК Остаток,
                                |	ЕСТЬNULL(РЦП.Цена, ЕСТЬNULL(РЦ.Цена,0))/Партии.К КАК Цена,
                                |	АП.ЕдиницаПоУмолчанию"+?(ВнешнийВызов=Истина,".наименование","")+" КАК ЕИТ,
                                |	ВтТовар1.ТелефонДляСправки,
                                |	ВтТовар1.РежимРаботы,
                                |	ВЫРАЗИТЬ(ВтТовар1.СуммаЗакуп / ВтТовар1.Количество * Партии.К * 1.04 КАК ЧИСЛО(10, 1)) КАК Мин_Розн_Цена,
                                |	АП.Коэффициент КАК К,
                                |	ВтТовар1.ОсуществляетДоставкуКлиенту КАК Доставка,
                                |	ВтТовар1.ОсуществляетБронирование КАК ОсуществляетБронирование,
                                |	ВтТовар1.УдаленностьОтКлиента КАК УдаленностьОтКлиента,
								|	ВтТовар1.ПартияКод,
								|	Партии.СрокГодности,
                                |	Партии.Производитель"+?(ВнешнийВызов=Истина,".Наименование","")+" КАК Производитель,"
								+ ?(ПоказыватьДатуПоследнейПоставки, "ЕстьNull(ПоследниеПоступления.Период, Партии.ДатаПоступления) КАК ПоследняяПоставка,", "") +
								"АП."+?(ВнешнийВызов=Истина,"Код","Ссылка")+" КАК Товар 								
                                |ИЗ
                                |	ВтТовар1 КАК ВтТовар1
                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФильтрПоМинОстатку КАК ФильтрПоМинОстатку
                                |		ПО ВтТовар1.Аптека = ФильтрПоМинОстатку.Аптека
                                |			И ВтТовар1.ТоварКод = ФильтрПоМинОстатку.ТоварКод"
								+ ?(ПоказыватьДатуПоследнейПоставки, " ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеПоступления КАК ПоследниеПоступления ПО ВтТовар1.Аптека = ПоследниеПоступления.Склад И ВтТовар1.ТоварКод = ПоследниеПоступления.ТоварКод ", " ") +
                                "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопФильтрНаСписокТоваровПоАптекам КАК ДопФильтрНаСписокТоваровПоАптекам
                                |		ПО ВтТовар1.Аптека = ДопФильтрНаСписокТоваровПоАптекам.Аптека
								|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УЗ_Партии как Партии по Партии.Код = ВтТовар1.ПартияКод
                                |ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ассортиментный_план как АП по АП.Код = ВтТовар1.ТоварКод
								|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РозничныеЦены как РЦ по РЦ.АптекаКод = ВтТовар1.КодАптеки и  РЦ.ТоварКод = ВтТовар1.ТоварКод
								|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РозничныеЦеныПоПартиям как РЦП по РЦП.АптекаКод = ВтТовар1.КодАптеки и  РЦП.ПартияКод = ВтТовар1.ПартияКод
								|
								|ОБЪЕДИНИТЬ ВСЕ
								|
								|ВЫБРАТЬ
								 |	ИА.КодАптеки КАК КодАптеки,
								 |	МХ.Ссылка КАК Аптека,
								 |	МХ.Метро КАК Метро,
								 |	МХ.СубъектРФ КАК СубъектРФ,
								 |	ИА.КоличествоОстаток КАК Остаток,
								 |	0 КАК Цена,
								 |	"""" КАК ЕИТ,
								 |	МХ.ТелефонДляСправки КАК ТелефонДляСправки,
								 |	МХ.РежимРаботы КАК РежимРаботы,
								 |	0 КАК Мин_Розн_Цена,
								 |	АП.Коэффициент КАК К,
								 |	МХ.ОсуществляетДоставкуКлиенту КАК Доставка,
								 |	МХ.ОсуществляетБронирование КАК ОсуществляетБронирование,
								 |	-1 КАК УдаленностьОтКлиента,
								 |	0 КАК ПартияКод,
								 |	ДАТАВРЕМЯ(1, 1, 1) КАК СрокГодности,
								 |	АП.Производитель КАК Производитель,"
								+ ?(ПоказыватьДатуПоследнейПоставки, "ДАТАВРЕМЯ(1, 1, 1) КАК ПоследняяПоставка,", "") +
								"АП."+?(ВнешнийВызов=Истина,"Код","Ссылка")+" КАК Товар
								 |ИЗ
								 |	РегистрНакопления.ОстаткиТовараИнтернетАптек.Остатки(, КодТовара В (&СписокКодовТоваров)) КАК ИА
								 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК МХ
								 |		ПО ИА.КодАптеки = МХ.Код  
								 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АП
								 |		ПО ИА.КодТовара = АП.Код
								 |ГДЕ &ВсеСубъектыРФ ИЛИ МХ.СубъектРФ В (&СубъектыРФ)
								|
                                |УПОРЯДОЧИТЬ ПО
                                |	Товар,
                                |	УдаленностьОтКлиента,
                                |	Аптека,
                                |	Цена
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ Аптеки
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ДопФильтрНаСписокТоваровПоАптекам
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ПоОстаткам
                                |;
                                |
                                |////////////////////////////////////////////////////////////////////////////////
                                |УНИЧТОЖИТЬ ФильтрПоМинОстатку";
								
								
	Возврат ЗапросПоОстаткамТоваров_Текст;
КонецФункции	


