

Процедура ПередЗаписью(Отказ)
	Если Значение <> Константы.ОстановитьРасчетАвтозаказов.Получить() Тогда
		Если Константы.ОстановитьРасчетАвтозаказов.Получить() ТОгда
			ОбщегоНазначения.ПослатьСообщениеВТелеграм("Расчет автозаказов включен пользователем " + Строка(ПараметрыСеанса.ТекущийСотр),66);//ENT-1584			
		Иначе
			ОбщегоНазначения.ПослатьСообщениеВТелеграм("Расчет автозаказов отключен пользователем " + Строка(ПараметрыСеанса.ТекущийСотр),66);	//ENT-1584		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
