
Процедура ПередЗаписью(Отказ)

	Если НЕ ЭтоГруппа Тогда

		СтрокаОшибки = "Элемент справочника ""Банки"" " + Наименование + " не записан!";
        
		Если НЕ ТолькоЦифрыВСтроке(СокрЛП(КоррСчет)) Тогда

			СообщитьОбОшибке("В составе Корр.счета банка должны быть только цифры.",, СтрокаОшибки);
			Отказ = Истина;

		КонецЕсли;

		Если НЕ ТолькоЦифрыВСтроке(СокрЛП(Код)) Тогда

			СообщитьОбОшибке("В составе БИК банка должны быть только цифры.",, СтрокаОшибки);
			Отказ = Истина;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

