

&НаКлиенте
Процедура СформироватьКоманду() Экспорт
	
	Сервер = Новый ФиксированнаяСтруктура("Адрес,Порт,Отпечаток",
	ЭтаФорма.НастройкаАвторизации.Владелец.Наименование,
	ЭтаФорма.НастройкаАвторизации.Владелец.ПортСервера,
	ЭтаФорма.НастройкаАвторизации.Владелец.ОтпечатокКлюча
	);
	
	Пользователь = Новый ФиксированнаяСтруктура("Логин,Пароль,Сертификат",
	ЭтаФорма.НастройкаАвторизации.Наименование,
	ЭтаФорма.НастройкаАвторизации.Пароль,
	ЭтаФорма.НастройкаАвторизации.Сертификат
	);
	
	Файлы = Новый ФиксированнаяСтруктура("psftp,ppk,batch,log,rawlog",
	ПолучитьИмяВременногоФайла("exe"),
	ПолучитьИмяВременногоФайла("ppk"),
	ПолучитьИмяВременногоФайла("psftp"),
	ПолучитьИмяВременногоФайла("log")
	);
	
	Каталоги = Новый ФиксированнаяСтруктура("Локальный,Удаленный",
	ЭтаФорма.КаталогЛокальный,
	ЭтаФорма.КаталогУдаленный
	);
	
	ПолучитьОбщийМакет("psftp").Записать(Файлы.psftp);
	
	// Записываем сертификат в файл
	Если Не ПустаяСтрока(Пользователь.Сертификат) Тогда
		Файл = Новый ЗаписьТекста(Файлы.ppk,КодировкаТекста.ANSI,,Ложь,);
		Файл.Записать(Пользователь.Сертификат);
		Файл.Закрыть();
	КонецЕсли;
	
	// Записываем скрипт для psftp
	Файл = Новый ЗаписьТекста(Файлы.batch,КодировкаТекста.ANSI,,Ложь,);
	Файл.ЗаписатьСтроку("cd " + """" + Каталоги.Удаленный + """");
	Файл.ЗаписатьСтроку("lcd " + """" + Каталоги.Локальный + """");
	Файл.ЗаписатьСтроку(?(ЭтаФорма.ЭтоЗагрузка,"get ","put ")+""""+ЭтаФорма.ИмяФайла+"""");
	Файл.ЗаписатьСтроку("exit");
	Файл.Закрыть();
	
	ЭтаФорма.Команда =
	""				+ """"	+ Файлы.psftp			+ """"	+ 
	" -P "					+ Сервер.Порт			+ 
	" -hostkey "	+ """"	+ Сервер.Отпечаток		+ """"	+
	" -l "			+ """"	+ Пользователь.Логин	+ """"	+
	" -pw "			+ """"	+ Пользователь.Пароль	+ """"	+
	" -b "			+ """"	+ Файлы.batch			+ """"	+
	" -sshlog "		+ """"	+ Файлы.log				+ """"	+
	?(ПустаяСтрока(Пользователь.Сертификат),"",
	" -i "			+ """"	+ Файлы.ppk				+ """")	+
	" -C "			+
	" -bc "			+
	" -batch "		+
	" -noagent "	+
	Сервер.Адрес;
	
	
	
КонецПроцедуры

Процедура ОкончаниеРаботыPSFTP(КодВозврата,ДополнительныеПараметры)
	
	Если Не КодВозврата=0 Тогда
		Сообщить("Операция не выполнена, код ошибки: " + КодВозврата);
	Иначе
		Сообщить("Операция выполнена");
	КонецЕсли;
	
КонецПроцедуры

