Функция ПолучитьПредыдущийСтатусЗаказа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.СтатусЗаказаПокупателя
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Справочники.СтатусыЗаказаПокупателя.ПустаяСсылка();
	Иначе
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.СтатусЗаказаПокупателя;
	КонецЕсли;
	
КонецФункции

Функция КорректировкаСпецСимволов(Значение)
	
	//Возврат Значение;
	
   Результат = СтрЗаменить(Значение, "&", "&amp;");
   Результат = СтрЗаменить(Результат, "<", "&lt;");
   Результат = СтрЗаменить(Результат, ">", "&gt;");
   Результат = СтрЗаменить(Результат, """", "&quot;");
   Результат = СтрЗаменить(Результат, "'", "&apos;");
   Результат = СтрЗаменить(Результат, "/", "&#x2F;");	
   Возврат Результат;
   
КонецФункции

Процедура ЗаписатьЭлементXML(ЗаписьXML, Имя, Значение) 
	
	//ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	//ЗаписьXML.ЗаписатьТекст(Значение);
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	Если Значение = "" Тогда
		ЗаписьXML.ДобавитьСтроку("<" + Имя + "/>");
	Иначе
		ЗаписьXML.ДобавитьСтроку("<" + Имя + ">" + Значение + "</" + Имя + ">");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНачалоЭлемента(ЗаписьXML,Имя)
	
	ЗаписьXML.ДобавитьСтроку("<" + Имя + ">");
	
КонецПроцедуры

Процедура ЗаписатьКонецЭлемента(ЗаписьXML,Имя)
	
	ЗаписьXML.ДобавитьСтроку("</" + Имя + ">");
	
КонецПроцедуры

Функция ВыгрузитьВАптеку(Статус = "NEW") Экспорт
	
	
	СоотвСтатусов = Новый Соответствие;
	СоотвСтатусов.Вставить("NEW","1");
	СоотвСтатусов.Вставить("CANCELLED","4");
	СоотвСтатусов.Вставить("TIMEOUT","4");
	СоотвСтатусов.Вставить("READY","1");
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ТекстовыйДокумент;
	
	
	ЗаписьXML.ДобавитьСтроку("<?xml version=""1.0"" encoding=""WINDOWS-1251""?>");
	
	ЗаписьXML.ДобавитьСтроку("<document>"); 
	
	
	ЗаписатьЭлементXML(ЗаписьXML, "pack_type", "OUT_BUYER_ORDER"); 
	ЗаписатьЭлементXML(ЗаписьXML, "fmt_ver", "1");
	
	ЗаписьXML.ДобавитьСтроку("<hdr>");
	ЗаписатьЭлементXML(ЗаписьXML, "id_doc_type", 	"221"); 
	ЗаписатьЭлементXML(ЗаписьXML, "id_doc_subtype", Формат(Перечисления.ИЗ_Типы.Индекс(ТипЗаказа),"ЧН=0; ЧГ=0")); 
	ЗаписатьЭлементXML(ЗаписьXML, "guid", XMLСтрока(Ссылка)); 
	ЗаписатьЭлементXML(ЗаписьXML, "status",	СоотвСтатусов[Статус]); 
	ЗаписатьЭлементXML(ЗаписьXML, "status_order",	Формат(СтатусЗаказаЛокальный.КодСтатусаВАптеке,"ЧДЦ=")); 
	ЗаписатьЭлементXML(ЗаписьXML, "ndoc",		Формат(Номер,"ЧГ=0")); 
	ЗаписатьЭлементXML(ЗаписьXML, "ddoc",		Формат(Дата,"ДФ=dd.MM.yyyy"));
	ЗаписатьЭлементXML(ЗаписьXML, "date_exp",		Формат(ДатаОкончанияЖизниЗаказа,"ДФ=dd.MM.yyyy"));
	ЗаписатьЭлементXML(ЗаписьXML, "dsc_office", 		КорректировкаСпецСимволов(СокрЛП(Комментарий)));	
	ЗаписатьЭлементXML(ЗаписьXML, "buyer_fullname", 	КорректировкаСпецСимволов(СокрЛП(КлиентИнтернетЗаказа.Наименование)));	
	ЗаписатьЭлементXML(ЗаписьXML, "buyer_phone",	 	КорректировкаСпецСимволов(СокрЛП(Телефон)));	
	ЗаписатьЭлементXML(ЗаписьXML, "sum_prepay",			Формат(СуммаАванса,"ЧРД=.; ЧН=0; ЧГ=0"));
	ЗаписатьЭлементXML(ЗаписьXML, "id_source_order",	Формат(ИсточникИнтернетЗаказа.Код,"ЧГ=0")); 
	ЗаписатьЭлементXML(ЗаписьXML, "ndoc_source_order",	КорректировкаСпецСимволов(СокрЛП(НомерИнтернетЗаказа)));
	ЗаписатьЭлементXML(ЗаписьXML, "ddoc_source_order",	Формат(Дата,"ДФ=dd.MM.yyyy"));
	ЗаписатьЭлементXML(ЗаписьXML, "id_order",			КорректировкаСпецСимволов(СокрЛП(ШКЗаказа)));
	ЗаписьXML.ДобавитьСтроку("</hdr>");
	
	Если ТипЗаказа = Перечисления.ИЗ_Типы.ПрямойЧерезСклад или СтатусЗаказаЛокальный.Код = "READY" или СоотвСтатусов[Статус] = "4" Тогда
		ЗаписьXML.ДобавитьСтроку("<str>");
		ЗаписьXML.ДобавитьСтроку("</str>"); //конец записи секции  "str"
	Иначе
		
		ТЗЗаявки = Заявка.Выгрузить();
		ТЗЗаявки.Свернуть("КодТовара,Коэфф,КоэффициентРазбивки,ЦенаРозн,КодПартии,ЦенаРозн","Количество");
		
		ЗаписьXML.ДобавитьСтроку("<str>");
		Для каждого стр из ТЗЗаявки Цикл
			ЗаписьXML.ДобавитьСтроку("<row>");
			ЗаписатьЭлементXML(ЗаписьXML, "id_goods"	,Формат(стр.КодТовара,"ЧГ=0; ЧН=0")); 
			ЗаписатьЭлементXML(ЗаписьXML, "coeff"			,Формат(стр.КоэффициентРазбивки,"ЧГ=0; ЧН=0")); 
			ЗаписатьЭлементXML(ЗаписьXML, "qnt"			,Формат(стр.Количество*стр.Коэфф,"ЧГ=0; ЧН=0")); 
			ЗаписатьЭлементXML(ЗаписьXML, "guid_gpart"	,Формат(стр.КодПартии,"ЧГ=0; ЧН=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "sum_rtl_w_vat"	,Формат(стр.ЦенаРозн*(стр.Количество/стр.КоэффициентРазбивки*стр.Коэфф),"ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "dsc_dep", 		"");
			ЗаписатьЭлементXML(ЗаписьXML, "is_extended_selection",	Формат(Число(ПодборПартийВАРМ),"ЧН=0; ЧГ=0") );	
			ЗаписьXML.ДобавитьСтроку("</row>");
		КонецЦикла;
		ЗаписьXML.ДобавитьСтроку("</str>"); //конец записи секции  "str"
	КонецЕсли;
	
	
	ЗаписьXML.ДобавитьСтроку("</document>"); //конец записи секции  "document"
	ВесьТекст = ЗаписьXML.ПолучитьТекст();
	ЗаписьXML.Очистить();
	ЗаписьXML = Неопределено;
	
	КодСклада = Склад.Код;
	КодСчетчика = ОМ_ТСО.ПолучитьКодСчетчика("ОбменАптекаОфисЦелевые");
	Если КодСчетчика = -1 Тогда
		КодСчетчика = ОМ_ТСО.ПолучитьКодСчетчика("ОбменАптекаОфисЦелевые");
		Если КодСчетчика = -1 Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ОфисАптекаЦелевые.СоздатьМенеджерЗаписи();
	МЗ.Код = КодСчетчика;
	МЗ.КодАптеки = Склад.Код;
	МЗ.ТипУпаковки = "OUT_BUYER_ORDER";
	МЗ.Приоритет = 1;
	МЗ.ВерсияФормата = 1;
	МЗ.ИмяФайла = "out_buyer_order_" + СокрЛП(Формат(КодСклада,"ЧГ=0")) + "_" + СокрЛП(Формат(Номер,"ЧГ=0")) + "_" + Формат(Дата,"ДФ=dd.MM.yyyy") +".xml";
	МЗ.ИдентификаторКодировки = 1;
	МЗ.ХМЛСтрока = ВесьТекст;
	МЗ.ИдентификаторДокумента = ИДДокументаАптеки;
	МЗ.Записать();	
	
	
	Если СоотвСтатусов[Статус] = "1" и НЕ СтатусЗаказаЛокальный.Код = "READY" Тогда
		СтатусЗаказаПокупателя = Справочники.СтатусыЗаказаПокупателя.SHIPPED;
	//ИначеЕсли Статус = "CANCELLED" Тогда
	//	СтатусЗаказаПокупателя = Справочники.СтатусыЗаказаПокупателя.WAITCANCELLED;
	ИначеЕсли Статус = "TIMEOUT" Тогда
		СтатусЗаказаПокупателя = Справочники.СтатусыЗаказаПокупателя.WAITTIMEOUT;
	КонецЕсли;
	Записать(РежимЗаписиДокумента.Запись);
	
	ОбщегоНазначения.ЗаписатьИсториюИзмененияДокумента(Ссылка,"Выгружен в аптеку",ПараметрыСеанса.ТекущийСотр,"Выгружен в аптеку");	
	
	Возврат Истина;	
	
	
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаИзменения = ТекущаяДата();
	СуммаЗакупБезНДСПродажи = Заказ.Итог("СуммаЗакупБезНДСПродажи");
	СуммаПродажи = Заказ.Итог("СуммаПродажи"); 
	
	Если СтатусЗаказаПокупателя <> ПолучитьПредыдущийСтатусЗаказа() Тогда
		НС = ИсторияСтатусов.Добавить();
		НС.ДатаУстановки = ТекущаяДата();
		НС.СтатусЗаказаПокупателя = СтатусЗаказаПокупателя;
		НС.ДатаУстановкиВАптеке = ДатаИзмененияВАптеке;
	КонецЕсли;
	
КонецПроцедуры

