Перем КонтрольнаяСуммаШапкиИсходногоДокументаПередОткрытием,КонтрольнаяСуммаТЧИсходногоДокументаПередОткрытием;
Процедура ОбработкаЗаполнения(Основание)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТовара") Тогда
		// Заполнение шапки
		ДокументОснование = Основание.Ссылка;
		Для Каждого ТекСтрокаТовар Из Основание.Товар Цикл
			НоваяСтрока = ТОвар.Добавить();
			НоваяСтрока.Товар = ТекСтрокаТовар.Товар;
			НоваяСтрока.ЗакупЦенаПоДок = ТекСтрокаТовар.ЦенаЗакуп;
			НоваяСтрока.СтараяЗакупЦенаАП=ТекСтрокаТовар.Товар.ЗакупочнаяЦена;
		КонецЦикла;
	КонецЕсли;
	#IF Client Then
	ОМ4_ПРиОткрытии(ЭтотОбъект,Товар,КонтрольнаяСуммаШапкиИсходногоДокументаПередОткрытием,КонтрольнаяСуммаТЧИсходногоДокументаПередОткрытием);
	#EndIf
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
