Функция ПроверкаВозможностиПроведения()
	
	Отказ=Ложь;
	
	Если ВидДвиженияАрбитража.Пустая()=Истина ТОгда
		#Если Клиент Тогда
			Предупреждение("Не указан вид движения арбитража!",1);
		#КонецЕсли
		Отказ=Истина;
	КонецЕсли;
	
	Если ТОвар.Количество()=0 ТОгда
		#Если Клиент Тогда
			Предупреждение("В документе нет ни одной строки!",1);
		#КонецЕсли
		Отказ=Истина;
	КонецЕсли;
	
	Если Склад.Пустая()=Истина ТОгда
		#Если Клиент Тогда
			Предупреждение("Не указан склад!",1);
		#КонецЕсли
		Отказ=Истина;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции





Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Отказ=ПроверкаВозможностиПроведения();
	
	
	Если ВидДвиженияАрбитража=Перечисления.ВидыДвиженийАрбитража.ПомещениеВАрбитраж Тогда
		ВидДвиженияПартий=ВидДвиженияНакопления.Расход;
		ВидДвижАрбитража=ВидДвиженияНакопления.Приход;
		ВидОперПарт=Перечисления.ВидыОпераций.ПередачаВАрбитраж;
		
    ИначеЕсли ВидДвиженияАрбитража=Перечисления.ВидыДвиженийАрбитража.ВозвратИзАрбитража Тогда
		ВидДвиженияПартий=ВидДвиженияНакопления.Приход;
		ВидДвижАрбитража=ВидДвиженияНакопления.Расход;
		ВидОперПарт=Перечисления.ВидыОпераций.ВозвратИзАрбитража;
	КонецЕсли;
	

	Если Склад.Делфи = Истина Тогда  //Для  аптек, работающих на новой программе
		Для Каждого Стр Из Товар Цикл
			// регистр ПартииЖНВЛС Расход/Приход
			Движение = Движения.ПартииЖНВЛС.Добавить();
			Движение.ВидДвижения = ВидДвиженияПартий;
			Движение.Период = Дата;
			Движение.Товар = Стр.Товар;
			Движение.Склад = Склад;
			Движение.Партия = Стр.Партия;
			Движение.СтавкаНДС = Стр.СтавкаНДС;
			Движение.Фирма = Склад.Фирма;
			Движение.Колво = Стр.Колво*стр.Коэфф;
			Движение.СуммаЗакупСНДС = Стр.СуммаЗакупСНДС;
			Движение.СуммаНДСЗакуп = Стр.СуммаНДСЗакуп;
			Движение.СуммаРознСНДС = Стр.СуммаРознСНДС;
			Движение.СуммаРознНДС = Стр.СуммаРознНДС;
			Движение.ВидОперации=ВидОперПарт;
		КонецЦикла;
		
		Для Каждого Стр Из Товар Цикл
			// регистр Арбитраж Приход/Расход
			Движение = Движения.Арбитраж.Добавить();
			Движение.ВидДвижения = ВидДвижАрбитража;
			Движение.Период = Дата;
			Движение.Товар = Стр.Товар;
			Движение.Склад = Склад;
			Движение.Партия = Стр.Партия;
			Движение.СтавкаНДС = Стр.СтавкаНДС;
			Движение.Фирма = Склад.Фирма;
			Движение.Колво = Стр.Колво*стр.Коэфф;
			Движение.СуммаЗакупСНДС = Стр.СуммаЗакупСНДС;
			Движение.СуммаНДСЗакуп = Стр.СуммаНДСЗакуп;
			Движение.СуммаРознСНДС = Стр.СуммаРознСНДС;
			Движение.СуммаРознНДС = Стр.СуммаРознНДС;
			Движение.ПричинаПомещенияВАрбитраж = Стр.ПричинаПомещенияВАрбитраж;
			Движение.ВидОперации=ВидОперПарт;
		КонецЦикла;
		
	Иначе //Для  аптек, работающих на старой программе
		
		Для Каждого Стр Из Товар Цикл
			// регистр ПартииЖНВЛС Расход/Приход
			Движение = Движения.ПартииЖНВЛС.Добавить();
			Движение.ВидДвижения = ВидДвиженияПартий;
			Движение.Период = Дата;
			Движение.Товар = Стр.Товар;
			Движение.Склад = Склад;
			Движение.Партия = Стр.Партия;
			Движение.СтавкаНДС = Стр.СтавкаНДС;
			Движение.Фирма = Склад.Фирма;
			Движение.Колво = Стр.Колво;
			Движение.СуммаЗакупСНДС = Стр.СуммаЗакупСНДС;
			Движение.СуммаНДСЗакуп = Стр.СуммаНДСЗакуп;
			Движение.СуммаРознСНДС = Стр.СуммаРознСНДС;
			Движение.СуммаРознНДС = Стр.СуммаРознНДС;
			Движение.ВидОперации=ВидОперПарт;
		КонецЦикла;
		
		Для Каждого Стр Из Товар Цикл
			// регистр Арбитраж Приход/Расход
			Движение = Движения.Арбитраж.Добавить();
			Движение.ВидДвижения = ВидДвижАрбитража;
			Движение.Период = Дата;
			Движение.Товар = Стр.Товар;
			Движение.Склад = Склад;
			Движение.Партия = Стр.Партия;
			Движение.СтавкаНДС = Стр.СтавкаНДС;
			Движение.Фирма = Склад.Фирма;
			Движение.Колво = Стр.Колво;
			Движение.СуммаЗакупСНДС = Стр.СуммаЗакупСНДС;
			Движение.СуммаНДСЗакуп = Стр.СуммаНДСЗакуп;
			Движение.СуммаРознСНДС = Стр.СуммаРознСНДС;
			Движение.СуммаРознНДС = Стр.СуммаРознНДС;
			Движение.ПричинаПомещенияВАрбитраж = Стр.ПричинаПомещенияВАрбитраж;
			Движение.ВидОперации=ВидОперПарт;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаЗакуп=Товар.Итог("СуммаЗакупСНДС");
	СуммаРозн =Товар.Итог("СуммаРознСНДС");

	ЗаписатьДействияВИсториюДокумента(Изменения,РежимЗаписи,ПометкаУдаления);	
	
	
КонецПроцедуры
