
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		ТХТ = "ВЫБРАТЬ
		|	КонтрактыИАптеки.Владелец
		|ИЗ
		|	Справочник.КонтрактыИАптеки КАК КонтрактыИАптеки
		|ГДЕ
		|	КонтрактыИАптеки.Аптека = &Аптека
		|	И КонтрактыИАптеки.Владелец.КодПоставщика = &КодПоставщика
		|";
		Запрос = Новый Запрос;
		Запрос.Текст = ТХТ;
		
		Запрос.УстановитьПараметр("КодПоставщика",Владелец.КодПоставщика);
		Запрос.УстановитьПараметр("Аптека",Аптека);
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			Сообщить("Данная аптека уже имеет привязку к контракту: " + Выборка.Владелец,СтатусСообщения.Важное);	
			Отказ = Истина;
		КонецЕсли;
		
		
		ТХТ = "ВЫБРАТЬ
		      |	КонтрактыИАптеки.Владелец,
		      |	КонтрактыИАптеки.Аптека
		      |ИЗ
		      |	Справочник.КонтрактыИАптеки КАК КонтрактыИАптеки
		      |ГДЕ
		      |	КонтрактыИАптеки.КодАптекиВнешн = &КодАптекиВнешн
		      |	И КонтрактыИАптеки.Владелец.КодПоставщика = &КодПоставщика";
		Запрос = Новый Запрос;
		Запрос.Текст = ТХТ;
		
		Запрос.УстановитьПараметр("КодПоставщика",Владелец.КодПоставщика);
		Запрос.УстановитьПараметр("КодАптекиВнешн",КодАптекиВнешн);
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			Сообщить("Данный код уже привязан к аптеке: " + Выборка.Аптека,СтатусСообщения.Важное);	
			Отказ = Истина;
		КонецЕсли;
		
	Иначе
		ТХТ = "ВЫБРАТЬ
		      |	КонтрактыИАптеки.Владелец,
		      |	КонтрактыИАптеки.Аптека
		      |ИЗ
		      |	Справочник.КонтрактыИАптеки КАК КонтрактыИАптеки
		      |ГДЕ
		      |	КонтрактыИАптеки.КодАптекиВнешн = &КодАптекиВнешн
		      |	И КонтрактыИАптеки.Владелец.КодПоставщика = &КодПоставщика
		      |	И КонтрактыИАптеки.Аптека <> &Аптека";
		Запрос = Новый Запрос;
		Запрос.Текст = ТХТ;
		
		Запрос.УстановитьПараметр("КодПоставщика",Владелец.КодПоставщика);
		Запрос.УстановитьПараметр("КодАптекиВнешн",КодАптекиВнешн);
		Запрос.УстановитьПараметр("Аптека",Аптека);
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			Сообщить("Данный код уже привязан к аптеке: " + Выборка.Аптека,СтатусСообщения.Важное);	
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
