Функция ПодключитьсяКВнешнемуИсточнику(СерверТП) Экспорт
	
	ИмяБазы = СерверТП.ИмяБазы;
	Сервер = СерверТП.Сервер;
	ПользовательТП = СерверТП.Пользователь;
	ПарольТП = СерверТП.Пароль;
	Порт = Формат(СерверТП.Порт,"ЧГ=0");
	
	СтрокаСоединения="Driver={PostgreSQL ANSI};Server="+Сервер+";Port="+Порт+";Database="+ИмяБазы+";Uid="+ПользовательТП+";Pwd="+ПарольТП+";";
	
	Соединение=Новый ComObject("ADODB.Connection");
	Соединение.ConnectionString=СтрокаСоединения;
	
	Попытка
		Соединение.Open();
		Возврат Соединение;
	Исключение
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли

		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьЗапросНаВнешнемИсточнике(Соединение,ТекстЗапроса) Экспорт
	
   Попытка
	   
	   RecordSet = Новый COMОбъект("ADODB.RecordSet");
	   
	   RecordSet.ActiveConnection = Соединение;
	   
	   RecordSet.CursorType = 3; 
	   
	   RecordSet.LockType = 1;
	   
	   RecordSet.Open(ТекстЗапроса);
	   
	   Возврат RecordSet;
   Исключение
	   #Если Клиент Тогда
	   	Сообщить("Не удалось выполнить запрос к внешней базе!");
	   	Сообщить(ОписаниеОшибки());
		#КонецЕсли
	   Возврат Неопределено;
   КонецПопытки;

	
КонецФункции


