
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	СтрИзм=Изменения.Добавить();
	СтрИзм.Сотрудник    = ПараметрыСеанса.ТекущийСотр;
	СтрИзм.Дата   = ТекущаяДата();
	СтрИзм.ТипИзм   = Перечисления.ДействияНадДокументами.Изменение;
	СтрИзм.КомментарийИзменения = "Проведен";
	

	// регистр ПосещениеТренингов
	ЗаписьПосещений = Истина;
	Если Статус = "Открыт" Тогда
		ЗаписьПосещений = Ложь;
	КонецЕсли;
	
	ЭтоСпецПроект =?(ВидТренинга = Перечисления.ВидыТренингов.СпецПроект,Истина,Ложь);
	
	
	Если НЕ ЭтоСпецПроект Тогда
		Движения.ПосещениеТренингов.Записывать = Истина;
		Движения.ПосещениеТренингов.Очистить();
		Для Каждого ТекСтрокаСостав Из Состав Цикл
			Движение = Движения.ПосещениеТренингов.Добавить();
			Движение.Сотрудник = ТекСтрокаСостав.Сотрудник;
			Движение.ОбъектТренинга = Тренинг;
			Движение.Аптека = ТекСтрокаСостав.Аптека;
			Движение.Дата=ДатаПроведенияТренинга;
			Если ЗаписьПосещений = Истина Тогда
				Движение.Посещение = ТекСтрокаСостав.Явка;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Движения.ПосещениеТренингов.Записывать = Истина;
		Движения.ПосещениеТренингов.Очистить();
		Для Каждого ТекСтрокаСостав Из Состав Цикл
			Для каждого стр из Тематика Цикл
				Движение = Движения.ПосещениеТренингов.Добавить();
				Движение.Сотрудник = ТекСтрокаСостав.Сотрудник;
				Движение.ОбъектТренинга = стр.СпецПроект;
				Движение.Аптека = ТекСтрокаСостав.Аптека;
				Движение.Дата=ДатаПроведенияТренинга;
				Если ЗаписьПосещений = Истина Тогда
					Движение.Посещение = ТекСтрокаСостав.Явка;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления = Истина Тогда
		стрИзм = Изменения.Добавить();
		стрИзм.Дата = ТекущаяДата();
		стрИзм.Сотрудник = ПараметрыСеанса.ТекущийСотр;
		стрИзм.ТипИзм = Перечисления.ДействияНадДокументами.Изменение;
		стрИзм.КомментарийИзменения = "Помечен на удаление";			
	КонецЕсли;	

КонецПроцедуры
