Процедура ОМ14_ОтправитьПисьмоСФайлом(Кому,Тема,ТекстПисьма,ФайлВыгрузки,СписокРассылки="") экспорт
	Мылер= Обработки.Почтарь.ПолучитьФорму("Форма",, Новый УникальныйИдентификатор );
	МЫлер.Открыть();
	Мылер.ЭлементыФормы.Адресат.Значение=Кому;
	Мылер.ЭлементыФормы.Отправитель.Значение=Константы.ПользовательПочты.Получить();
	Мылер.ЭлементыФормы.Тема.Значение=""+Мылер.ЭлементыФормы.Тема.Значение+Тема;
	Мылер.ЭлементыФормы.ТекстПисьма.Значение=ТекстПисьма;
	Мылер.ЭлементыФормы.СВ.Значение.Добавить(ФайлВыгрузки);
	
	Если СписокРАссылки<>"" ТОгда
		Мылер.ЭлементыФормы.Рассылка.Значение.ЗагрузитьЗначения(СписокРассылки);
	КонецЕсли;
КонецПроцедуры	