
Процедура ПроверитьНаЗаполнение(Отказ)
	
	
	Если НЕ Согласован Тогда
		#Если Клиент Тогда
			Предупреждение("Документ не прошел согласование. Проведение невозможно",3);
		#КонецЕсли
		Отказ = Истина;				
	КонецЕсли; 	
		
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаИзменения = ТекущаяДата();
	
	Если ЭтоНовый() Тогда
		Если НЕ ЗначениеЗаполнено(Заявитель) Тогда
			Заявитель = ПараметрыСеанса.ТекущийСотр;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 		
		//Если НЕ (РольДоступна("супер_АДМИНИСТРАТОР") или  РольДоступна("ОптовикиПолныеПрава")) Тогда		
		//	Предупреждение("Нет прав на проведение документа", 3);			
		//КонецЕсли; 		
		
		ПроверитьНаЗаполнение(Отказ);	
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Изменение = Изменения.Добавить();
		Изменение.Дата = ТекущаяДата();
		Изменение.КомментарийИзменения = "Создан новый документ";
		Изменение.Сотрудник = ПараметрыСеанса.ТекущийСотр;
		Изменение.ТипИзм = Перечисления.ДействияНадДокументами.ВводНового;
	КонецЕсли;
	
	ЗаписатьДействияВИсториюДокумента(Изменения,РежимЗаписи,ПометкаУдаления);	
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	  Проведен = Ложь;
	  Согласован = Ложь;
	  СогласованКем = Справочники.Сотрудники.ПустаяСсылка();
	  Заявитель = ПараметрыСеанса.ТекущийСотр;
	  Изменения.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ФиксированныеЦеныПодКонкурентов
	Если КодТовара = 0 Тогда
		#Если Клиент Тогда
			Сообщить("Не заполнен код товара. Проведение не может быть продолжено");
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидФиксЦены) Тогда
		#Если Клиент Тогда
			Сообщить("Не заполнен код товара. Проведение не может быть продолжено");
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;
	
	
	Движения.ФиксЦены.Записывать = Истина;
	Движения.ФиксЦены.Очистить();
	Движение = Движения.ФиксЦены.Добавить();
	Движение.Период = Дата;
	Движение.КодТовара = КодТовара;
	Движение.ВидФиксЦены = ВидФиксЦены.Код;
	Движение.Цена = ФиксЦена;
	Движение.Пользователь = СогласованКем;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
