
Процедура СформироватьОтчет() экспорт
	 Построитель.Параметры.Очистить();
//----------------------------- параметры построителя -------------------//
Построитель.Параметры.Вставить("Дата",ДатаЗаказов);
Построитель.Параметры.Вставить("Склад",Склад);
Построитель.Параметры.Вставить("Фирма",Склад.Фирма);
Построитель.Параметры.Вставить("Статус",Перечисления.СтатусЗаказаПоставщику.ВыгруженПоставщику);

Построитель.ТекстЗаголовка="Потребность по заказам от "+Формат(ДатаЗаказов,"ДЛФ=D");



Построитель.Выполнить();

Таб=Новый ТабличныйДокумент;

Построитель.МакетОформления=ПолучитьМакетОформления(СтандартноеОформление.Трава);//мурава
Построитель.Вывести(Таб);



Таб.ОтображатьЗаголовки=Ложь;
Таб.ОтображатьСетку=Ложь;
Таб.ТолькоПросмотр=Истина;


Таб.Показать("И-Потребность за "+Формат(ДатаЗаказов,"ДЛФ=D"));
	
КонецПроцедуры	



Построитель.Текст=  "ВЫБРАТЬ
                    |	ИнтернетЗаказТовар.Товар,
                    |	СУММА(ИнтернетЗаказТовар.Количество) КАК Количество
                    |ПОМЕСТИТЬ ИЗаказ
                    |ИЗ
                    |	Документ.ИнтернетЗаказ.Товар КАК ИнтернетЗаказТовар
                    |ГДЕ
                    |	НАЧАЛОПЕРИОДА(ИнтернетЗаказТовар.Ссылка.ДатаЗаказа, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
                    |	И ИнтернетЗаказТовар.Ссылка.ЧекПробит = ЛОЖЬ
                    |	И ИнтернетЗаказТовар.Ссылка.Проведен = ЛОЖЬ
                    |
                    |СГРУППИРОВАТЬ ПО
                    |	ИнтернетЗаказТовар.Товар
                    |;
                    |
                    |////////////////////////////////////////////////////////////////////////////////
                    |ВЫБРАТЬ
                    |	ИЗаказ.Товар,
                    |	ИЗаказ.Количество КАК ИнтернетЗаказ,
                    |	ЕСТЬNULL(ПартииЖНВЛСОстатки.КолвоОстаток, 0) КАК Остаток
                    |ПОМЕСТИТЬ ИО
                    |ИЗ
                    |	ИЗаказ КАК ИЗаказ
                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииЖНВЛС.Остатки(
                    |				,
                    |				Склад = &Склад
                    |					И Фирма = &Фирма) КАК ПартииЖНВЛСОстатки
                    |		ПО ИЗаказ.Товар = ПартииЖНВЛСОстатки.Товар
                    |ГДЕ
                    |	ИЗаказ.Количество > ЕСТЬNULL(ПартииЖНВЛСОстатки.КолвоОстаток, 0)
                    |;
                    |
                    |////////////////////////////////////////////////////////////////////////////////
                    |ВЫБРАТЬ
                    |	ИО.Товар,
                    |	ИО.ИнтернетЗаказ,
                    |	ИО.Остаток,
                    |	ЕСТЬNULL(Прих.Неоприходовано, 0) КАК Неоприходовано
                    |ПОМЕСТИТЬ ИОН
                    |ИЗ
                    |	ИО КАК ИО
                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                    |			ПоступлениеТовараТовар.Товар КАК Товар,
                    |			СУММА(ПоступлениеТовараТовар.Коэфф * ПоступлениеТовараТовар.КоличествоФакт) КАК Неоприходовано
                    |		ИЗ
                    |			Документ.ПоступлениеТовара.Товар КАК ПоступлениеТовараТовар
                    |		ГДЕ
                    |			ПоступлениеТовараТовар.Ссылка.Склад = &Склад
                    |			И ПоступлениеТовараТовар.Ссылка.Проведен = ЛОЖЬ
                    |			И ПоступлениеТовараТовар.Ссылка.ПометкаУдаления = ЛОЖЬ
                    |		
                    |		СГРУППИРОВАТЬ ПО
                    |			ПоступлениеТовараТовар.Товар) КАК Прих
                    |		ПО ИО.Товар = Прих.Товар
                    |;
                    |
                    |////////////////////////////////////////////////////////////////////////////////
                    |ВЫБРАТЬ
                    |	ИОН.Товар.Код КАК Код_АП,
                    |	ИОН.Товар,
                    |	ИОН.ИнтернетЗаказ,
                    |	ИОН.Остаток,
                    |	ИОН.Неоприходовано,
                    |	ЕСТЬNULL(зупо.ЗаказаноУПоставщика, 0) КАК ЗаказаноУПоставщика
                    |ИЗ
                    |	ИОН КАК ИОН
                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                    |			ЗаявкаНаТоварТовар.Товар КАК Товар,
                    |			СУММА(ЗаявкаНаТоварТовар.Количество * ЗаявкаНаТоварТовар.ЕИТ.К) КАК ЗаказаноУПоставщика
                    |		ИЗ
                    |			Документ.ЗаявкаНаТовар.Товар КАК ЗаявкаНаТоварТовар
                    |		ГДЕ
                    |			ЗаявкаНаТоварТовар.Ссылка.Склад = &Склад
                    |			И ЗаявкаНаТоварТовар.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
                    |			И ЗаявкаНаТоварТовар.Ссылка.Статус = &Статус
                    |			И ЗаявкаНаТоварТовар.Ссылка.Проведен = ИСТИНА
                    |		
                    |		СГРУППИРОВАТЬ ПО
                    |			ЗаявкаНаТоварТовар.Товар) КАК зупо
                    |		ПО ИОН.Товар = зупо.Товар
                    |;
                    |
                    |////////////////////////////////////////////////////////////////////////////////
                    |УНИЧТОЖИТЬ ИЗаказ
                    |;
                    |
                    |////////////////////////////////////////////////////////////////////////////////
                    |УНИЧТОЖИТЬ ИО
                    |;
                    |
                    |////////////////////////////////////////////////////////////////////////////////
                    |УНИЧТОЖИТЬ ИОН"; // Сгенерировано в GtG's Консоль запросов. 02.08.2012 15:01:44
