
Процедура ПередЗаписью(Отказ)
	
	//Если СтрДлина(СокрЛП(Префикс)) + СтрДлина(Формат(КонНомер,"ЧГ=0")) >= ДлинаКарты  Тогда
	Если СтрДлина(СокрЛП(Префикс)) + СтрДлина(Формат(КонНомер,"ЧГ=0")) > ДлинаКарты  Тогда //ENT-196
		#Если Клиент Тогда
			Предупреждение("Длина префикса + длина конечного номера не должна превышать длину карты. Элемент не записан!");
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;

	СписокАптек.Свернуть("Аптека","");
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТДК.Аптека,
	//               |	КОЛИЧЕСТВО(ТДК.Аптека) КАК Количество
	//               |ИЗ
	//               |	Справочник.ТипыДисконтныхКарт.СписокАптек КАК ТДК
	//               |ГДЕ
	//               |	ТДК.Ссылка = &ССылка
	//               |	И НЕ ТДК.Ссылка.ОбластьДействия = ЗНАЧЕНИЕ(Перечисление.ОбластиДействия.ПустаяСсылка)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ТДК.Аптека
	//               |
	//               |ИМЕЮЩИЕ
	//               |	КОЛИЧЕСТВО(ТДК.Аптека) > 1";
	//Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//Рез = Запрос.Выполнить();
	//Если НЕ Рез.Пустой() Тогда
	//	Выборка = Рез.Выбрать();
	//	Сообщить("В списке аптек существуют повторения аптек. ");
	//	Пока Выборка.Следующий() Цикл
	//		Сообщить(""+Выборка.Аптека + " количество повторений: "+ Выборка.Количество);
	//	КонецЦикла;
	//	Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры
