
Функция КорректировкаСпецСимволов(Значение)
	
	//Возврат Значение;
	
   Результат = СтрЗаменить(Значение, "&", "&amp;");
   Результат = СтрЗаменить(Результат, "<", "&lt;");
   Результат = СтрЗаменить(Результат, ">", "&gt;");
   Результат = СтрЗаменить(Результат, """", "&quot;");
   Результат = СтрЗаменить(Результат, "'", "&apos;");
   Результат = СтрЗаменить(Результат, "/", "&#x2F;");	
   Возврат Результат;
   
КонецФункции

Процедура ЗаписатьЭлементXML(ЗаписьXML, Имя, Значение) 
	
	//ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	//ЗаписьXML.ЗаписатьТекст(Значение);
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	Если Значение = "" Тогда
		ЗаписьXML.ДобавитьСтроку("<" + Имя + "/>");
	Иначе
		ЗаписьXML.ДобавитьСтроку("<" + Имя + ">" + Значение + "</" + Имя + ">");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНачалоЭлемента(ЗаписьXML,Имя)
	
	ЗаписьXML.ДобавитьСтроку("<" + Имя + ">");
	
КонецПроцедуры

Процедура ЗаписатьКонецЭлемента(ЗаписьXML,Имя)
	
	ЗаписьXML.ДобавитьСтроку("</" + Имя + ">");
	
КонецПроцедуры

Процедура ДобавитьСекциюТоваров(ЗаписьXML)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар КАК Товар,
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар.ПометкаУдаления КАК ПометкаУдаления,
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар.Код КАК КодТовара,
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар.Наименование КАК Наименование,
	               |	ПОДСТРОКА(УЗ_РаспоряжениеСписаниеТовар.Товар.МеждународноеНазвание, 1, 150) КАК МеждународноеНазвание,
	               |	0 КАК КодПроизводителя,
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар.УчаствуетВАП КАК УчаствуетВАП,
	               |	ЕСТЬNULL(УЗ_РаспоряжениеСписаниеТовар.Товар.МНН.Код, 0) КАК КодМНН,
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар.ЖНВЛС КАК ЖНВЛС,
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар.ПККН КАК ПККН,
	               |	ВЫБОР
	               |		КОГДА УЗ_РаспоряжениеСписаниеТовар.Товар.ДатаВводаВАП = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ДАТАВРЕМЯ(2000, 1, 1)
	               |		ИНАЧЕ УЗ_РаспоряжениеСписаниеТовар.Товар.ДатаВводаВАП
	               |	КОНЕЦ КАК ДатаВводаВАП,
	               |	ВЫБОР
	               |		КОГДА УЗ_РаспоряжениеСписаниеТовар.Товар.СтавкаНДС.Код = 3
	               |				И УЗ_РаспоряжениеСписаниеТовар.Ссылка.Дата < ДАТАВРЕМЯ(2019, 1, 1)
	               |			ТОГДА 18
	               |		ИНАЧЕ УЗ_РаспоряжениеСписаниеТовар.Товар.СтавкаНДС.Ставка
	               |	КОНЕЦ КАК Ставка,
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар.АптечныйОБ КАК ОбязательноеНаличие,
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар.МаксКоличествоВОдинЧек КАК МаксКоличествоВОдинЧек,
	               |	УЗ_РаспоряжениеСписаниеТовар.Товар.ОтпускПоРецепту КАК ОтпускПоРецепту,
	               |	ЕСТЬNULL(УЗ_РаспоряжениеСписаниеТовар.Товар.Подкатегория.Код, 0) КАК КодПодкатегории,
	               |	УЗ_РаспоряжениеСписаниеТовар.КоэффициентРазбивки КАК КоэффициентРазбивки,
	               |	ЕСТЬNULL(УЗ_РаспоряжениеСписаниеТовар.Товар.Страна.Наименование, """") КАК Страна
	               |ИЗ
	               |	Документ.УЗ_РаспоряжениеСписание.Товар КАК УЗ_РаспоряжениеСписаниеТовар
	               |ГДЕ
	               |	УЗ_РаспоряжениеСписаниеТовар.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЕСТЬNULL(Выборка.Товар.МНН.Код, 0) КАК КодМНН,
	               |	ЕСТЬNULL(Выборка.Товар.МНН.Наименование, """") КАК НаименованиеМНН
	               |ИЗ
	               |	Документ.УЗ_РаспоряжениеМОР.Товар КАК Выборка
	               |ГДЕ
	               |	Выборка.Ссылка = &Ссылка
	               |	И ЕСТЬNULL(Выборка.Товар.МНН.Код, 0) > 0";
				   
			Запрос.УстановитьПараметр("Ссылка",Ссылка);

			Результат				= Запрос.ВыполнитьПакет();	   
			ВыборкаТовары			= Результат[0].Выбрать();				   
			ВыборкаМНН				= Результат[1].Выбрать();
			
		ЗаписьXML.ДобавитьСтроку("<inter_name>");
		Пока ВыборкаМНН.Следующий() Цикл
			ЗаписьXML.ДобавитьСтроку("<row>");
			ЗаписатьЭлементXML(ЗаписьXML, "id",	Формат(ВыборкаМНН.КодМНН,"ЧГ=0; ЧН=0") );				
			ЗаписатьЭлементXML(ЗаписьXML, "is_deleted", "0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "descr",		КорректировкаСпецСимволов(СокрЛП(ВыборкаМНН.НаименованиеМНН)));
			ЗаписатьЭлементXML(ЗаписьXML, "sname",		"");
			ЗаписьXML.ДобавитьСтроку("</row>");
		КонецЦикла;
		ЗаписьXML.ДобавитьСтроку("</inter_name>"); //конец записи секции  "mnn"
		
		ЗаписьXML.ДобавитьСтроку("<goods>");
		Пока ВыборкаТовары.Следующий() Цикл
			ЗаписьXML.ДобавитьСтроку("<row>");
			ЗаписатьЭлементXML(ЗаписьXML, "id",			Формат(ВыборкаТовары.КодТовара,"ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "is_deleted",	"" + Число(ВыборкаТовары.ПометкаУдаления)); 
			ЗаписатьЭлементXML(ЗаписьXML, "is_active",	"" + Число(ВыборкаТовары.УчаствуетВАП));
			ЗаписатьЭлементXML(ЗаписьXML, "descr",		КорректировкаСпецСимволов(СокрЛП(ВыборкаТовары.Наименование)));
			ЗаписатьЭлементXML(ЗаписьXML, "descr_ecr",	"");
			ЗаписатьЭлементXML(ЗаписьXML, "descr_en",		КорректировкаСпецСимволов(СокрЛП(ВыборкаТовары.МеждународноеНазвание)));
			ЗаписатьЭлементXML(ЗаписьXML, "article",		""); 
			ЗаписатьЭлементXML(ЗаписьXML, "p_vat",		Формат(ВыборкаТовары.Ставка,"ЧГ=0; ЧН=0")); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_group_ap",	"0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_group_ftg",	"0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_group_main","0"); //основная группа
			ЗаписатьЭлементXML(ЗаписьXML, "id_group_general","0"); //обобщенная группа
			ЗаписатьЭлементXML(ЗаписьXML, "id_brand_goods","0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_trade_name","0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_inter_name",Формат(ВыборкаТовары.КодМНН,"ЧГ=0; ЧН=0")); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_category_goods","0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_sub_category_goods",Формат(ВыборкаТовары.КодПодкатегории,"ЧГ=0; ЧН=0")); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_med_form",	"0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_destination","0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_prod_form",	"0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "id_storing_place","0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "is_life_important","" + Формат(Число(ВыборкаТовары.ЖНВЛС),"ЧН=0"));  
			ЗаписатьЭлементXML(ЗаписьXML, "is_social_important","0"); 
			ЗаписатьЭлементXML(ЗаписьXML, "is_scdc_list",		"" + Формат(Число(ВыборкаТовары.ПККН),"ЧН=0")); 
			ЗаписатьЭлементXML(ЗаписьXML, "is_mandatory",		"" + Формат(Число(ВыборкаТовары.ОбязательноеНаличие),"ЧН=0")); 
			ЗаписатьЭлементXML(ЗаписьXML, "is_prescription","" + Формат(Число(ВыборкаТовары.ОтпускПоРецепту),"ЧН=0")); 
			ЗаписатьЭлементXML(ЗаписьXML, "date_in", 		Формат(ВыборкаТовары.ДатаВВодаВАП,"ДФ=dd.MM.yyyy")); 
			ЗаписатьЭлементXML(ЗаписьXML, "producer_country_descr",		КорректировкаСпецСимволов(СокрЛП(ВыборкаТовары.Страна)));
			ЗаписьXML.ДобавитьСтроку("</row>");
		КонецЦикла;
		ЗаписьXML.ДобавитьСтроку("</goods>"); //конец записи секции  "good"
	
КонецПроцедуры

Функция ВыгрузитьВАптеку() Экспорт
	
	Если НЕ проведен и НЕ (СтатусСписания = Перечисления.СтатусыСписания.Аннулирован или СтатусСписания = Перечисления.СтатусыСписания.СогласованиеОтменено) Тогда
		#Если Клиент Тогда
			Предупреждение("Документ не проведен. Выполнение не может быть продолжено");
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;

	ЗаписьXML = Новый ТекстовыйДокумент;
	
	
	ЗаписьXML.ДобавитьСтроку("<?xml version=""1.0"" encoding=""WINDOWS-1251""?>");

	ЗаписьXML.ДобавитьСтроку("<document>"); 

	ЗаписатьЭлементXML(ЗаписьXML, "pack_type", "OUT_WRITE_OFF_ORDER"); 
	ЗаписатьЭлементXML(ЗаписьXML, "fmt_ver", "1"); 
	
	ДобавитьСекциюТоваров(ЗаписьXML);
	ЗаписьXML.ДобавитьСтроку("<hdr>");
		ЗаписатьЭлементXML(ЗаписьXML, "id_doc_type", 	"223"); 
		ЗаписатьЭлементXML(ЗаписьXML, "guid",	ИДДокументаАптеки); 
		ЗаписатьЭлементXML(ЗаписьXML, "ndoc",		Формат(Номер,"ЧГ=0")); 
		ЗаписатьЭлементXML(ЗаписьXML, "ddoc",	Формат(Дата,"ДФ=dd.MM.yyyy"));
		Если СтатусСписания = Перечисления.СтатусыСписания.Согласован Тогда
			ЗаписатьЭлементXML(ЗаписьXML, "status",	Перечисления.СтатусДокАптеки.Индекс(Перечисления.СтатусДокАптеки.Создан)); 
		ИначеЕсли СтатусСписания = Перечисления.СтатусыСписания.Аннулирован Тогда
			ЗаписатьЭлементXML(ЗаписьXML, "status",	Перечисления.СтатусДокАптеки.Индекс(Перечисления.СтатусДокАптеки.Аннулирован)); 
		Иначе
			ЗаписатьЭлементXML(ЗаписьXML, "status",	Перечисления.СтатусДокАптеки.Индекс(Перечисления.СтатусДокАптеки.Создан)); 
		КонецЕсли;
		ЗаписатьЭлементXML(ЗаписьXML, "dsc_office", 		КорректировкаСпецСимволов(СокрЛП(Комментарий)));	
		
		Если НЕ УровеньКонтроляУПД.Пустая() Тогда
			ЗаписатьЭлементXML(ЗаписьXML, "level_control_UPD", 	Перечисления.УровеньКонтроляУПД_МОР.Индекс(УровеньКонтроляУПД));
		КонецЕсли;	
		ЗаписатьЭлементXML(ЗаписьXML, "prohibition_of_excess_quantities",	"" + Число(ЗапретПревышенияКоличества));
		
  	ЗаписьXML.ДобавитьСтроку("</hdr>"); //конец записи секции  "hdr"
	
	ЗаписьXML.ДобавитьСтроку("<str>");
	Для каждого стр из Товары Цикл
		ЗаписьXML.ДобавитьСтроку("<row>");
			ЗаписатьЭлементXML(ЗаписьXML, "id_goods"	,Формат(стр.КодТовара,"ЧГ=0; ЧН=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "qnt"			,Формат(стр.Количество,"ЧГ=0; ЧН=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "coeff"		,"1");
			ЗаписатьЭлементXML(ЗаписьXML, "sum_pay"		,Формат(стр.СуммаРеализации,"ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "sum_pay_vat"	,Формат(стр.СуммаНДСРеализации,"ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "id_part"		,Формат(стр.КодПартии,"ЧГ=0; ЧН=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "series"		,КорректировкаСпецСимволов(СокрЛП(стр.Серия)));
		ЗаписьXML.ДобавитьСтроку("</row>");
	КонецЦикла;
	
	ЗаписьXML.ДобавитьСтроку("</str>");

	ЗаписьXML.ДобавитьСтроку("</document>"); //конец записи секции  "document"
	ВесьТекст = ЗаписьXML.ПолучитьТекст();
	
	ЗаписьXML.Очистить();
	ЗаписьXML = Неопределено;
	
	КодСклада = Склад.Код;
	КодСчетчика = ОМ_ТСО.ПолучитьКодСчетчика("ОбменАптекаОфисЦелевые");
	Если КодСчетчика = -1 Тогда
		КодСчетчика = ОМ_ТСО.ПолучитьКодСчетчика("ОбменАптекаОфисЦелевые");
		Если КодСчетчика = -1 Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЕсли;
	
	//к = Число("раздватри");
	
	МЗ = РегистрыСведений.ОфисАптекаЦелевые.СоздатьМенеджерЗаписи();
	МЗ.Код = КодСчетчика;
	МЗ.КодАптеки = КодСклада;
	МЗ.ТипУпаковки = "OUT_WRITE_OFF_ORDER";
	МЗ.Приоритет = 1;
	МЗ.ВерсияФормата = 1;
	МЗ.ИмяФайла = "out_write_off_order_" + СокрЛП(Формат(КодСклада,"ЧГ=0")) + "_" + СокрЛП(Формат(Номер,"ЧГ=0")) + "_" + Формат(Дата,"ДФ=dd.MM.yyyy") +".xml";
	МЗ.ИдентификаторКодировки = 1;
	МЗ.ХМЛСтрока = ВесьТекст;
	МЗ.ИдентификаторДокумента = ИДДокументаАптеки;
	МЗ.Записать();	
	
	ОбщегоНазначения.ЗаписатьИсториюИзмененияДокумента(Ссылка,"Выгружен",ПараметрыСеанса.ТекущийСотр,"Выгружен в аптеку");
	
	Возврат Истина;
	
	
КонецФункции
