Функция ПолучитьТоварПартиюПоКоду(ПартияКод) Экспорт
	
	Запрос = Новый Запрос;

	Запрос.Текст = "Выбрать
		|	АП.Ссылка КАК Товар,
		|	Партии.Ссылка КАК Партия
		|ИЗ
		|	Справочник.УЗ_Партии как Партии 
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АП
		|		ПО (АП.Код = Партии.КодТовара)
		|	ГДЕ Партии.Код = &ПартияКод
		|";

	Запрос.УстановитьПараметр("ПартияКод", ПартияКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Товар", Выборка.Товар);
	СтруктураВозврата.Вставить("Партия", Выборка.Партия);
	
	Возврат СтруктураВозврата;	

КонецФункции