
Процедура ПередЗаписью(Отказ)
	
	Если ШаблонДляВсехАптек = Истина Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ШаблоныМатриц.Ссылка
		|ИЗ
		|	Справочник.ШаблоныМатриц КАК ШаблоныМатриц
		|ГДЕ
		|	ШаблоныМатриц.ШаблонДляВсехАптек = ИСТИНА
		|	И ШаблоныМатриц.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			#Если Клиент Тогда
				Предупреждение("Шаблон для всех аптек уже существует. Запись элемента невозможна.");	
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	КтоРедактировал = ПараметрыСеанса.ТекущийСотр;
	
КонецПроцедуры
