
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	
	Для Каждого СтрокаТЧ Из Параметры Цикл
		Если ПустаяСтрока(СтрокаТЧ.Параметр) Тогда
			Сообщить("В строке " + СтрокаТЧ.НомерСтроки + " не задано имя параметра.", СтатусСообщения.Важное);
			Отказ = Истина;
		ИначеЕсли СтрокаТЧ.Значение = Неопределено  Тогда         //ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.Значение)
			Сообщить("В строке " + СтрокаТЧ.НомерСтроки + " не задано значение параметра.", СтатусСообщения.Важное);
			Отказ = Истина;
		ИначеЕсли МассивПараметров.Найти(СтрокаТЧ.Параметр) <> Неопределено Тогда
			Сообщить("В строке " + СтрокаТЧ.НомерСтроки + " обнаружен повтор параметра " + СтрокаТЧ.Параметр, СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
