
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.КодПозиции) Тогда
			
			КодСчетчика = ОМ_ТСО.ПолучитьКодСчетчика("Проверка неликвидов");
			Если КодСчетчика = -1 Тогда 
				Отказ = Истина;
			Иначе
				Запись.КодПозиции = КодСчетчика;
				ЭтотОбъект.Отбор.КодПозиции.Установить(КодСчетчика);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Запись.ДатаПроверки > Дата(1,1,1) И Запись.ФактическоеКоличество <= 0 Тогда
			Запись.СтатусПроверки = Перечисления.СтатусыПроверки.НеСовпадает;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
