
Процедура ОтправитьПисьмо(СписокАдресов, Тема, Текст = "", СписокВложений = Неопределено) Экспорт
	
	ОбработкаОбслуживания = Обработки.Почтарь.Создать();
	ОбработкаОбслуживания.Автоотправка = Истина;
	
	Для Каждого Адрес Из СписокАдресов Цикл
		ОбработкаОбслуживания.Рассылка.Добавить(СокрЛП(Адрес));
	КонецЦикла;
	
	Если СписокВложений <> Неопределено Тогда 
		Для Каждого Вложение Из СписокВложений Цикл 
			ОбработкаОбслуживания.СписокВложений.Добавить(СокрЛП(Вложение));
		КонецЦикла;
	КонецЕсли;
	
	ОбработкаОбслуживания.Тема = Тема;
	ОбработкаОбслуживания.ТекстПисьма = Текст;
	ОбработкаОбслуживания.Послать();
	
КонецПроцедуры	