
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого сТР из тОВАР Цикл
		
		//------------------<Проверим на дублирование баркоды>-------------------GtG----04.09.2008
		
		//-------------- ЗАПРОС GTG --------------------------НАЧАЛО
		//Назначение: Ищет баркод по значению ШК
		//
		ТХТ="ВЫБРАТЬ
		    |	ШКПТ.Ссылка КАК Баркод,
		    |	ШКПТ.Владелец КАК ЕИТ,
		    |	ШКПТ.Владелец.Владелец КАК ТОвар,
		    |	ШКПТ.Владелец.К КАК Коэфф
		    |ИЗ
		    |	Справочник.ШКПТ КАК ШКПТ
		    |ГДЕ
		    |	ШКПТ.ПометкаУдаления = ЛОЖЬ
		    |	И ШКПТ.Наименование = &ШК";
		
		Запрос=Новый Запрос;
		Запрос.Текст=ТХТ;
		Запрос.УстановитьПараметр("ШК",Стр.ШК);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		//-------------- ЗАПРОС GTG --------------------------КОНЕЦ
		Если ТЗ.Количество()>1 Тогда
			ЕстьДублиБК=Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	
	Если ЕстьДублиБК=Истина ТОгда
		Предупреждение("В документе есть дублирующиеся баркоды! Проведение запрещено!");
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры
