
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Если РегистрЗакрытияЗаказа = Перечисления.РегистрЗакрытияЗаказа.ЗаказПоставщику или РегистрЗакрытияЗаказа.Пустая() Тогда
		Для Каждого ТекСтрокаТовар Из Товар Цикл
			// регистр ЗаказПоставщику Расход
			Если ТекСтрокаТовар.Количество < 0 Тогда
				Движение = Движения.ЗаказПоставщику.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Товар = ТекСтрокаТовар.Товар;
				Движение.Поставщик = ТекСтрокаТовар.Поставщик;
				Движение.ДатаЗаказа = ТекСтрокаТовар.ДатаЗаказа;
				Движение.Количество = -(ТекСтрокаТовар.Количество);
			Иначе
				Движение = Движения.ЗаказПоставщику.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Товар = ТекСтрокаТовар.Товар;
				Движение.Поставщик = ТекСтрокаТовар.Поставщик;
				Движение.ДатаЗаказа = ТекСтрокаТовар.ДатаЗаказа;
				Движение.Количество = ТекСтрокаТовар.Количество;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли РегистрЗакрытияЗаказа = Перечисления.РегистрЗакрытияЗаказа.ИндивидуальныеЗаказы Тогда
		Для Каждого ТекСтрокаТовар Из Товар Цикл
			// регистр ЗаказПоставщику Расход
			Если ТекСтрокаТовар.Количество < 0 Тогда
				Движение = Движения.ИндивидуальныеЗаказы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Товар = ТекСтрокаТовар.Товар;
				Движение.Поставщик = ТекСтрокаТовар.Поставщик;
				Движение.ДатаЗаказа = ТекСтрокаТовар.ДатаЗаказа;
				Движение.Количество = -(ТекСтрокаТовар.Количество);
				Движение.ЦенаРозн = ТекСтрокаТовар.ЦенаРозн;
			Иначе
				Движение = Движения.ИндивидуальныеЗаказы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Товар = ТекСтрокаТовар.Товар;
				Движение.Поставщик = ТекСтрокаТовар.Поставщик;
				Движение.ДатаЗаказа = ТекСтрокаТовар.ДатаЗаказа;
				Движение.Количество = ТекСтрокаТовар.Количество;
				Движение.ЦенаРозн = ТекСтрокаТовар.ЦенаРозн;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// записываем движения регистров
	//Движения.ЗаказПоставщику.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
