
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма=Заказы.Итог("СуммаФакт");
	
	//---------------<ПРоверка отказов>---------------------------// GtG // 27.08.2012 14:59:34
	ЕстьОшибки=ЛОжь;
	Для Каждого стр из Заказы Цикл
		Если Стр.НомерЗаказа=0 Тогда
			Стр.ТипИсточника=Стр.ЗаказОтПокупателя.ТипИсточника;
			Стр.НомерЗаказа=Стр.ЗаказОтПокупателя.НомерЗаказа;
			Стр.ДатаЗаказа=Стр.ЗаказОтПокупателя.ДатаЗаказа;
		КонецЕсли;
		
		
		
		Если Стр.Сумма<>Стр.СуммаФакт тогда
			Если Стр.ВозвратНеВДеньПокупки.Пустая()=Истина ТОгда
				Сообщить("Не введен возврат по заказу "+Стр.ЗаказОтПокупателя);
				ЕстьОшибки=Истина;
			КонецЕсли;
			Если  Стр.ВозвратНеВДеньПокупки.Пустая()=Ложь Тогда
				Стр.Отказ=Истина;
			КонецЕсли;	
			
			
			
		Иначе
			//???
			
		КонецЕсли;
		
		
	КонецЦикла;	
	
	Если ЕстьОшибки=Истина Тогда
	   ПРедупреждение("Перед записью документа нужно создать возвраты по отказам!");
	   Отказ=Истина;
	КонецЕсли;   
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.УчетДенегВИнтернетАптеке.Очистить();
	Для Каждого Стр Из Заказы Цикл
		
		ДокЗаказ=Стр.ЗаказОтПокупателя.ПолучитьОбъект();
		ДокЗаказ.СтатусЗаказа=Перечисления.ИА_СтатусЗаказа.Оплачен;
		ДокЗаказ.Записать(РежимЗаписиДокумента.Запись);
		
		
		Движение=Движения.УчетДенегВИнтернетАптеке.Добавить();
		Движение.Активность=Истина;
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.ЗаказОтПокупателя=Стр.ЗаказОтПокупателя;
		Движение.Курьер=Курьер;
		Движение.Период=Дата;
		Движение.Регистратор=ЭтотОбъект.Ссылка;
		Движение.Склад=Склад;
		Движение.Сумма=Стр.СуммаФакт;
		Движение.Фирма=Фирма;
	КонецЦикла;	
	
	Движения.УчетДенегВИнтернетАптеке.Записать();
	
	
	
	
	
	
	
	
КонецПроцедуры
