
//НЭТИ Барданов А.Ю. 14.01.2019 ENT-1031
Функция НесопоставленныеТоварыДокумента(СсылкаНаДокумент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УЗ_МелкооптоваяРеализацияТовар.Товар КАК Товар
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.УЗ_МелкооптоваяРеализация.Товар КАК УЗ_МелкооптоваяРеализацияТовар
	|ГДЕ
	|	УЗ_МелкооптоваяРеализацияТовар.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АП.Код КАК КодТовара,
	|	АП.Ссылка КАК СсылкаНаТовар,
	|	АП.Наименование КАК НаименованиеТовара
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвязкиТовараСПоставщиком КАК Связки
	|			ПО АП.Ссылка = Связки.ТоварФирмы
	|			И (Связки.Поставщик = (&ПоставщикСвязок))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвязкиТовараСПоставщиком КАК СвязкиПоОП
	|		ПО АП.КодОП = СвязкиПоОП.ТоварФирмы.Код
	|			И (СвязкиПоОП.Поставщик = (&ПоставщикСвязок))
	|		ПО ВТ_Товары.Товар = АП.Ссылка
	|ГДЕ
	|	Связки.КодТовараПоставщика ЕСТЬ NULL
	|	И СвязкиПоОП.КодТовараПоставщика ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	ПоставщикСвязок = Справочники.Поставщики.НайтиПоКоду(582);
	Запрос.УстановитьПараметр("ПоставщикСвязок", ПоставщикСвязок);
	НесопоставленныеТовары = Запрос.Выполнить().Выгрузить();
	Возврат НесопоставленныеТовары
КонецФункции

//НЭТИ Барданов А.Ю. 14.01.2019 ENT-1031
Функция НесопоставленныеТоварыОбъекта(ОбъектДокумент) Экспорт
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АП.Код КАК КодТовара,
	|	АП.Ссылка КАК СсылкаНаТовар,
	|	АП.Наименование КАК НаименованиеТовара
	|ИЗ
	|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвязкиТовараСПоставщиком КАК Связки
	|		ПО АП.Ссылка = Связки.ТоварФирмы
	|			И (Связки.Поставщик = (&ПоставщикСвязок))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвязкиТовараСПоставщиком КАК СвязкиПоОП
	|		ПО АП.КодОП = СвязкиПоОП.ТоварФирмы.Код
	|			И (СвязкиПоОП.Поставщик = (&ПоставщикСвязок))
	|ГДЕ
	|	Связки.КодТовараПоставщика ЕСТЬ NULL
	|	И СвязкиПоОП.КодТовараПоставщика ЕСТЬ NULL
	|	И АП.Ссылка В(&Товары)";
	
	ПоставщикСвязок = Справочники.Поставщики.НайтиПоКоду(582);
	Запрос.УстановитьПараметр("ПоставщикСвязок", ПоставщикСвязок);
	Запрос.УстановитьПараметр("Товары", ОбъектДокумент.Товар.ВыгрузитьКолонку("Товар")); 
	
	НесопоставленныеТовары = Запрос.Выполнить().Выгрузить();
	Возврат НесопоставленныеТовары
КонецФункции

//НЭТИ Барданов А.Ю. 14.01.2019 ENT-1031
Функция ПоставщикиДляПроверкиСвязок() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Поставщики.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Поставщики КАК Поставщики
	|ГДЕ
	|	Поставщики.Код В(&Коды)";
	КодыПостащиковКПроверке = Новый Массив;
	КодыПостащиковКПроверке.Добавить(3055);  
	Запрос.УстановитьПараметр("Коды", КодыПостащиковКПроверке);
	Поставщики = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат Поставщики
КонецФункции