#If SERVER Then
Функция ОМ12_СебестоимостьСП(МСЗСПартиями,ГраницаЭтотДок,ФСс,ССс) Экспорт
	// Назначение:
	// получает данные о себестоимости товара с партиями (ЖНВЛС)
	//--------------------------------------------------------------------------------
	СЗСПартиями= Новый  СписокЗначений;
	СЗСПартиями.ЗагрузитьЗначения(МСЗСПартиями);
	
	ТХТСП="ВЫБРАТЬ
	      |	ПартииЖНВЛСОстатки.Партия КАК Партия,
	      |	СУММА(ПартииЖНВЛСОстатки.КолвоОстаток) КАК Колво,
	      |	СУММА(ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток) КАК СуммаЗакупСНДС,
	      |	СУММА(ПартииЖНВЛСОстатки.СуммаНДСЗакупОстаток) КАК СуммаНДСЗакуп,
	      |	СУММА(ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток) КАК СуммаРознСНДС,
	      |	СУММА(ПартииЖНВЛСОстатки.СуммаРознНДСОстаток) КАК СуммаРознНДС,
	      |	ПартииЖНВЛСОстатки.СтавкаНДС КАК СтавкаНДС
	      |ИЗ
	      |	РегистрНакопления.ПартииЖНВЛС.Остатки(
	      |		&ГраницаЭтотДок,
	      |		Склад = &Склад
	      |			И Фирма = &Фирма
	      |			И Партия В (&СписокПартий)) КАК ПартииЖНВЛСОстатки
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	ПартииЖНВЛСОстатки.Партия,
	      |	ПартииЖНВЛСОстатки.СтавкаНДС";
	
	  Запрос= Новый  Запрос;
	
	Запрос.Текст=ТХТСП;
	
	Запрос.УстановитьПараметр("Фирма",ФСс);
	Запрос.УстановитьПараметр("Склад",ССс);
	Запрос.УстановитьПараметр("СписокПартий",СЗСПартиями);
	Запрос.УстановитьПараметр("ГраницаЭтотДок",ГраницаЭтотДок);	   
		   
	Рез=Запрос.Выполнить();	   
	
	ТЗСП=Рез.Выгрузить();
    Возврат ТЗСП;
 КонецФункции
 #КонецЕсли
//============================================================================ GtG ===

Процедура ОМ12_КопияДвиженийПартийВРегистрПоСтавкамНДС(ДокументОбъект,ДвиженияПартий)Экспорт
	  //ДокументОбъект - документ объект, который проводится
	  //ДвиженияПартий - Таблица значений полученная путем выгрузки в нее движений по регистру партий
	  //                 Движения партий на момент использования этой процедуры желательно записать   
	  //------------------------------------------------------------------------------------------------
	 	  
	  ДвиженияПартий.Свернуть("Период,Регистратор,Активность,ВидДвижения,Склад,СтавкаНДС,Фирма,ВидОперации","СуммаЗакупСНДС,СуммаНДСЗакуп,СуммаРознСНДС,СуммаРознНДС");
      ДокументОбъект.Движения.ОстаткиПоСтНДСПоСкладам.Загрузить(ДвиженияПартий);
	  ДокументОбъект.Движения.ОстаткиПоСтНДСПоСкладам.Записать();
	  
КонецПроцедуры
